.class public Lcom/android/settings/device/MiuiMemoryCard;
.super Landroid/widget/FrameLayout;

# interfaces
.implements Landroid/view/View$OnClickListener;


# annotations
.annotation system Ldalvik/annotation/MemberClasses;
    value = {
        Lcom/android/settings/device/MiuiMemoryCard$MemoryInfoCallback;
    }
.end annotation


# static fields
.field private static final short:[S


# instance fields
.field private mCallback:Lcom/android/settings/device/MemoryInfoHelper$Callback;

.field private mFragment:Lcom/android/settings/dashboard/DashboardFragment;

.field private mView:Landroid/view/View;

.field private totalText:Landroid/widget/TextView;


# direct methods
.method static bridge synthetic -$$Nest$fgettotalText(Lcom/android/settings/device/MiuiMemoryCard;)Landroid/widget/TextView;
    .registers 1

    .line 0
    invoke-static {p0}, Lcom/android/settings/device/MiuiMemoryCard;->K͝h̶͗ḁ̸̶̷̸̝̭̪͈͕̠̹̭̗͚̃̂̈́͐̈́̈́̈́͂͑̌͌͜ư̝̹̜̖̫̪̿͗̈́Ķ̷̸͚̦̮͚͓͚̼̘̮͗̌̂͆͐̾̂̀̓͜͝͝oK̸͓̹̰͓̮̝͓͚̗͈̭̺̞̹͎͈̲̯̙̦̈́̏́̈̄̄̋̎̒̅͌͌̔̉̽͒̃͝K͂n̢̗͗̑k̶̭̺Kn̶̡̲͋̅̐̿̌̔̇̿c̵̘̺̔a̸̸̤̘͙̪̪͎͗̍̽̂̐̋̈́̚ã̭̙̭̲̱̒͑̌̿͋̇͌̂͆̌̑͜͠ã̷̵̗̥̟͇̖̫͖̪̮̠̯̬͚̼̐̄̈́̂͌͊̎̔̃̋̂͜͝P̧͚͈͖̭̘̞̪̙̦̈́͗̂̂̎͒̂͑͆͋̅͝e̴̢̫å̼̌͐͘P̸̴t̵̵̸̷̢̛͈̜͎͖̙̫̭͉̭̭̞̂̅̅́͗̈͑͂̀̅̋̌̈́͐̃̾͌̂̋̚͜͜͠͝Kp̸̢̧͕̘̮̫̝͋̈̅p̮(Ljava/lang/Object;)Landroid/widget/TextView;

    move-result-object p0

    return-object p0
.end method

.method static constructor <clinit>()V
    .registers 52

    const v0, 0x72

    new-array v0, v0, [S

    fill-array-data v0, :array_c

    sput-object v0, Lcom/android/settings/device/MiuiMemoryCard;->short:[S

    return-void

    nop

    :array_c
    .array-data 2
        0x43as
        0x41es
        0x402s
        0x41es
        0x43bs
        0x41es
        0x403s
        0x412s
        0x421s
        0x412s
        0x405s
        0x404s
        0x41es
        0x418s
        0x419s
        0x44ds
        0x457s
        0xc30s
        0xc14s
        0xc08s
        0xc14s
        0xc30s
        0xc18s
        0xc10s
        0xc12s
        0xc0fs
        0xc04s
        0xc3es
        0xc1cs
        0xc0fs
        0xc19s
        0xa19s
        0xa14s
        0xa0cs
        0xa1as
        0xa00s
        0xa01s
        0xa5as
        0xa06s
        0xa01s
        0xa1as
        0xa07s
        0xa14s
        0xa12s
        0xa10s
        0xa2as
        0xa1cs
        0xa1bs
        0xa13s
        0xa1as
        0xa2as
        0xa1cs
        0xa01s
        0xa10s
        0xa18s
        0xa2as
        0xa1es
        0xa14s
        0xa06s
        0xa1ds
        0xa1cs
        0xa3es
        0xa32s
        0xa30s
        0xa73s
        0xa30s
        0xa34s
        0xa28s
        0xa34s
        0xa73s
        0xa3es
        0xa31s
        0xa38s
        0xa3cs
        0xa33s
        0xa30s
        0xa3cs
        0xa2es
        0xa29s
        0xa38s
        0xa2fs
        0xa73s
        0xa3cs
        0xa3es
        0xa29s
        0xa34s
        0xa32s
        0xa33s
        0xa73s
        0xa0es
        0xa09s
        0xa12s
        0xa0fs
        0xa1cs
        0xa1as
        0xa18s
        0xa02s
        0xa10s
        0xa1cs
        0xa13s
        0xa1cs
        0xa1as
        0xa18s
        0x8des
        0x8d0s
        0x8ccs
        0x8eas
        0x8d6s
        0x8dds
        0x8d4s
        0x8dbs
        0x8dbs
        0x8d0s
        0x8d9s
    .end array-data
.end method

.method public constructor <init>(Landroid/content/Context;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1}, Landroid/widget/FrameLayout;-><init>(Landroid/content/Context;)V

    invoke-static {v0}, Lcom/android/settings/device/MiuiMemoryCard;->h̷̷̷̺͕͎͕͖̥̫̠̱͙̗̥̀̅̂͋̋͒̂̏͝͝͝ơ̸̛̯̼̌͗k̸͈̝̹͒K̶͈͚̖B̵̷̷̥̥̈͘P̛̈́͘aa͎̹͓ȩ̭͖͗̑̍̚Ke̵̶̷̶̬͈͉̖̤̺̫͖̲̎̋̂̀̋̈͗͂̐͘ͅoc̷͈̭̓̈́̽͊̌̈́̆͊͋̋̀̄͝ȗ̧̢̧̧̧͎̭̝̗̻͚͇̯̗̺͚́̇̐̎̂̌̀͒̉́̂͝͠ç̸̶̶̴̢̧̛̩͈̫̯̺̗̭̥̫̙͈͙̜̘͎̙͓͑̂̑͋̑̋̋͒̌͂̎̾̌͋͊̇̿̎̅̈́a̵̵̸̵̴̶̧̫̯͎͚̙̫̱̯͎͒̂̈́͗̀̑̃̑͗̔̑̈͌̔́̈̚͜͜l̃̀ţ̛͈̗̱̤͒̌̔̀͜͝a͓̹̮̫̥̫͊̀̽̒P̫̠̋͌ķ͚͉͋̿͆̓h̶̵̶̸̢̡̨̰̖̩̫̤̱̗̦̩͚̥̅̌͐̈͗͗͋̂ä̶́͒̂(Ljava/lang/Object;)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;)V
    .registers 54

    move-object/from16 v2, p2

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1, v2}, Landroid/widget/FrameLayout;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;)V

    invoke-static {v0}, Lcom/android/settings/device/MiuiMemoryCard;->h̷̷̷̺͕͎͕͖̥̫̠̱͙̗̥̀̅̂͋̋͒̂̏͝͝͝ơ̸̛̯̼̌͗k̸͈̝̹͒K̶͈͚̖B̵̷̷̥̥̈͘P̛̈́͘aa͎̹͓ȩ̭͖͗̑̍̚Ke̵̶̷̶̬͈͉̖̤̺̫͖̲̎̋̂̀̋̈͗͂̐͘ͅoc̷͈̭̓̈́̽͊̌̈́̆͊͋̋̀̄͝ȗ̧̢̧̧̧͎̭̝̗̻͚͇̯̗̺͚́̇̐̎̂̌̀͒̉́̂͝͠ç̸̶̶̴̢̧̛̩͈̫̯̺̗̭̥̫̙͈͙̜̘͎̙͓͑̂̑͋̑̋̋͒̌͂̎̾̌͋͊̇̿̎̅̈́a̵̵̸̵̴̶̧̫̯͎͚̙̫̱̯͎͒̂̈́͗̀̑̃̑͗̔̑̈͌̔́̈̚͜͜l̃̀ţ̛͈̗̱̤͒̌̔̀͜͝a͓̹̮̫̥̫͊̀̽̒P̫̠̋͌ķ͚͉͋̿͆̓h̶̵̶̸̢̡̨̰̖̩̫̤̱̗̦̩͚̥̅̌͐̈͗͗͋̂ä̶́͒̂(Ljava/lang/Object;)V

    return-void
.end method

.method public static B̸̸͙̯̞̹̥̫͚̿͌̂̍̀̉̈́͝a̵͊o̸̯̤̙̦̎͂̈́̍͂̾͜͝ó̴̧̧̪̫͈̤̺̗̿̅ḁ̴̘̃â̢̢̖̻̘̋̀̇̂̈́n̶̡̢̛̞͚͈̮̙͖͚͎̏͊̍̄́̋͂̍̎̚͝a̷̸̛̦̪̺̰̺̱̘̙͗̈̈̏͗̈́͗̿͂̀̅̑͘͠u̗̭̪͈͗͑̏̈́c̸͇̫̫̻͌̔̽͗a̸̷̶̸̴̸̶̶̸̸̶̶̷̸̢̧̧̛̖̯̗͕̘̠̖͕̦̯͕̱͙̭̯̟͚̯̱̫̩̰̯̙̲͙͕͓̖̺̙̗͈̞͂̂̌̈́͗͊̑͗́̃̎̅͊̄̿̌̌̈̃̋̀̆͌͐̅̌̈̎̏͂̿̍͌̅̅̀̑̍̓̿̋͐̅̈́̋͘͘̕̚͜͜͜͜͜͠͝͝͝͝K̶̷̸̶̠͕̠̦̖͚̼̺̐̂͘̚oņ̹̩͋̍͂͝ȏ̸̗̦̖̘͓̦̥̰̱̌̿͘͜͜͠͝o̢̐̆Pḁ͋͘(Ljava/lang/Object;)Landroid/content/Context;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_b

    check-cast p0, Landroid/widget/FrameLayout;

    iget-object v1, p0, Landroid/widget/FrameLayout;->mContext:Landroid/content/Context;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static K͝h̶͗ḁ̸̶̷̸̝̭̪͈͕̠̹̭̗͚̃̂̈́͐̈́̈́̈́͂͑̌͌͜ư̝̹̜̖̫̪̿͗̈́Ķ̷̸͚̦̮͚͓͚̼̘̮͗̌̂͆͐̾̂̀̓͜͝͝oK̸͓̹̰͓̮̝͓͚̗͈̭̺̞̹͎͈̲̯̙̦̈́̏́̈̄̄̋̎̒̅͌͌̔̉̽͒̃͝K͂n̢̗͗̑k̶̭̺Kn̶̡̲͋̅̐̿̌̔̇̿c̵̘̺̔a̸̸̤̘͙̪̪͎͗̍̽̂̐̋̈́̚ã̭̙̭̲̱̒͑̌̿͋̇͌̂͆̌̑͜͠ã̷̵̗̥̟͇̖̫͖̪̮̠̯̬͚̼̐̄̈́̂͌͊̎̔̃̋̂͜͝P̧͚͈͖̭̘̞̪̙̦̈́͗̂̂̎͒̂͑͆͋̅͝e̴̢̫å̼̌͐͘P̸̴t̵̵̸̷̢̛͈̜͎͖̙̫̭͉̭̭̞̂̅̅́͗̈͑͂̀̅̋̌̈́͐̃̾͌̂̋̚͜͜͠͝Kp̸̢̧͕̘̮̫̝͋̈̅p̮(Ljava/lang/Object;)Landroid/widget/TextView;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_b

    check-cast p0, Lcom/android/settings/device/MiuiMemoryCard;

    iget-object v1, p0, Lcom/android/settings/device/MiuiMemoryCard;->totalText:Landroid/widget/TextView;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static a̫c͋p̧̟̦͘͝ā͘ņ̶̸̶̢̛̺̙̮͈̗̱͎̫̠̱̼͕̞͕̗̞̲̯̭̠͎̗͊̈́̀̾̈̃̎́̋̂͌́̇̔͋͘̚͜͝͠͠u̱̪h̶͓̗̼̗̭p̧͙̱̮͓̐͜a͉̗͎͌͋̕͝o̾o͎ā̺͎͑̂̈̐̓ǫ̪̝̱͈̾̚â̆̈̋͜ǫ̮̤͜ć̠̜̜̞̱̥̻̩̩̝̩̭̖̝͈̄̈́̏̄̔̑̾̍̋͑̚̕͝͠͠ȇö̸̸̧̧̰͎͕̘̫̹̮̮̎͑̌͒͜o̴̢͙̦̾P̵̤̖͖͕̗̋̏̋̊͐̅̌͝͠͝Ķ̷̷̧̛̹̭͕̞̮͙̗̻̭̖̑̾̆̑̑̒͗̈́̒͘͜͝a͠͠ͅK̢̨̯̝̾̔̀̂̏ä̸̷̦̎̆ǎ̋l͙͓͎̈p͐t͓̞͗͌K̵̝̪̘͒́lẗ̸͎̺͚͕̪̥̦͗̋̈̋̈͝e̸͜a̺̫B̛̗̱̺͒̔̂ͅ(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->h̸̸̵̶̢̛̛̛̛̛̖̦͇̺͎̟͙̥̗̞̼͈̥̙͕̘̾͂͌͂̈́͗̂͒̂̂̈̄̋̋̇̎͗̽͗̐̃̋͘̕͝͠͠k̫̺̔͌ȟ̯͚͎̠̠̗͈̜͂̈̈́̆̽̈͌̑͆̾̚͜lu͉̹͊tẽ̤͎̄h̴̺̦̥̦̲̃͋͒͘͝͝ó̸̶̢̧̯̦̺͎͕̙͚̖͈̺͖͐̃̃̎̐̈́͂̾̋̂̈̋͑̑̃͘͜K̻͉t̷̵̷̪̱̂̌̐̋̃̂̃͜a̹͎̱̹̱͌̍̍̓̈́̽̕h̨͋K̻͙̦t̸̷̗̯̮͙͚̝͓̭͓̼̀̈́͋͗̿̋̀̂͘̚͜͝P̸̶̵̢̘͉̗̗̘̺̗̱̓̔̊̈́͗̓̈̋͂̂̑̊̇̆͠͝Kae̹͚̫̙̋̅̃n̸̴̫͈̫̫̭̭̖̼̯̄̂͗͗̂͌̓̋͘ḁ̷̴̴̶̶̢̛̗̗̱̮̫̦̘̫̗̱͈̫͊̂̌̿̋͌̀̾̑̂̽̔̅͘͘͝͠([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_b

    invoke-static/range {p0 .. p0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̫̤͙̦̂̃̄̍͘͜͠c̴͎̫̬̠̞̋̈̈́̀͐͜͝͠͠͝K̵̛̼͋̍̌n̵̸̻̠͕̥̂ä̘̬̥͌̏͝oa̴̶̸̧̩̯͈̋̈́͝c̵̛̩͓̗̹̺̦͉̖̼̯̋̑͌̎̿̋̔͒̿̋̌͌͘͝a̛̩̹̹͐̄̓̅͗B͖͓̫͉̔͌oa̤͚̋̂͜ẖ͙a̸̛̛̞̦̫̭̿̋̌͌͋̂̿͘͠K̴̸̷̸̛̦̯̹̺̘͇͎̦̭̉͂̎̏̾̽͗͆̅̂͑̾͗̈́̅̈́̑͘̚͘t̷̷̵̶̶̶̴̨̧̗̗̘͕̰͈̠̱̠͈̺͉͇͓̙̫̮͕̪͎͎̗̝̼͊̿̑̈̋̌͂̽͗̋̍͐̆̈́̃͗̑͗̑̈́͌̒̀̀̌̓͂̄̐̑͒̚͘͜͜͜͜͠͠K̠͈̫̻̲̫͂̎̋̂͒͠a̮̤̫̪̎̃͜o̧u͇P͉ḻ̷̺̲̫̺̦̫̗̺̫̫̫̻̎̂́̈͌͐̽͌͊͗̀̌̽͘͜(Ljava/lang/Object;)I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static a̸̢͉͎͌͂̑͗̆͒̈͘͝͝KḴ̶̶̡̙̫̤̗̰̗͕̋̂̌̀̂̋͐̔̐̐͗͗͝͠ą̵̶̴̵̶̫̺͈̘͇̩͈̭͓̫̺͕̮̫̫̫̮̘̫̫͐͌̀͗̿̊̉͌̐͐̉̇͋̑̚͘̚͜͜͝͠͝͝t̫̏̈́͌̌͜͠͝͠c̝̹͎̭̹͈̠̫̹̰̫̗̥̋͌̇͂̎̋̉̀̈́̈͑̔͌̚͘͜͠a͇̼̱̎̏̇́͘t̴̮̲̪̱́͐̽̃͗͗ò̸̷͈͉͉̔̏͌ų̶̨̫̯̗͎͎͙̯͕̘͚͕̱͑͒̌̋̌͗͋͂́́̀͘͘͜͜͝͠ü̴̧͈͈̺̱̗̍̌͜t̴̸̺̗̹͎̺͕̞͌͌̈́͑͊͌͊̌̅͘̚͜͠a̝̯̘͘ǒ̾̓p̸̸̶̸̖̯̜̲̘͎͚̹͚̫̦̗̻̥͑͗͊̑͑̄̓̍̒̑̄̈́̅͆̃̿̌͜͜͝n̛̫̪̹͕̾͐̋̂̽́̎au͜P͎̖̍()I
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_b

    invoke-static {}, Lmiui/util/DeviceLevel;->getMiuiLiteVersion()I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static a͚̺̺̮̔n̷̗̓̚P̺̫̥̫͚̎̏̋͂̚͜ȩ̴̸̢̛̖͚̤̝͚̤͚͈̫̭͉͙͎̫͎̝͈̲͖̂̌̈́̂͌̋͆͐̈͌̈͌̈́̉̏̏͒̆̈̚̚͜͝͠͝͝͝K͓̿̌̂o̟p̡̡̢̫̩͎̝̖̹͈̖̮͊̈̆̋́͆̏̈̅͗͘Ḱ̨̧̛̛̰̠͓̖̫̪̭͎̘͙͓̺̱̟͉͙̺̋͗̋̃͌̂̎͗̎͌̍͂̑̈́͒̆̆͘͜͜͜͜͝͝ͅK̸̷̭͎̫̮̩̽̈͌͘ő̢̫̫̦̭̠̠͇̮̺̯̮̺̺͆͋̾̅̊́͊̋̃͌͗̚͘͠͝ȩ̷̭̦̱̻̲̯̩͎̾̈́̀̈͋͌͌͜͜͜͠K̸̛̋̊̈̉͘͝u͎͇͋K̎̄͗̔͑́̈͘͝͝B̸̵͓̆̈́͝͝͝K̸͘a̲̬͂ă̧̯͓̩͋̚͝͠ck̶̷͎̭̱̰͕̺̦̘̗̃̇̓̌͒͝͝͠͝p̸̧̱͉̦̂͜͝(Ljava/lang/Object;)Lcom/android/settings/dashboard/DashboardFragment;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_b

    check-cast p0, Lcom/android/settings/device/MiuiMemoryCard;

    iget-object v1, p0, Lcom/android/settings/device/MiuiMemoryCard;->mFragment:Lcom/android/settings/dashboard/DashboardFragment;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static â͗̈́͝ǹ̸̸̸̬̦̰̯̺̙̫͉̘̙̫̻̫̑̈̄̔̑͋̍̐̅͗̋̈́͂͋̄͗͐͑͑̂͝͝͠a̶̵̧̠͉̫͉̬̯̤͂͐́̃̑̈́̈́̂̌̆̈͘͜͜͝͝lu̽l̚l̝̩͜p̶̢͎̓͌͑̚Ḵ͚̪̈́͌ǎB̵̹̿̿a̴̧̛̰̘͎͐̂̑̍͜͠͠u̫̽͗ţ̴̴̸̧̢̞̫͚̟̫̙̫̻̰̮̘̫͎̯̦̺͎͚̱͎̌͗͊̋̃͑͂͌̿͌͋͗̈́̌́͐̋͘͘͜͝͝t̷̷͈̗̫̦̪̲̏̑̆̊̑̃̌͋̒̂͜B̵̷̹̺ḛ̴̫̋̿å̫̺͉ã̷̸̧̭̫̫͙͈̂̋̋̅̕P̄̏͝ť̸̶̡̙̘̘̞̂̀̋͝c̵͉̦̎̈́̋̎̍͂͜͜ò̸̧̢̘͊͌̔̋͘͜͝B̧̦̤̯̺̑̈́̏͘ẗ̴̷̻͈́̅̎̈́B̡͈̗̱͎͎̍̂͋͊͌̃̋̃͝͠()I
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_9

    sget v0, Lcom/android/settings/R$id;->summary:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static h̷̷̷̺͕͎͕͖̥̫̠̱͙̗̥̀̅̂͋̋͒̂̏͝͝͝ơ̸̛̯̼̌͗k̸͈̝̹͒K̶͈͚̖B̵̷̷̥̥̈͘P̛̈́͘aa͎̹͓ȩ̭͖͗̑̍̚Ke̵̶̷̶̬͈͉̖̤̺̫͖̲̎̋̂̀̋̈͗͂̐͘ͅoc̷͈̭̓̈́̽͊̌̈́̆͊͋̋̀̄͝ȗ̧̢̧̧̧͎̭̝̗̻͚͇̯̗̺͚́̇̐̎̂̌̀͒̉́̂͝͠ç̸̶̶̴̢̧̛̩͈̫̯̺̗̭̥̫̙͈͙̜̘͎̙͓͑̂̑͋̑̋̋͒̌͂̎̾̌͋͊̇̿̎̅̈́a̵̵̸̵̴̶̧̫̯͎͚̙̫̱̯͎͒̂̈́͗̀̑̃̑͗̔̑̈͌̔́̈̚͜͜l̃̀ţ̛͈̗̱̤͒̌̔̀͜͝a͓̹̮̫̥̫͊̀̽̒P̫̠̋͌ķ͚͉͋̿͆̓h̶̵̶̸̢̡̨̰̖̩̫̤̱̗̦̩͚̥̅̌͐̈͗͗͋̂ä̶́͒̂(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Lcom/android/settings/device/MiuiMemoryCard;

    invoke-direct {p0}, Lcom/android/settings/device/MiuiMemoryCard;->initView()V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method private initView()V
    .registers 55

    move-object/from16 v3, p0

    new-instance v0, Ljava/lang/StringBuilder;

    invoke-direct {v0}, Ljava/lang/StringBuilder;-><init>()V

    invoke-static/range {}, Lcom/android/settings/device/MiuiMemoryCard;->n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S

    move-result-object v42

    const v45, 0x1aaafe

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝()Ljava/lang/String;

    move-result-object v41

    invoke-static/range {v41 .. v41}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v41

    xor-int v45, v45, v41

    const v43, 0x1ac90f

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ơ̶̷̴̧̧̟̠̘͎͖̬̯̈̈͋͌̏̈́̈̅͌̿͗͊͝ḁ̷̷͈͎̪̺̫̱̹͈͙̮̲͋̄̈́͋̍̌͋̿͜͜͝͠͝͝ͅh͝h̴̷̸̸̷̰͈̗̪̺̯̫̭͌̈͗̌͌̑̅̇́̄͌̈́̾̌̾̍̿͊̀͑͜͠ŏ͕͊͋o̢̮̱̹͐͗̾̌̈̚͠͝͝ǎ̼̯̬̤͎̩̼̭̲̗͚̪̖̥̬͕͒̌͋̈̏̾͋̃́̃̋͜͝͝a̧͊̐͝t̨͉̀̒̌̎ļ̴͎͚̙̺̦͗̇͊̅̈́̃͑̓̿́̑͘̚͜a̱̫̋̚͜͜k̫̟ẽ̸̴̸̵̫̖̜̦̎̔͑̈́̿̚t̷̶̛͚̙̘̫͉̘̔̍̆̉̌͒̏̂̽͘u̲̙͎̎̽͒͂c̢̫̯̭̈́k̭ã̑̀ư̷̸̸̹̖̦͎̲͉̦̫̺̪̹̯̠̫̲̤̑͋͊̊͌̒̍̄͗̀̑̋̽̅͌͋̂͌̐͌̑̂̒͆̑̂͐́̆̽͠͠k()Ljava/lang/String;

    move-result-object v41

    invoke-static/range {v41 .. v41}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v41

    xor-int v43, v43, v41

    const v44, 0x1ab635

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->uỡ̶̸̩̲̺͜͠P͈k͚͉͑̑̈͌̃͗̎̌̅̎͜t̷̂̎͑̋͂͝c̴̭̈́c̢̥͉̖̫̪̭̥̫̫̟͚͓̹͗̆̋̂̃̔͆̄̃̆̀̽͜͠͝͝PB̸̢̰͚̆͗̔̎̂̃̋̌͠ą̸̷̡̯̫͕̹͙̹̫̗̺͕̯͕͌̈́͂͌ë̯́ä̧́̍l̸̷̵̷̴̨̧̛̙͕͚̫͚̘͉̗̹̙͎̯̮̙͈̯͉͚̗̼͚̰̮̗͇̥̦̠̑̌̈̒̆̋̂̃̅̐̑̑͗̽̾͊̋̎̑̚͜͜͝͝͠͝ͅo̵̵̸̸̢͙̪̫͎͚̍̾̐̍̈͌̈̈̐͑ȃ͉o͚͜͠k̴̘̯͎͎͉̑̌̂̈͊͌͜K̸̛̹͙̗̉̈́̈nK̷̴̸̛̯̥͈̹͈̤̫̱͉̠͉̯̮͋͗̂͌̇̔̽̋̃́̍͋̆̉̏͌̈̍̈́́́̕̕͘̕͝͝͠͝͝ͅȃ̺̯͉͌͋̈́K͈̗͚͕͓̫͕̊͗̽̿͋͜()Ljava/lang/String;

    move-result-object v41

    invoke-static/range {v41 .. v41}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v41

    xor-int v44, v44, v41

    invoke-static/range {v42 .. v45}, Lcom/android/settings/device/MiuiMemoryCard;->a̫c͋p̧̟̦͘͝ā͘ņ̶̸̶̢̛̺̙̮͈̗̱͎̫̠̱̼͕̞͕̗̞̲̯̭̠͎̗͊̈́̀̾̈̃̎́̋̂͌́̇̔͋͘̚͜͝͠͠u̱̪h̶͓̗̼̗̭p̧͙̱̮͓̐͜a͉̗͎͌͋̕͝o̾o͎ā̺͎͑̂̈̐̓ǫ̪̝̱͈̾̚â̆̈̋͜ǫ̮̤͜ć̠̜̜̞̱̥̻̩̩̝̩̭̖̝͈̄̈́̏̄̔̑̾̍̋͑̚̕͝͠͠ȇö̸̸̧̧̰͎͕̘̫̹̮̮̎͑̌͒͜o̴̢͙̦̾P̵̤̖͖͕̗̋̏̋̊͐̅̌͝͠͝Ķ̷̷̧̛̹̭͕̞̮͙̗̻̭̖̑̾̆̑̑̒͗̈́̒͘͜͝a͠͠ͅK̢̨̯̝̾̔̀̂̏ä̸̷̦̎̆ǎ̋l͙͓͎̈p͐t͓̞͗͌K̵̝̪̘͒́lẗ̸͎̺͚͕̪̥̦͗̋̈̋̈͝e̸͜a̺̫B̛̗̱̺͒̔̂ͅ(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v42

    move-object/from16 v1, v42

    invoke-static {v0, v1}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    invoke-static {}, Lcom/android/settings/device/MiuiMemoryCard;->a̸̢͉͎͌͂̑͗̆͒̈͘͝͝KḴ̶̶̡̙̫̤̗̰̗͕̋̂̌̀̂̋͐̔̐̐͗͗͝͠ą̵̶̴̵̶̫̺͈̘͇̩͈̭͓̫̺͕̮̫̫̫̮̘̫̫͐͌̀͗̿̊̉͌̐͐̉̇͋̑̚͘̚͜͜͝͠͝͝t̫̏̈́͌̌͜͠͝͠c̝̹͎̭̹͈̠̫̹̰̫̗̥̋͌̇͂̎̋̉̀̈́̈͑̔͌̚͘͜͠a͇̼̱̎̏̇́͘t̴̮̲̪̱́͐̽̃͗͗ò̸̷͈͉͉̔̏͌ų̶̨̫̯̗͎͎͙̯͕̘͚͕̱͑͒̌̋̌͗͋͂́́̀͘͘͜͜͝͠ü̴̧͈͈̺̱̗̍̌͜t̴̸̺̗̹͎̺͕̞͌͌̈́͑͊͌͊̌̅͘̚͜͠a̝̯̘͘ǒ̾̓p̸̸̶̸̖̯̜̲̘͎͚̹͚̫̦̗̻̥͑͗͊̑͑̄̓̍̒̑̄̈́̅͆̃̿̌͜͜͝n̛̫̪̹͕̾͐̋̂̽́̎au͜P͎̖̍()I

    move-result v1

    invoke-static {v0, v1}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    invoke-static {v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ae̮͚͚̭̰͐̔̋ņ̮̝̱̲̫͈̈́͗̅K̮̗̭͒͌̎̋ȃ̧̛̺͚̩̮͓͙͇͚̦̇̀͒͆͜͝K̸̸̸̨̹̗̯̭͎̫̞̗̼̅̏͌̇̈́͋͗͆͗̈́͑̇̒̈͘̕͝͝͠p̷̷̵̸̢̢̠̹̘͉̈̈́̏̿̃̎̀̿̆͘ẗ̸̛̫́͋͑̑p̧̢̖̮͗̆ãPk̵̸̞͉̗̗͉͚̥͕̲͚̼͕̪̗͈̃̿̋̾̂͂̎̈̿̾̃́͐̑̿̀̀̋̂̅̐̂̂̈́̎̂̑͗̊̋́̚͜͜͝͝͝͠k̿͜ṯ̪̫̄̈́̚l̯̆́͠l̸̲̂͑̄͗́o̧B̫͚͌̂̑͋̚ä̹B̗͚̤̘̂͊̂̿͋̋͝K͚̋a̸̷̵͚̞̺̘͙̭̤̺͒̈͆̋̾͑͠a̸̧̛̘̹͈̱̠̍͌̌BK̶͋e̱ę̸̛̛̫̘̥͚̫͗̒̓̌͗̂̈́͝͝ḩ̵̸̧͎͚͎͇̯̌͐̑̔̌͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v0

    invoke-static/range {}, Lcom/android/settings/device/MiuiMemoryCard;->n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S

    move-result-object v15

    const v18, 0x1aa301

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->t̢̚K̩̘̗̏͆̈́Pḩ̻tk͐e̶̵̢̨̨̫̯̮̫̗̯̞͑̈͌̇́͋́̔̅͐̈́̋̑͗̃͜͠ã̸̪̼̖͂͑͊̈a͉̘̩͑̔͝o̶̷̧̥̥̹͎͐͗̃̊͂͜e̍̽̔̆h̚ţ͎̙̘͐͐̋̂̌̏̎͑̚l̼̪̾͋͋͝ǎ̛̯͂̈̈K̠͉̗͈̘̎͋̂̎K̘lc̸̶̛̬̯̗̫̮̦̆̄̎̈́̑p̸̸̛̛̖̙͚̲̼͕̘̰̫͚͈̂̿̑͆͋́͋̀̌̿̂̚͜͝͝ö̵̶̢̧̢̢̩̲̲̯͎̠̻͙̅̽̈́̈́͗͊̑̅̌̌͜͝͝a͘K̵̷̨̡̦͎̟̰̹͓̙̠̄̎̄̾̀̔̋̌u̶̗̘͗͗͜͠a̸̸̷̢̢̺̘͈̩̯͋̑̋͘h̶̢̯͈̯̫͌̌̈̋͜a̸̫ä̹̭̹̙̱́̈͆̆̌̌͜͝B̶̨̧̛̯̟̺͕̦̺̂̏̋̌̈́͊̅͑̀͘͜͝͝()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v14

    xor-int v18, v18, v14

    const v16, 0x1ab333

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->p̵̧̛͇̪̰̱̿͘͝͝a̗a̸̫͓̯̭̪̾̀̐̉͝k̸̷̢͚͉͓̭̘̗̥̖̺̫̫͚̪̙̼̬͂̎̋̂̏͐̎̈͐͐̈́̚͘̚̚͝ă͈̎k̡̞̺Ḱ̸̷̶̸̙͈͎̤̤̭̼̹̐͗̕͜͝K̃̄͐͜aP̖͗̏͝͝n͓͚̜̯̭̥͓̙̫̥͈̂͗͌̈́̌̌͘͜͝a̶̵̸̶͖͚̫̋͐̑̾͘͝a̩͆̈́͗l̵̴̶̲̹͇̫͚̻͚̫͐̑̂̅̾̈́̈́̒̂̋ͅţ̷̨̻̮͈̫̯͖̫̹̀̎̌͊̂̀͒́̌̎̋͑̌̚̚̚͜͠o̸̴̢̦͚̤͉̲̫̗̯̼͌̑̋̌̈̉̍̚Ḃ̧̛̙͎̯̗̬̫͎̗͎͉̊̎̂̅̈́̏́̃̔̋̕͜͝͝P̷̬̫̫͚̖̩͑̂̈͋̌̾̑͝͝K̥̄̆̂͠k̷̵̸̨̹̥̺͉̰̮̼̱̩̯̀̂̑̓̎͒̂̂͌̇̌̌̎̏͗͐̿͘͠()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v14

    xor-int v16, v16, v14

    const v17, 0x1ab68c

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->K̶lP̫͗͌o͕͉̘̫͋̌̈̂͌̑̾̈͊̕eą͓͙̑̾̎͜e̹̹̤̯͋͋̈B̍̂ǎ̴̮̇ĉ̸̸̤̹̝̱͈͌͗̂̆͘͘͜͝͝a̸̘̰͓̹̫̎̔͐t̸̝͒̅͗͗̎̎͂̑̅͊͘͘B̸̷̴̸̢̫͈͚̺͈̙̯̱͚̤̻̋̂̈́͌̉͌̂̋̓͆͊̈́̌̎̔̚͜͜͠û̴͐͘͜͠ó̴̄̎Ķ̵̦͚̺͈̦̗̇͋̎͋͋͗̿̀̄͗̌͜a͑͘c̸̛͈̺̭͈̪͒̿̿͌̈̋̔͝ä̢̨̭̮̙̫̰̙͓̎̂̿͜͜͝a̸̸̸̸̷̷̵̢̧̨̨̢̛̛̞͈̟̜͈̫̘̦̩͓͕̦̮͉̜̰͎͚̾̑͒͗̈́̉̂́̅̒͗̈́̈́̂̅͐̽̋̍̌̾̑̋͗̆̀̋͂̈́̐̂̆̂̿̋͗̋͋̏̒͊̈́̚̚͘͘͜͜͝͝͠͝a̶̧̧̘̪̦͋̔͝ķ͚̏̄̈́̎̌͒͝()Ljava/lang/String;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v14

    xor-int v17, v17, v14

    invoke-static/range {v15 .. v18}, Lcom/android/settings/device/MiuiMemoryCard;->nâ̸̸͎̺̮̦͌͑̋̈́͜͝hk̰̈̊k̸̲̰̦͕̪͖͒̿̔͌͆͝a̢̢̛̖̮̫̥͈̯̯̗͋͗͌͘͝Ķ̸̸̷̸̢̛͓̘̼̫̩͊̀͋̾̂͌͗͑̌̾̋͐̾͋͌̃̚͜͜͝͝K̬̤͕͑̀̅͋͜͝p̶̸̸̶̡̨̧̨̱̦̥̘̺͕̺̦̺̲̫͙̗̭̤̾̒͑́̈́͊̂͊̑̋̌̈́̂͌̒̎͘͘̚k̸͝K̶̛̺̥̠̫̝̝̙̅̌̑̋̈́̚a̸̸̸̠͚̯̘̦͕̎̌̉͌̌͠ḧ̴̨̧̛̭̗̹̫́́o̸̸̷̧̮̱͕̦̱͌̌̂̎̅͐̋̌̚̚͜k̷̡͎͚̗̮̩̰̪̭̼̟̎̋̃̋͑̈̈͐͝͝o̸̸̗̦̅̿̌͝ḁ̦͎̠̥̭̊̿͜͝͝͝ņ͚̹̚ĺ̹K̴̶̜̼͕̫͕̦̰̮͈̯̘̾̍̋̽̿̍p̴̨͇̯̦̋̌̀c͕̫̫̘̺̫̀̅̋́͘͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v15

    move-object/from16 v1, v15

    invoke-static {v3}, Lcom/android/settings/device/MiuiMemoryCard;->B̸̸͙̯̞̹̥̫͚̿͌̂̍̀̉̈́͝a̵͊o̸̯̤̙̦̎͂̈́̍͂̾͜͝ó̴̧̧̪̫͈̤̺̗̿̅ḁ̴̘̃â̢̢̖̻̘̋̀̇̂̈́n̶̡̢̛̞͚͈̮̙͖͚͎̏͊̍̄́̋͂̍̎̚͝a̷̸̛̦̪̺̰̺̱̘̙͗̈̈̏͗̈́͗̿͂̀̅̑͘͠u̗̭̪͈͗͑̏̈́c̸͇̫̫̻͌̔̽͗a̸̷̶̸̴̸̶̶̸̸̶̶̷̸̢̧̧̛̖̯̗͕̘̠̖͕̦̯͕̱͙̭̯̟͚̯̱̫̩̰̯̙̲͙͕͓̖̺̙̗͈̞͂̂̌̈́͗͊̑͗́̃̎̅͊̄̿̌̌̈̃̋̀̆͌͐̅̌̈̎̏͂̿̍͌̅̅̀̑̍̓̿̋͐̅̈́̋͘͘̕̚͜͜͜͜͜͠͝͝͝͝K̶̷̸̶̠͕̠̦̖͚̼̺̐̂͘̚oņ̹̩͋̍͂͝ȏ̸̗̦̖̘͓̦̥̰̱̌̿͘͜͜͠͝o̢̐̆Pḁ͋͘(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v2

    invoke-static {v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p͌a̴̴̧̡̧̡͙̺͎͕̮̮͖̯͈̫͖̔̈́̌̃̾̋̄͑̀̾͋̀̃̕͜͠͝t̛̙̊̀̅͌͝p̴͑͗͜͠ḁ̸̺̎̆ͅṋt̪̹̄̑̃͘͘k̪̩̄̎͜͝K̨̂ņ̯͈̹̑̈́̚o̸̵̷̴̷̧͈̮͓̯̙͙̙̫̗̞̾̌̌͐͊̌͊̚ͅa̷̫̫̘͈̭͗͆́a̸̞͈͝P̶̸̱͚̺̱̲̫̲͚̉̾͌͗́̋ņ̵̧̡̛̹̫̰͎̉̄̈̌̈́̐̾̆͌͋͘͜͝͝n̤̄͑P̛̫̗͈̃̅̔̚ȩ̸̵̺͚̱͂͌̈̈́͗pḩ̷̵̷̨̛͙̯̩͚͚̺̠̬̦̭̤̯͈̩̥̦̃̔̑͒̎̄̈́͒͐̄̎̔͋͆̂̈́̏̇̑̅̏̿͌͒̿͜͝K̨̫͕͉̺̼̑͊̔͝t̷̤̘̫̘̙̼͇̭̭͉̻͎̗̭͎̺͑̂̾͐͋̾̄͘̚ę͕̫̹̦̪͈̥̂̂͗͗̑̎͜͜͠(Ljava/lang/Object;)Landroid/view/LayoutInflater;

    move-result-object v0

    invoke-static/range {}, Lcom/android/settings/device/MiuiMemoryCard;->n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S

    move-result-object v36

    const v39, 0x1ac876

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->n̢̮̦̎̂̈̍̏͋͜ǔ̴̧̫̺̭̤̱͕̈́̌̍͑̐͌͊̚͝͝p̶̧͚̥̈͐͗B̎͜Ḵ̷̴̢̡̧͙̘̹̭͈̮̲̫̩̼̪͎͗̈͗̍̅̂̏̿́̏̚͘͜͝͝ā̤͊p̢̫̈ǎ̧̧̹̪̫͇̫̻́̀̔͂͊̊̍͜ṷ̸̹͇̎͌͆̾͘a̴̛̺͉̜̟̪͇̥͎͑͑̈̋͐̎̎̔̾̏͌́͌̾͗̈́͋̂̏͗̈͝B̸̘̩̫͗̈̑͗̄̀̔̔͝ae͓̩̦͆̇̎̐͒̚o͘ơ̮͙̋͂̇͝u̅̃B̶̧͎̭͈̌͂͋̀̂̆̃̿̈͗͠ņ̛̘̪̞͎̙̥͌͋͐̆ǹ̸̛̘͓̗̯̹̖͎͚͚̪̫͌̀͗̂͗͘͜a̢̦̟̠̮͆͜Ķ̸̲͓̩͉̩̯̯̭̻̂̐̽͗͗̍́̆͌̋͑͘͜͜u̷͈̍̈̌̈́̔̋̈͊͘͠p͚B̷̢̢̥̙̘́͌͠t̫͈̪̽̂()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v35

    xor-int v39, v39, v35

    const v37, 0x1abdf8

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->nB̷ǎ̷̵̷̧̲̼̰̮̹̹͉͇͎̻̮̞̗̻̎̄́́̈̽̏̉̾̔ô̵͕͌̑͜l̦̭̆̑̌á̷̞̮͙̮̱̭̯͕̟̎̀͗̂̒̋͜͝͠͠ā͉͈̱̫̖̑͂̓̋͗hh̷̢̘̪͈̘͈̫͐̈́̌̽̌̈́͜͝Kh͎̋̈͝ca̶͉̙͙̭̠̥͕̭͕͈̔̏̋̌̚͜͠ĉ̵͚͘ǒ̷̶̙̙͓ȩ̶̫͉̺̭͓̰̞̭̝̗̀̈͗̍̎̋̂̕͜͠k̥̱̽̌̈́̂B̧̺̫̻͈̋̌͗̓̒̂̏̈́͜o̲̫̱̔́̄̂̏̈́̈ą̴̴̴̸̛͉̯̖̪̫̼͚̩̫̗̙̫͙̦̰̘̙͎̘͓̫̫̻̎̑͗̏̋̈́̈̌̌͌͐͆͂͐̔͑̈́̐̐͘͘͘͜͜͠͝tṱ̷̷̫̮̏p̦̗̖̭̑̆̏̃͗K̶̛̰̮̲̩̭̭̯͈̝͈͌̂̽̄̈͜͠B̶̶̭̋p̴̴̔͒͗͌̽͝()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v35

    xor-int v37, v37, v35

    const v38, 0x1ab9d5

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->a̵̫̫̖͚̜̔̓͗̑̉o̸͈̗̮͌̃̽͜ñ̨̛̫͕͈͓̫̭̜̲̘͕̯͈̮̤̺͉̹̩͗͂̿̌̅̏̌̆́̈́̉̾͌̾̑̏̐͜͜͝͝K̛͚̫͕̲̿͝͠c̭͕̏̚͜ͅǩ̸̨̛̙̫̥͉̥̥̫̥̯̥͚͗͋̈́͗̃͌̈́̂͑̂͌͊̎̉͘͠͝͠ḻ̶̈͜c̷̢̢̛͚̻̠̪͚̥̼̹̗͓̫̻̮̙̘̏̌͂̐̄̓̋͌͊̋̇̎͆̑̈́͗͘͜͠͝Ke͝p̢̩͂̊̈̓ͅK̜͐̿ō̴̶̴͎̩̭̱̠̲͎̱̌̏̌̋́̂̀̾͌͗͜͝K̵̨̛̤̖̯̫̖̞̗͐̌̋͌p̛̗̩̱̥̙̗͉̫̀̐͌͋̈̌̀͌̏̿͆͌̑̋̑̋͗͝ͅP̧̛͈̺̖͓͎̯̥͕͚̎͂̈́̉̐͐̌͑̉͒́͋̆͘̚͜͝͝͝͝͝B̴̴̧̟̱̘̺̺͕͑̂̆͗̚͝͝͝o̧̞̮̓͝()Ljava/lang/String;

    move-result-object v35

    invoke-static/range {v35 .. v35}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v35

    xor-int v38, v38, v35

    invoke-static/range {v36 .. v39}, Lcom/android/settings/device/MiuiMemoryCard;->ǘ̹̺̭͉͓̈́̋̽̽̌̈͊͆K̸̢̺͈͇̈̋̊͘a̸̛̮̋̃B̶̹̭͓̗̥̹̈́̄̂͌̽̇̌̀͝͠ơ̢̮̠̆̈́̌̅͜B̶̴̡̛̫̲̖͓̰͚̼̩̈́̄̃̈̑̌̎̈́ͅn̦̰̾̑̑͋̑͘K̵̸̡͚͉̘̘̥̫̙̗̮̆̾̌͊̋̾̽̍͗̈͗́̈́̌̾̕̚͘͜͝͝Bë̢͕̗̫͖͉̹͕̭́̀̌̃̌͂e̯̘͖̮̜̗̐͑͝n̝K̄a̵̶̪̘̗̤̥̠̔͋̋̐̒̎͝͝o̵͉͙̜̱͎͑̾̔͌̏̅̈̂͝ķ̸̶̸̴̴̧̝̫͋̀̈́̑͋̈͋͌̂̀͌̿̐̚͝k̈́̀͑͝K͈͚͉͑͝a̸̸̧̢̖͎͈̫̥̮͙̮̙̰̘͓̺͚̐̈͑̿̈́̑̋̌̒͘͝͝͠͝ń̠͎̠̈́͋o̧̯P̵̴̢̧̭̱̫̥̹͖̩̞͈͙̜̪̎̅͂͗̆͗̔̿̍̃̾͌͝͝͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v36

    move-object/from16 v1, v36

    invoke-static {v2, v1}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̈́ñņ̶̵̸̷̢̢̛͚̥͎̟̱̭̫͈̼̗̗͈͈̖̌̐̋͑͋̃͌̋̇͂͗̉̃͐̈́͌̊̎̎̚̚͘͜͠͠ͅo̵̖̱̫̥͆͒̿̈́̈́̊̕͜l̩̯̺̗̺̙̲͙̀̈̋̿͗̋a̭̗͜P̷̢̡̱̤̖͉̩͉͙͓̘͚̃̿͝h͈͚̲͂̆̏c̸̰̼̗̥̯͎̫̄͋͝k̡̯̂͋a̸͙̘̫͓̰̎̏̋̆͊t̸̩͙̲̘̫̮̺̅̎̈́̄̈̑͊̌͐̌̆͘̚̚͘t̴̰̗͎͖̖̺̰̘̮͙̘̅͗̿͐̂̍̌̀̒̕͜͝͝͝ṉ̢̫̮̺͚͈̻͚̰͚͑̾̌̌̏̈́̌͊̒͠o̸̧̗͓̙̜̙̐̈́̑̎̎͗̑̿̃̿ͅâ̷̷̶̯̤̫̫̭̋a̶͋͂̋K̛̯͙͓͕̲̦͊̈pa̸̶͓͚̙̫̍̃hȩ̧̧̡̛̛̘̫̩̥̮̩͓̖̌͋̓͑͊͊͜͜e̷̢͖̾͂͗͜͜(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v1

    const/4 v2, 0x1

    invoke-static {v0, v1, v3, v2}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->e̫̮̅ư̶̶̧̢̡̛̱͈̘̦̼̮̺̩͕͕͕̥̯͈͎̬͙̑̑͗͐̈̀͗͊̅̈́̂͗̕͝͝K͙̀͠ā̶̸̸̲͕̬̼̮̾͘͠epą̛͚̼̗̮͎̎̉c̸̴̶̸̶̡̧̡̛̫̪̥̲͉͕͉̺̾͌̃̐͗̅́͑̐̑̔n̿̕̚n̸̷̷̢̛̘̭͚̙̩̩͓̫̔͐̑̂̔͜Ķ̷̸̛͈̩͇̀͒̈́̑͋̚͝͠o̩͉̗̦̭͈̭͗͗̃͐̇̂͌̿̚͠͝ǎ̸̭͈̱̻͖͙̩̋̋̏̍͌̔́͘͜͝͝ͅȩ̶̷̨̛͇͚̖̰͈̫̦̻̦͖͂̎̃̇̑͌͜n̻̗̲̫̫̑̌͝p̯̭̈̑͑n̷̴̻͉̖̟̜̗̹͈͎̞̤͈͋̈́́̋̍͌͋̌͑̌̑K̴̨̛͓͉̱͓̫͕̑͗̿̌̌̌̾̚̕l̶̡͕̻͉͗̎̒͘͜Kt͘K̴͎̻̈n̠̯͑ä̸̶̧̹͎̹̋̏̂(Ljava/lang/Object;ILjava/lang/Object;Z)Landroid/view/View;

    move-result-object v0

    iput-object v0, v3, Lcom/android/settings/device/MiuiMemoryCard;->mView:Landroid/view/View;

    invoke-static {v3, v3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->o̸̴̶̡̧̧̩̗̥̹̪̮̺̲͖̯͖͈͗͗̈́͌̍̇̈͋̏̈̀̾̏̑͑͗͗͜͝͝͝ǎ̧̦͚̺̖̈́̑̇͐͜o̹u̸̖̦ķ̫̠̗͎̿̀̔͑a̷͕̯̰̯̋͊͗̈͋͌ţ̸̷̸̢̛̗̯̻͚̥̪̋͋̇̎̌̎͜a̶̶̶̶̵̸̛̰̪͙̩̻̮͌̎̔̂͗͌̄͑͌̂́̕l̢̹̫͚̗̘̱̬̻͙̯͈̀͗̐̓̑̿͗̎̆̃̃̋́̅͋͘͜͝͝͝͝͝P̆͝uŏ̴̧̢̢͓̻̗͎̭͖̋͗̋̂̋̅͗͒̈͝o̷K̘̂̈́̌̚e̥t̴̵̢̹͚̗̮̫͇̮̲̪̭̗̼̰͚̗͗̌̋́̈̿͋̂̓̈́̂̄p̥̩̾͋̈́͗â̶̸̙͝űk̩̲̤͑͒͂̚h̛̪̼̫̩̠͗̆̌̇̋͘ë͎͕̽t̜͕́̑ç̸̖̙̮͙̫͙̤͎̰̎̾͐͂̈̀̌͑͗̉͌̂̚͠(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {}, Lcom/android/settings/device/MiuiMemoryCard;->n̶͉̼̥̫̫̘͆͊͊̈͐͐̌͜͜K̥͉̐̀̆͗h̴̶͓͑ä̸̛̹̱͈̉͜ͅK̹̂Pơ̢͎͕͓͆̂͒ű͈͚K̺̺̄ç̧̖̤̯̥͎̫̂̈̽͌̒̈́͌̿͜͜͝ǎ̻̙͎̼̂̂̑̂̽͝K̵̈́c̸̸̴̴̸̶̡̢̧̛̘͎͈͓̥̲̼̯̱͚̭̻̙̫͑͗̾̌͐̅̅͋̈͋̒̅͊̌̚͜͝͝P͕̈́̂̆l̶̩̅͌̾͋̓͜͜ë̞͚́ņ̸̻̋̇̈̈ą̷̸̸̵̷̸̸̸̨̢̛̩̯̦̱̠̫̙̫̗̹̪̻͚̯͕͎̺̘͈͓͕̯̺̀̈͐̈́̋̈́̑͑̓͑̂̈͑͌̐̅̄̿̚͜ṵ͝ư̸̢̠̭͙̤̖̿̂̄̾̋̂̅̕͜l̫͑Pn̸̸̢͖̤̙͎͕̗̥̰̗͕̞̠͉̮̘̫̬̂͋̿̌̈͌͑̒̋͘͝͝P̥̈́͘͝a̧͎̥̘̹̫̋̋̋̆͝B͉̺̾()I

    move-result v0

    invoke-static {v3, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    check-cast v0, Landroid/widget/TextView;

    invoke-static {v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ḧ̶̨̦͕́̅k̞͋́o̸̠̞̲̐̓͝͝ͅP̴̸̧̧̖̱͚̭͚̙̲̻͌̄͌̇͊͗̋͜ơ̴̶̧̢̩͕̫̘͎̭̯̭͈͓̬̫͒̾̃̈́̌͑̐͋͊͑͑̍̿̋̃̂͜͠͝͝͝͝h̷͚̯͌̚͝͠a̧͙̹̼̙̘̙̽̿̔̀̏́̂͗̒̔͗͂̌͘ṳ̦̯͝ų̶̶̛̗͙̦̫̥̯̗̋̑̔͜͝å̴̅̈́͝a̴̶̴̡̢̘͉̪̺̭͕̮̥̱̗̥̫̪͎̱̜͈̅̏͐̐̐̿̌̎͂͜͜h̨̹̥̙̻̯̠̉̾̌͌̿͊̑͂͐̓͌̚͜͝P̷͚͂̋͑p̴̸̢̢̧̛̛̛̹̻͚̫̹̮̤̱̥̮̼̩͎̔̍̃̊̀̑̑͌͋́̈́́̋̾̐̂̈́̈́̏̂̓̅͊̂̚͘̚͜͝͝͝͝͝p̴̶̴̸̢̛͎̫̭͉̆̃͗͗̔̎̆̔̿͋̚͝͝͠͝͠B̴̸̸̶̨̢̛̻̿̋͋̂͒̈́̕(Ljava/lang/Object;)Landroid/content/res/Resources;

    move-result-object v1

    invoke-static {}, Lcom/android/settings/device/MiuiMemoryCard;->t̏̈́̊ȃ̴̷͓͚̖͂̋̍͌̋̕͜͝ͅḴ̥p̫͙͒̎̊̌K̲̩͉̎l͈̻̥͎̗͎̎̃̈̃̑͝K̶̸͈̘͎̟̫̿̾͗̈́͋̈͒̋̂̃̀ã̛̛͎̙̻͉̲̅̐̍à̸̪̯̑t̮̤͐̇̂̃̌̌̋̄á͈͎̩͋a̸̶̢̛̛̭̦̝̝̹͉͓̺̖̫̗̪̜͓̋̾̔̋̑͌̌̂͐͐̐̑̐͌̎͑̆̂̂̊̑̈̕͜͝͝h̢͓͎͗̂͘ȏ̷̷̫̯̫̮̗̺̹̦̩̝̫̫͌́̈́̅͒͒͋̐̈́͗̃̌̒̋̕̚͝a̷̸̶̵̵̸̷̧̧̧̢̖̥̻̦͕̦͈̖̥̤̺͚̱̭̬̼̗͚͉̩̹̺͎̟̖̹̻̘̯̎̅̎͌̾̅̀͑͑̆̌̋͂̌͊͌̿̎̇͊́͊̍̽̋̄̆̂̾̎͊̿̇͘͜͝͝͝͝͝͠ͅB̸̡̡͎̮̜̫̏͋͗̎͜͜ĉ͇̭̰̪͉̔̂̈́̂̄̋̊͝()I

    move-result v2

    invoke-static {v1, v2}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->P̷̸̷̢̛͎̙̺͗̽̋̂̕͝K̴̭̺͈̺̭͚̭͚̭̙͌͗̀͌̇̒̀̃̀̃̋̍́̆́͝͠a̶̫͒͜a̡̗̲͙͈͚͌̿̑͌̚Ka͈̜͒̋ḧ̙̠́͗͐͝h̶̶̸̴̛̪͉͙̺̯̯̤͋̀̈̒̎͌͋̑͜t̴̸̡̮̻̪͉̺̞̙̘̬̯̂̃̂͘͘͝p̸̫͉͓͙̼̻̭̙̯̥̼͕̋̔͆̈̂̑̀͘͘͜͝͝l̺̼̫͌͋̋͌̈́̆͗̒P̵̟̤͆B̝̪͈̅͗͠ȁ̘̦̙̚͜ä̞́̐ţ̧͕̖̥̈́̈̋̔̂̍͘͝ã̧̭̩̪̯̂̂͗̄͌͋̈͘͠ǒ̷̸̶̶̴̧̺̗̺̺̠̼̦̭͚̙̟̘͈̩͓͉̞̤̭͉̞̥̪̺̗̯̈͌̌̃̔̋̈̈́̏͐̈́̌̑͗͒̐̂̄͗̾̄͘̚͜͠͝o̶̷̥̹̍̔â̧͒͝͝p̨̹͓̝̖̤̺̹̈́͂͗̉̐͊͘͝ü͜(Ljava/lang/Object;I)Ljava/lang/String;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ơ̸̤͓͓̯̟̱͈̯̎̂͗̅̎̎̌͑́̌͗͋͝͝ką͚͚̭͕̠̫̪͚͚̯̠̗̭̹̭̪̭̫̎͌̔͌͂̐̈́̌̓͑̂̃͊̅̽͆́̌͘͘͘͝͠͝ͅK̸̸̸̷̢̹̯̟͈͎̈́͂͋̾̽̆̂̆̄͋͌̊hh̵̸̛͎̮̬͑͊̓͒͠k̴̸̶̴̨̛͈̙̠͕̪̲͓̲̂͑̒̈́̄̃̈́̈́̐̿̚ả̶̧̧̺͓̥̭̭̑̂̈͗͘̚͝c̴̢̖̮͕̼̯̦̪̪̠̺̯̙͖͓̎̈́̎̾̋͗̆̂͗͌̏̈̚̚͝͝p̸̵̷̶͈̼͈̹͙̫̘̘̘͓̐̅̈́̂͗̋͘͜͝P̵̴͓͂͋̀̈́̆̀à̶̌̓̑̈́ö̴̷͙̘̗̯̥͖̻́͐̈́̾͊͆̑̄̑̀͘u̸̫̟̯̔̂͌̃̋́̆̅̔͌͆̃͗̿̅ắ̸̺̺̞̦͈̩̺͒̅̾K̶̸̸̛̪̰̺͓͎̜̭̬͚̿̋̆̋̑͜(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {}, Lcom/android/settings/device/MiuiMemoryCard;->â͗̈́͝ǹ̸̸̸̬̦̰̯̺̙̫͉̘̙̫̻̫̑̈̄̔̑͋̍̐̅͗̋̈́͂͋̄͗͐͑͑̂͝͝͠a̶̵̧̠͉̫͉̬̯̤͂͐́̃̑̈́̈́̂̌̆̈͘͜͜͝͝lu̽l̚l̝̩͜p̶̢͎̓͌͑̚Ḵ͚̪̈́͌ǎB̵̹̿̿a̴̧̛̰̘͎͐̂̑̍͜͠͠u̫̽͗ţ̴̴̸̧̢̞̫͚̟̫̙̫̻̰̮̘̫͎̯̦̺͎͚̱͎̌͗͊̋̃͑͂͌̿͌͋͗̈́̌́͐̋͘͘͜͝͝t̷̷͈̗̫̦̪̲̏̑̆̊̑̃̌͋̒̂͜B̵̷̹̺ḛ̴̫̋̿å̫̺͉ã̷̸̧̭̫̫͙͈̂̋̋̅̕P̄̏͝ť̸̶̡̙̘̘̞̂̀̋͝c̵͉̦̎̈́̋̎̍͂͜͜ò̸̧̢̘͊͌̔̋͘͜͝B̧̦̤̯̺̑̈́̏͘ẗ̴̷̻͈́̅̎̈́B̡͈̗̱͎͎̍̂͋͊͌̃̋̃͝͠()I

    move-result v0

    invoke-static {v3, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    check-cast v0, Landroid/widget/TextView;

    iput-object v0, v3, Lcom/android/settings/device/MiuiMemoryCard;->totalText:Landroid/widget/TextView;

    new-instance v0, Lcom/android/settings/device/MiuiMemoryCard$MemoryInfoCallback;

    invoke-direct {v0, v3}, Lcom/android/settings/device/MiuiMemoryCard$MemoryInfoCallback;-><init>(Lcom/android/settings/device/MiuiMemoryCard;)V

    iput-object v0, v3, Lcom/android/settings/device/MiuiMemoryCard;->mCallback:Lcom/android/settings/device/MemoryInfoHelper$Callback;

    invoke-static {v0}, Lcom/android/settings/device/MiuiMemoryCard;->l̷̡̹̭̫͈̯͓̩̗̦̻̫̄̋͆͂̒̂̂ṯ̷̷͉̹̘̤̮̬̂̈͗̌͘͘͜BP̢͂ą̴͖̻͚͉̂̈́̊̃̈́̂͘͝͝͝ů̷̴̢͉̪̯ơ̸̱̘̿͗̿͗K̶u̴̸̸̧̢̧̻̲͉̟̮͎͕̘͚͓̘̩̫̅̿͑̓͌̀͋̔͌̈́̿͊̅͒͑̾͒͊͌̈̋̐̋̚a̸̵̴̢̢̨̛̗̗̤͈̰̰̭̘͕̺̰͓̯̖͋̆́̋̍͆͒̍̎͑͑͊̂̎̈́̑͜B̡̭̜̮͌̋̅̋͘͘u̶̷̶̧͉̗̫͉̥̫̘̠̦̮̞͎̖͌͗̾̌̓̋̑̈̑͒͑̽͗̈́̾̂͌͝͝a̛̲̹͇̲͓͕̱͌̈̎̌͗̈͑́̋͋c̸̱͂̎̄͑̀a̶̴̸̧̢̛̬̭̪̭̘̫̝̮̰̓̏͒̉͂́̎͌͂͊̂͑̚͝ͅt̸̢̡̛̛͉̲̮͉̑̋͝n̢̨̢͚̯̭̻͉̩̔̾̑̊̎̎̿̚͝͝(Ljava/lang/Object;)V

    return-void
.end method

.method public static ķ̷̶̧̛̬̩̱̝͈̞̯̭͎͓̥̲̫̎̃̐͑̿̂̃̔̂͌͌̿̃͋́̈̍̆͘͝͝ͅn̤̔l̸̛̥̯̻̙̼͓̘̥̮̫̬̘̤̍̈́̍̆̌͑̀̈̈́̇͘͠͠͠a̧̛̝͙͚̎͌̕ä̭͉͈̱͌͌̏͘͝a̙̼͗͌͜ņ̼͗͗̾̿̚a̢̨̨͎͉̮͙͉̹̠̎̿̿̈́̆̄̋́͗͝t̶̒̃̐a̴̸̸̴̷̧̧̛͉̥͖͙͇͕͕̼͇̘̘̪͇̬̫̗̦͇͎͉̖̺̯͎̋̋̍͗́̃̂̃̐͐̓̋͋̄̀̈́͗̾̂̎́̀́̒͋͌̐̾̒͘͘͜͜͜͜͠͝͝͝͝a̮̎̅ķ̨̘̈́͌̆͌p̸̸̶̡̼̲̗̼̫͕͖̻̤̥̥̪̋͌̓̎̌͊̌̑͑̔͌̆͗́̐͘̕͘͜͜͝lơ̷̶̴̢̧̜̘͈̦͚͕͓͎̎̆̀̒̂͒̂́͜͜͠l̛̛̺͕͕͊̋̍́̆͝͝B̶̏(Ljava/lang/Object;)Lcom/android/settings/device/MemoryInfoHelper$Callback;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_b

    check-cast p0, Lcom/android/settings/device/MiuiMemoryCard;

    iget-object v1, p0, Lcom/android/settings/device/MiuiMemoryCard;->mCallback:Lcom/android/settings/device/MemoryInfoHelper$Callback;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static l̷̡̹̭̫͈̯͓̩̗̦̻̫̄̋͆͂̒̂̂ṯ̷̷͉̹̘̤̮̬̂̈͗̌͘͘͜BP̢͂ą̴͖̻͚͉̂̈́̊̃̈́̂͘͝͝͝ů̷̴̢͉̪̯ơ̸̱̘̿͗̿͗K̶u̴̸̸̧̢̧̻̲͉̟̮͎͕̘͚͓̘̩̫̅̿͑̓͌̀͋̔͌̈́̿͊̅͒͑̾͒͊͌̈̋̐̋̚a̸̵̴̢̢̨̛̗̗̤͈̰̰̭̘͕̺̰͓̯̖͋̆́̋̍͆͒̍̎͑͑͊̂̎̈́̑͜B̡̭̜̮͌̋̅̋͘͘u̶̷̶̧͉̗̫͉̥̫̘̠̦̮̞͎̖͌͗̾̌̓̋̑̈̑͒͑̽͗̈́̾̂͌͝͝a̛̲̹͇̲͓͕̱͌̈̎̌͗̈͑́̋͋c̸̱͂̎̄͑̀a̶̴̸̧̢̛̬̭̪̭̘̫̝̮̰̓̏͒̉͂́̎͌͂͊̂͑̚͝ͅt̸̢̡̛̛͉̲̮͉̑̋͝n̢̨̢͚̯̭̻͉̩̔̾̑̊̎̎̿̚͝͝(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_c

    check-cast p0, Lcom/android/settings/device/MemoryInfoHelper$Callback;

    invoke-static {p0}, Lcom/android/settings/device/MemoryInfoHelper;->getAvailableMemorySize(Lcom/android/settings/device/MemoryInfoHelper$Callback;)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static nâ̸̸͎̺̮̦͌͑̋̈́͜͝hk̰̈̊k̸̲̰̦͕̪͖͒̿̔͌͆͝a̢̢̛̖̮̫̥͈̯̯̗͋͗͌͘͝Ķ̸̸̷̸̢̛͓̘̼̫̩͊̀͋̾̂͌͗͑̌̾̋͐̾͋͌̃̚͜͜͝͝K̬̤͕͑̀̅͋͜͝p̶̸̸̶̡̨̧̨̱̦̥̘̺͕̺̦̺̲̫͙̗̭̤̾̒͑́̈́͊̂͊̑̋̌̈́̂͌̒̎͘͘̚k̸͝K̶̛̺̥̠̫̝̝̙̅̌̑̋̈́̚a̸̸̸̠͚̯̘̦͕̎̌̉͌̌͠ḧ̴̨̧̛̭̗̹̫́́o̸̸̷̧̮̱͕̦̱͌̌̂̎̅͐̋̌̚̚͜k̷̡͎͚̗̮̩̰̪̭̼̟̎̋̃̋͑̈̈͐͝͝o̸̸̗̦̅̿̌͝ḁ̦͎̠̥̭̊̿͜͝͝͝ņ͚̹̚ĺ̹K̴̶̜̼͕̫͕̦̰̮͈̯̘̾̍̋̽̿̍p̴̨͇̯̦̋̌̀c͕̫̫̘̺̫̀̅̋́͘͝(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̖̯͈̩̠̄̎͋̋̑͌͂̎̕͘͝o̷͎̘̖̼̺̯̦̫̻̖͌͒̋̀̃͌̋̃͝P̵̢̥͉͎̥̫͌͋̈́͜͝P̷̄t̷̶̲̪̀̄̋̇͊͜͜͜Bu̸̴̸̧̧̯̥̤̮̭̹̖̖̮̿̎̾́͗̃̌̂̈́͘͝͝P̈e̦̺̊͜p̶̷̶̢̨̺̗̹̭̥̼̝̬̐̂͗͒͊̆̾͌p̮̌̑͂͠ǎ̗̖͒͆͠ṱ̏̌P̢̛̫̂̎̌͊̆͌̌̔̑̆̋̍̄̇̚͜Ķ̯̺̻̥̭͈͓̫͈͗̌̅̎̃̃̃̃̂͗̀̅̾̅̐̕͠o̴̵̶̸̧̘̦͎͉͇͒̃̃́ą͖̮̩̯̮̱̩̮̥̃͊͌͌̃̈́̓͐͌̊̿͌̈͌̂̚͘͝a̶̸͓̔͑̎́̃͐̉̄̀̚͜n͚̋͌̌͜͝ȃ̸̺̝̦̯̀͜P̶̸̢̧̧̱̯͈̟̹͉͙͓̭͉̙̐͒͌̿̇̋̔͌͌̍̂̌͑̾͝͠ͅKa([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_9

    sget-object v0, Lcom/android/settings/device/MiuiMemoryCard;->short:[S

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static n̶͉̼̥̫̫̘͆͊͊̈͐͐̌͜͜K̥͉̐̀̆͗h̴̶͓͑ä̸̛̹̱͈̉͜ͅK̹̂Pơ̢͎͕͓͆̂͒ű͈͚K̺̺̄ç̧̖̤̯̥͎̫̂̈̽͌̒̈́͌̿͜͜͝ǎ̻̙͎̼̂̂̑̂̽͝K̵̈́c̸̸̴̴̸̶̡̢̧̛̘͎͈͓̥̲̼̯̱͚̭̻̙̫͑͗̾̌͐̅̅͋̈͋̒̅͊̌̚͜͝͝P͕̈́̂̆l̶̩̅͌̾͋̓͜͜ë̞͚́ņ̸̻̋̇̈̈ą̷̸̸̵̷̸̸̸̨̢̛̩̯̦̱̠̫̙̫̗̹̪̻͚̯͕͎̺̘͈͓͕̯̺̀̈͐̈́̋̈́̑͑̓͑̂̈͑͌̐̅̄̿̚͜ṵ͝ư̸̢̠̭͙̤̖̿̂̄̾̋̂̅̕͜l̫͑Pn̸̸̢͖̤̙͎͕̗̥̰̗͕̞̠͉̮̘̫̬̂͋̿̌̈͌͑̒̋͘͝͝P̥̈́͘͝a̧͎̥̘̹̫̋̋̋̆͝B͉̺̾()I
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_9

    sget v0, Lcom/android/settings/R$id;->title:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static n̷̥̻̎̔̐͝h̴̭̹͈͎͗́̂͘͜͜͜o̯̺̹͙̠͇̖͝B̴̵̸̸̸͉͎͇͙̺̹̱̮̋̆̄͗̋̍̈̀̔̍̈͝K̷̦͓̗͈̖̹̊̑̏̂͑́́̀͗͌̏̾̚͝͠ą̷̸̡̡̹̦̻̻̘̭̺̆̑̔̑͋̈́̅̃͐̑͊͑̀̈́̌͌̃̀̔̋̅̿̚̚͘͜͝͝ͅK̨͕̥̫͋̎̄̚l̻͠ư̪̤͈̋̌̎̾̃̒̔̏̂̋͜͜ͅp̴̩͎͗̌͘p̛̗̪͚͗̂̑̋͌ȧ̵͕̺͘̚K̵̸̶̰͕̪̤̐̃̉͗͑̆͊͑̚ͅḧ̛͙͈͎̼̩̩̺͕̭̩͊̎̏̌̆̌̎̄̈͜nha̶͋̑̀ȧ̧̩̙̯̅̂͑̃͗̍͑͊͜k̢̢̛̛̛̼̺̩̺͎̼̦̄̂͋̃͋͌͐̈́͘͜͝͝K̸̷̸̨͚̘̠͚͙͎͚͚̱̘̺̼̲̈͂̃̔̈́̍̋͒͌̎͒͋̋͋̃̃͘͝͠(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Ljava/lang/String;

    invoke-static {p0}, Lcom/android/settings/report/InternationalCompat;->trackReportEvent(Ljava/lang/String;)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static n̸̥̺͗͑͌͠Ǩ̅ẗ̥́ḩ̸͕̘͇̲͚̈̑͐̐̌͘͠ͅakţ̷̶̢̛͕͙̦̤̱̼̻̪̗̫̗̗̱͙̦̬̐̾̅̈́͌̈́̽̽͗͒̚ķ̷̶̢̭͕͚͚̩̰̹̔̋̊̎̋̕ͅeȩ̴̻̫͕̹̋̈̚a̴̧̡̡͉͈̰̠̗̹͇͎̰̭̭̺̪̮̾̍̌͒̈́̌̔̎̏͂̈́͌̈́̈͠͠ḧ̸̛̲̯̗̹́͑͝o̢͎̯͉͚̠̮͌̂͗̋͋ö̟̪̱͉͜t̶̷͎̯̖̯̿̅͊̌P̈͝͝ō̶̷̶̧̟̲͕̤̩̺̻͕̫̖͈̼̋͋͊̃͌̈́͑̌́̄̈́͐̅͝͝͝͝a̗̮͙̪̖̖͚̾̌̐̔͋̅͝o̺̮͎̼̥̜̟͓͉̾̌̎͜͠͝P̭̟̦̐Bh̴̸̴̦̮̤̯͚̔̓͗͘̚͝p̮͉͝t̨̛̫̯̺̺̥̼͉̫̫̰̗̗̥̂̈̾̑͋̏̃̈̈͊̃̄͘͝͝͠͝͝(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->k̴̴̴͎̫̤̠̓͒̂͑̾͑̈́̅a̷̶̧̲͂̌͌̕Ḇ̴̷̵̸̴̶̟̠̲͈̹̻̽̌͑̀̈́̋̀̈͑̂̃͘͜͝K̶̵̪͕̭̠̗̃͌͋l̷̛̹̝̯̿̽͆̾͘͝͝K̵̵͈̐̈n̢̦̪͌̾̈ta̷̗̗͕͋̄̍̏͘͘Ǩ͗c̵̸̸̨̢̯̥͈͈̤̤̯̫̫̫̦͗̍̔͌̔͌̌̿͌͋̍̎͒̎͜͝͝͝͠͝ea̿̏͐̑̋̑͠o̾͌͗͝K̴̷̸̨̨̧̧̧̭̦͈̯̹͈͕̪͉̈́̃͌̾͑̃ą̸̴̴̺͕̭̮̹͎̺̙͙͎͚̗̜̪̱̭̮̘̺̺͊̋̌̅́͗͑̌͌̅̎̎̎͌̐͗̌̀̑͋͗̒̉͌̚͜͠͠ͅâ̷̭̹̙̂̑͂͜u̢̧̥̹̯̥̥͓̲̝͎͑̏̚͝͝Ķ̫͚͚̈́̑ȧ͚̭̹̃c̵̸̨̖̖̺̖̆̋̌̚͘͝n͂̐̋͊h̷̽͠K̗̈([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static t̏̈́̊ȃ̴̷͓͚̖͂̋̍͌̋̕͜͝ͅḴ̥p̫͙͒̎̊̌K̲̩͉̎l͈̻̥͎̗͎̎̃̈̃̑͝K̶̸͈̘͎̟̫̿̾͗̈́͋̈͒̋̂̃̀ã̛̛͎̙̻͉̲̅̐̍à̸̪̯̑t̮̤͐̇̂̃̌̌̋̄á͈͎̩͋a̸̶̢̛̛̭̦̝̝̹͉͓̺̖̫̗̪̜͓̋̾̔̋̑͌̌̂͐͐̐̑̐͌̎͑̆̂̂̊̑̈̕͜͝͝h̢͓͎͗̂͘ȏ̷̷̫̯̫̮̗̺̹̦̩̝̫̫͌́̈́̅͒͒͋̐̈́͗̃̌̒̋̕̚͝a̷̸̶̵̵̸̷̧̧̧̢̖̥̻̦͕̦͈̖̥̤̺͚̱̭̬̼̗͚͉̩̹̺͎̟̖̹̻̘̯̎̅̎͌̾̅̀͑͑̆̌̋͂̌͊͌̿̎̇͊́͊̍̽̋̄̆̂̾̎͊̿̇͘͜͝͝͝͝͝͠ͅB̸̡̡͎̮̜̫̏͋͗̎͜͜ĉ͇̭̰̪͉̔̂̈́̂̄̋̊͝()I
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_9

    sget v0, Lcom/android/settings/R$string;->storage_settings:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ǘ̹̺̭͉͓̈́̋̽̽̌̈͊͆K̸̢̺͈͇̈̋̊͘a̸̛̮̋̃B̶̹̭͓̗̥̹̈́̄̂͌̽̇̌̀͝͠ơ̢̮̠̆̈́̌̅͜B̶̴̡̛̫̲̖͓̰͚̼̩̈́̄̃̈̑̌̎̈́ͅn̦̰̾̑̑͋̑͘K̵̸̡͚͉̘̘̥̫̙̗̮̆̾̌͊̋̾̽̍͗̈͗́̈́̌̾̕̚͘͜͝͝Bë̢͕̗̫͖͉̹͕̭́̀̌̃̌͂e̯̘͖̮̜̗̐͑͝n̝K̄a̵̶̪̘̗̤̥̠̔͋̋̐̒̎͝͝o̵͉͙̜̱͎͑̾̔͌̏̅̈̂͝ķ̸̶̸̴̴̧̝̫͋̀̈́̑͋̈͋͌̂̀͌̿̐̚͝k̈́̀͑͝K͈͚͉͑͝a̸̸̧̢̖͎͈̫̥̮͙̮̙̰̘͓̺͚̐̈͑̿̈́̑̋̌̒͘͝͝͠͝ń̠͎̠̈́͋o̧̯P̵̴̢̧̭̱̫̥̹͖̩̞͈͙̜̪̎̅͂͗̆͗̔̿̍̃̾͌͝͝͝(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ȟ̸̶̶͈̎̋͌̈̈͗͌̇̐t͉͚͖̩̤̔k̦̂͠e̴̴̷̸͇͌͒̋͜ā̸̶̴̴̢̧̧̛̱̤̥͓̰̦̺̩̗͈̩̟̯̯̻̗̦̮̤̦̙̲̘̈́̈́͌͗͌͌̎̈́̅̑̔̂̃͑̀̔̅͂̂͘͜͜͝k̗̱͕͉̂̇̇͑͘͠͝h̸̴̶̖͚̮͎͖̭̼͚͗͌͌̀̑̋͗̋͋͘͜͜͝aB̗͕͒̂̚͜͠u̩ţ̛̘̖̪̫̭̂͊̌̈́̔́̂̓aa̪͜ļ̸̸̴̹̙̹̜̗̤̰̰̙̮̙̺̗̭̇̑̄̎̏͆́̋͌͗͑̂̅̂̿̄ͅc̨͈͖͓̺͑̎͊̆͠ǫ̸̶̵̛̮̺̟͉͇̘͇͎̮̺̞͚̫͂̃̑̌̋̎̍̋̌̈̎͑̎̂͘͜͜͝͝͠͝͝͝p̶̶̴̱̹͚̗͈͓̺͇͋̑̋͐̌̉̂͊̿̂͜͜͝B̭͌̓̈́͜ͅȗ̢́͘t̵̛͎̼̭̙̂͂̾̀̃̆̅([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method


# virtual methods
.method public getCallBack()Lcom/android/settings/device/MemoryInfoHelper$Callback;
    .registers 52

    move-object/from16 v0, p0

    invoke-static {v0}, Lcom/android/settings/device/MiuiMemoryCard;->ķ̷̶̧̛̬̩̱̝͈̞̯̭͎͓̥̲̫̎̃̐͑̿̂̃̔̂͌͌̿̃͋́̈̍̆͘͝͝ͅn̤̔l̸̛̥̯̻̙̼͓̘̥̮̫̬̘̤̍̈́̍̆̌͑̀̈̈́̇͘͠͠͠a̧̛̝͙͚̎͌̕ä̭͉͈̱͌͌̏͘͝a̙̼͗͌͜ņ̼͗͗̾̿̚a̢̨̨͎͉̮͙͉̹̠̎̿̿̈́̆̄̋́͗͝t̶̒̃̐a̴̸̸̴̷̧̧̛͉̥͖͙͇͕͕̼͇̘̘̪͇̬̫̗̦͇͎͉̖̺̯͎̋̋̍͗́̃̂̃̐͐̓̋͋̄̀̈́͗̾̂̎́̀́̒͋͌̐̾̒͘͘͜͜͜͜͠͝͝͝͝a̮̎̅ķ̨̘̈́͌̆͌p̸̸̶̡̼̲̗̼̫͕͖̻̤̥̥̪̋͌̓̎̌͊̌̑͑̔͌̆͗́̐͘̕͘͜͜͝lơ̷̶̴̢̧̜̘͈̦͚͕͓͎̎̆̀̒̂͒̂́͜͜͠l̛̛̺͕͕͊̋̍́̆͝͝B̶̏(Ljava/lang/Object;)Lcom/android/settings/device/MemoryInfoHelper$Callback;

    move-result-object v0

    return-object v0
.end method

.method public onClick(Landroid/view/View;)V
    .registers 55

    move-object/from16 v3, p1

    move-object/from16 v2, p0

    new-instance v3, Landroid/content/Intent;

    invoke-static/range {}, Lcom/android/settings/device/MiuiMemoryCard;->n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S

    move-result-object v17

    const v20, 0x1abcbf

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̋ą̶̶̷̸̮̠̤̞̞̺̫͙͎̯̙̗͚̌̄̔͗͗̾̐͒̂͆̾͘͜͜ͅa̫͉͐K̢̧̰̤̗͉̼̹̬̘̎͗̂̓͒̌̔̅̾̕͝͝B̷̸̧̥̭̹̭̭̜̫̼̼̟̺̺̗̦̗̩͎̗͚̲̾̐͌̂͋͗͂̑͊͋͋̈́̾̃̋̐́̑̃̈́̂̒̑̈́̚͘͜͜͝͝͝ͅu͕̗͙̗̱͉̺͑̔̎̅͘̕͜͝P̧̥̠̤̙̫͈̠̗͓̺̿̃̄̀̎͌̓̈́͘͜͜ư̵̸̶̷̸̵̷̵̡̡̧̛̫̭̺̱̥͈̠̰͎̥͕̠͚͎̰̫͙̙̱̘̙̹̱̮͎̦̝̗̺͓̫̤̭̦̎̋̄͌͌̌͗͗̀̅͊̈́̎̈̋͗͆͊̐̈́̏͗̂́͊̈́͌̌̈́͗̚͜͜͝͝͝ͅcPc̢̧̢̛̗̮͙̩̯͂̈́͋̈́̕͜͝͠͝l̥͚͕̤̿̂̿̆̌̉P̷̸̧͉̠͈̈́͠ų̸̭̭̙͉̯͎̍͂̍̐̈̚͝()Ljava/lang/String;

    move-result-object v16

    invoke-static/range {v16 .. v16}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v16

    xor-int v20, v20, v16

    const v18, 0x1ac9f8

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->K̷̸̭̠̩̆̐̌̎̍͗̈̐͘̕pa̩͈̺̔̌̀͆̚͜ơ̶̸̷̛̠͖̺̘̘͗̆̋̂́̆̎̽̑̌͂̅̓̉͘̚̚͝K̶̵̫͎̭͈̙̊̃͌͜ĉ̸̷̸̗̮͒̍͜o̶̴̧̨̢̫̪̙͉̦͙̦̺͉̥͕̎̾͑͑͌̎̈̑̃̋̋̐͜͜͝͝k̵̸̺̫̰̓̈́̃͜͜͝k̵̸̵̘͕̲͓͗́͑̐̏̿͝ć̛̈́͘͘p̵̡̛̠̼͕͎̺͈̺̯͈̼̾͑̌͐̎̋̿̈̃̃̚͝ḩ̸̷̢̢̨̮͉̲̲̞̪̫͚̰̯̯̘͕̙̙͈̫̫̅̔̅̎̌̿͑̌̑̀̂̿͌̅͊͑͗̚̕͜͜͜͝͠͠h͝hk̷̸̸̜̭̭̦͚͕̫̽̾̾͝c̷͑t̶̶̶̴̸̢̧̧̙̗͈̥̋̏͗͌̌̈́͒͂͗̈͘͜c̨̧̏̒͗̂a̸̵̸̶̛̘̗̯̠͓̤̯̰̤͑̈́̈́̆̈́̂̑͗̚c̤()Ljava/lang/String;

    move-result-object v16

    invoke-static/range {v16 .. v16}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v16

    xor-int v18, v18, v16

    const v19, 0xdc34

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ȩ̶̷̸̸̢̛̺̹̰͕͈͖̱͓̼̗͖̝͙̞̥̺̗͚̍͑͑̾̍̋̆̊̂͗͗̈̋̌͋͋̋̌̋͆̌͋̎̆̑͌͋̕̚͘͝͝͝t̸̢̨̗̘̘͐͋̄̎̈́̌̅ų̛̙̥̰̼͋̄̌͗̊̑̂̍̎k̷̯̘͚̥̪̍̈͌̐͘ķ̷̡͈̠̪̗̙͈͖̤̃̈́̀̃̂͌͌̈́̃̑̕͘͠͠c̝̰̑̈́̈̚ǩ̷̟̱̊a̸̸̧̟͙̦͙̖̯̙̜͓̺̽̾͌̀͜͝͠u̧̲̘̹̎̀̌k̭̖̮̼̱̮͐̔ą̵̷̛̝͇͖̠̗̹̥̪̱̦̯̬̭̤͕̥͓̝͓͚̓͊͊̎͊̔̍̉̂͘̚͘͘̚͜͜͝͝ͅu̵̥͙͚͕̮͌̊͒͗͌͊̾͜͠P̸̶̺̹̩̐̑̈̎kB̵̶̸̧̦͉̤͕̙͚̗̀̅̀̈́̈͋̐͜͝͝a͓̗̘̪̠̭͂̐̂̀̄͜͜͝͝u̷̫͉̯̺̮̿̋̀̈́͋͜()Ljava/lang/String;

    move-result-object v16

    invoke-static/range {v16 .. v16}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v16

    xor-int v19, v19, v16

    invoke-static/range {v17 .. v20}, Lcom/android/settings/device/MiuiMemoryCard;->n̸̥̺͗͑͌͠Ǩ̅ẗ̥́ḩ̸͕̘͇̲͚̈̑͐̐̌͘͠ͅakţ̷̶̢̛͕͙̦̤̱̼̻̪̗̫̗̗̱͙̦̬̐̾̅̈́͌̈́̽̽͗͒̚ķ̷̶̢̭͕͚͚̩̰̹̔̋̊̎̋̕ͅeȩ̴̻̫͕̹̋̈̚a̴̧̡̡͉͈̰̠̗̹͇͎̰̭̭̺̪̮̾̍̌͒̈́̌̔̎̏͂̈́͌̈́̈͠͠ḧ̸̛̲̯̗̹́͑͝o̢͎̯͉͚̠̮͌̂͗̋͋ö̟̪̱͉͜t̶̷͎̯̖̯̿̅͊̌P̈͝͝ō̶̷̶̧̟̲͕̤̩̺̻͕̫̖͈̼̋͋͊̃͌̈́͑̌́̄̈́͐̅͝͝͝͝a̗̮͙̪̖̖͚̾̌̐̔͋̅͝o̺̮͎̼̥̜̟͓͉̾̌̎͜͠͝P̭̟̦̐Bh̴̸̴̦̮̤̯͚̔̓͗͘̚͝p̮͉͝t̨̛̫̯̺̺̥̼͉̫̫̰̗̗̥̂̈̾̑͋̏̃̈̈͊̃̄͘͝͝͠͝͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v17

    move-object/from16 v0, v17

    invoke-direct {v3, v0}, Landroid/content/Intent;-><init>(Ljava/lang/String;)V

    invoke-static/range {}, Lcom/android/settings/device/MiuiMemoryCard;->n̸͜a̸̡̨̱̋̍͑c̷̝͊̅͠o̶̡̥̘͌͗̊̚͜͝P̸̸̵̧̥͉̟̎͗̌̋͌̈̀́̈́͘͘a̗P̶̢̛̛̫̗̺͓̫̯͎̻͙̹̠̼̥̟̦͎̥̭̮̭̯̫̫̜͙̫͚̈́̃́͗̂͗̍̆̈̑̈́̑͌̈́̀͆͌͗̃͊̿͑͆̋̈́͋̾͐̾̐͜͜͠c̙̪̏͌͆p̶̲̅́̑B̸̈͜a̶̯̟oP̶̶̢̯̹̗͎̎̔̐͐͋̕̚͜͜ḵ̵͓̿̃Ķ̴̷̸̸̡͙͈̮̥͎̫̗̗̭̲̮͈̙̋͑͆̄̏̈͗̄̆̚̚͜͝ǹ̷̸̷̶̢̛̛̠̯̖̦̹͖̘̪͈̯͙̞͕͚͚̻̑̿̂̌̋̊͊̌͘͝͝ņ̸̸͎̘̗̦͗̃͌̌̂̈̌͌̓͗ţ͎̓p̸̶̸̺̫̞̠͈͕̩̾̆̌̾̏̌̎̏ä̶̶̶̧̭͖̱̲̰͓̺̃̅̄͜c̤t̶͇͓̱̬̮̄̋͋͑͘͜()[S

    move-result-object v31

    const v34, 0x1ac07b

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->B̶̢̤̹̲̘̌̂̐̑̎̀̚̕͝P̂̎͜K͓c̚à̶̴̸̵̢̤̼͓̮̫̭̼͒̿̃̕nţ̶̸̛͎̦̗̫̮̫͎̀̑͗̈̾́̿̅̌͘͘͜͜͝͝͝͠u̖t̛̰̮̩̥̭͎̙͋̂͗͑̀̈́̔͗̄̃̌͗͜͜͜͠͝͝ͅt̶̪͕͚͚̻̼͌̾͑̾̾͘͘͝ͅu̶̹͚̟̿̈́͊͌̐̐̈́Ķ̴̶̴̢̧̢̨̢̛̛̱̲̥̘̺͉͙̠͈͚̩̻͇̼̺̥͙̗͎̂̎̋͋̾̈͊̈̎͑̀͆͆̑͜͜͝͠͝ͅĶ̸̷̢̛̼̬̯͕͚͈͓͇͚̖̤͈̼̠̱͋̆̋̋̅̾͘a̴̼̠͎̅̂̔B̷̢̪͎̱̼͙̹͉͎͆̾̓͗̈̏͗̃͌̚͜͝o̵̷̸̧̫̗̙͎͚͈̪̹͗̈́͒͊͂͒͐ầ̧̧͈̤͓̋K̼̜̥͓̿ȩ̵͓͚͕̞̱̖̑̈̈́̂̌͑͂͘͜ä̷͓̤͌()Ljava/lang/String;

    move-result-object v30

    invoke-static/range {v30 .. v30}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v30

    xor-int v34, v34, v30

    const v32, 0x1aabdb

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǩ̷̺͈̬̦͙͕̥̈́͑̋̅͝â̧̡̭̭͈͕͚̍̎̃́̃̑̅͠͠͝tc̷͉͌ë̶̢͈̭̘̰̺̗̰̥̗̼͈͎͚̗̦̫̻̙̠́͋͐̈̿͌̾͒̋͌́̅̈́͋̈̚͜͠ǹ̸̴̛̛͎̹̯̖͈̭̱̻̗͈̠͎̫̗̘̖̍̔͐̑̔̂̑̈́̀̈̍̚͜͝͝͝K̸̴̷̶̶̨̛̛̛̙̖̰̺̞̹̰̞̗̻͖̱̖̞̬̃̋͊͗̐͐̆̇̂̃͋̈̈͜͜ą̷̸̷̨̯̘̠͓͈̙̠̜̗̫̞̑͗̂͗͋̑̚͝ĥ̸̼̲̜̦̗̋͋͋͑̈́̂͜͜͝o̵͚̦͋̚͜p̭͊̕͝lo̷̘̘͎͑̈́̇aä͈͓̺͎̋̋p̠͈̘̩̹̰̹̻͗͑̌͌̈͌̑͆̋̋̂͊̆̚͜͝ͅa͚͈͗͝ǎ̶̶̡̗̭͗̒̚ơ̷̢̥̼̗̠̖̟̫̋̈͒̃͌͗͊́̋́̚͠a̫͎͋̈̈́()Ljava/lang/String;

    move-result-object v30

    invoke-static/range {v30 .. v30}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v30

    xor-int v32, v32, v30

    const v33, 0x1abd8d

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->pô̲͈̪̫̒͋̎̓̅̚͜n͝B̴̦̈̎͌̌ā̷̹͈̜̻̑̈̒͜͝͝ͅě̵̸̸̡̨̡̠̙̲̭͉̫̯̭̱͓̼͚̭̭̭̫̀́͌̆̋̐͂̑̾̏͋̑͘͜͜͝͠ͅḁ̾͘t̸̸̡̡̺͙̥̯͚̰̺̟͇̠̱͋̋͋̂̓̊͜͜ͅà̸̧̢̧̧͚͇͕̩͖͈̫̗̈́̌͗̀̎͊͌̊̕͜K̛ỡ̸̶̧͚̺̺̘̯̼̮̺̻͉̫̭̦͎̫͚̍̓͋̎̾̈́̈̎͑̎͋̎̉̋̑̌͑͊̂̌̍̈́͘̚̚͜͠ù̧͎̾̂̂̋͝â̷̧̯̫̪̥͎̹̗̺͚͋̃̈́̍̈͊̑̆͋̈́̀̕͜͝B̸̷̴̸̧̬͎̯͎̹̞͚̂̋͌̿͗̏̚̚͠͝ȃ̧̺̐͜t̜̆a̻̫͗͑̑̿͗t̨̪̺̞͋ě̷̸̵̢̛̛͈̫͎͚̭͎̫̯̭̘̘͉̈̋̂͊̍̾̌̃̈́̎͌́͘͝()Ljava/lang/String;

    move-result-object v30

    invoke-static/range {v30 .. v30}, Lcom/android/settings/device/MiuiMemoryCard;->a̲ô̢͈̥̩̯̯͈̱͋̾͑͌n̸̸̸̛͚̮̫̗͎̱̼̅̋̒̌͒͝l̸̺̗̫͈̗̩̫̾̈̏͝ȗ̧͚̹͉͚̌̋͐p̫̙̹̎a͙͒t̴̸͇̫̹͚͎̓͗̿̌̾̆̂͘͝n̸̸̸̢͉̥̦͚̰̙̻̗̘̯̂̌͊͌̆̃̄̂͘P̸̵̻̺̃́͗͗͌̂ḁ̤͈̝̃̀̾̒̐l͑a̡un̵̵̸̸͈̫̙̫̭̫̗̥̪̞͎̂̃̎͌̔̚͜͜͜͜͝͠͝͝ơ̷̧̨̢̢͉̺͉͎̫͈̪̘̋͑̃̂͒́̍͋̄̌͜͜͠ö̸̶̫̤̻̲̪̺́̃͗͌̃͗͌͂͘͝͝p̶̧̢̢̧̛̗̻̖̱̯̤̺͈͎͚̰̌͑̈͑̂̿͜͜͝͠͠eP̴̡̭̥̗̥͙̃̈́̆͝ā̢̙̺̀͑K͈̹͈̠̈́͗̍͑͒͗̌̅͊͝â̷͚̅̂̀̋͜͝ȯ̴̢͇̰͚̲͎̀̂̈́̃̌͂̋(Ljava/lang/Object;)I

    move-result v30

    xor-int v33, v33, v30

    invoke-static/range {v31 .. v34}, Lcom/android/settings/device/MiuiMemoryCard;->nâ̸̸͎̺̮̦͌͑̋̈́͜͝hk̰̈̊k̸̲̰̦͕̪͖͒̿̔͌͆͝a̢̢̛̖̮̫̥͈̯̯̗͋͗͌͘͝Ķ̸̸̷̸̢̛͓̘̼̫̩͊̀͋̾̂͌͗͑̌̾̋͐̾͋͌̃̚͜͜͝͝K̬̤͕͑̀̅͋͜͝p̶̸̸̶̡̨̧̨̱̦̥̘̺͕̺̦̺̲̫͙̗̭̤̾̒͑́̈́͊̂͊̑̋̌̈́̂͌̒̎͘͘̚k̸͝K̶̛̺̥̠̫̝̝̙̅̌̑̋̈́̚a̸̸̸̠͚̯̘̦͕̎̌̉͌̌͠ḧ̴̨̧̛̭̗̹̫́́o̸̸̷̧̮̱͕̦̱͌̌̂̎̅͐̋̌̚̚͜k̷̡͎͚̗̮̩̰̪̭̼̟̎̋̃̋͑̈̈͐͝͝o̸̸̗̦̅̿̌͝ḁ̦͎̠̥̭̊̿͜͝͝͝ņ͚̹̚ĺ̹K̴̶̜̼͕̫͕̦̰̮͈̯̘̾̍̋̽̿̍p̴̨͇̯̦̋̌̀c͕̫̫̘̺̫̀̅̋́͘͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v31

    move-object/from16 v0, v31

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->B̌p̵̷̨̹͚͚̗͉̘̖̖̰̋̃̋͋̾̒͌̅͌̌̃͜͝͠ͅt̛̗̀̃n̒̋P̸̶̧̺̮͎̯͙̮̜̥̗̈́̀̌͋̅̇̑̑̈̈̆̈́̀̾͝o̭t̸̨̧͈̰̙̲̜̫̙̺̦͙̫̞͚͉̒̋̎͗͂̀̂̋̔̀̑͜͜͝ä̸͇̪̹͚̜͉͓́͐́͋̂̄ỏ̶͚͚̮̥͉̘̩̋͗͑̃̑̑͜P̠̠͊̇̏͒̚͝P̢͂̌̋͘͝ț̵̹̍̋̄̂͝h̴̸̢̧͚͈̫̱̮̱̦̙̖̽̋̾̿̅̌̈́́̔̂̃͘ņ̾̋̾h̸͓̦͓̯͘͝ņ̴̸̸̷̨̛͉̩̦̠͇̮̝̮̘̲͚̖̞̹̫̈̐͐̈̾͗͐͂̀̈́̕͜͜͠ō̶̹̗̰̭͙̫̼̼̤͓̘̐̄͋͌̂͊̇̋̄̽͠͠͝l̶͚̥͗̂Ko̧̮̼̿̌t̷̴̢̢̢̫͚̯̫̝͎͈͎̭̭̅̅̋̈́̌̍͌̎c̨()Ljava/lang/String;

    move-result-object v1

    invoke-static {v3, v0, v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą͎͉̺͝a͜p̶̨̩̭̘͉͉͗̔͝c̼̤͉̼̅̾̄̆̃͌̒̋͝͝â̟̗͕̹͇̖̮̅̋̍̕͝͝KK̪͉K͉̮͖̗͌tP̷̶̧̮̮̫͋̈̂̾̑̌̑̃͘͝l͕͈̥̜̘̆̄a̶̚a̷͗k͕̠̂͊̂̃̈́͠͝ͅk̶̨̮̫͓̫̜̆̒̈́͋̂͌̾̂̿͐̍͘͘͠ͅh̴͈̉B̛͓KP̸̨̝̫̂̍͋̈ǫ̸̛͕̫͎̭̗̺̯͓̤̗̰̭͈̼̰͎̪̯̪̭͕͑̀͗͗̋͑̍͊̋́̎̿͋͋͊̀̎̚͜͠͠ͅȩ̶̶̷̴̧̛̙͎̯̹̙̻̬̥̙͎͉͖͚̟͓̹̺̩̗̫̺̎̂̅͒̑̎̄͑̅̎̂͒̎̚͜͠o̷K̶̶̴̷̢̧̧̢̧̧̧̫̱̭͙̫͉̫̮̱̮̺͚̦̮͎̗̖̤̻͎̈̋͗̌̋̾̌̍̌̊͋̂͊͊̎̈̌́͑̌͌̋͂̆̇͑̈͗̌͘͠͝(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)Landroid/content/Intent;

    invoke-static {v2}, Lcom/android/settings/device/MiuiMemoryCard;->a͚̺̺̮̔n̷̗̓̚P̺̫̥̫͚̎̏̋͂̚͜ȩ̴̸̢̛̖͚̤̝͚̤͚͈̫̭͉͙͎̫͎̝͈̲͖̂̌̈́̂͌̋͆͐̈͌̈͌̈́̉̏̏͒̆̈̚̚͜͝͠͝͝͝K͓̿̌̂o̟p̡̡̢̫̩͎̝̖̹͈̖̮͊̈̆̋́͆̏̈̅͗͘Ḱ̨̧̛̛̰̠͓̖̫̪̭͎̘͙͓̺̱̟͉͙̺̋͗̋̃͌̂̎͗̎͌̍͂̑̈́͒̆̆͘͜͜͜͜͝͝ͅK̸̷̭͎̫̮̩̽̈͌͘ő̢̫̫̦̭̠̠͇̮̺̯̮̺̺͆͋̾̅̊́͊̋̃͌͗̚͘͠͝ȩ̷̭̦̱̻̲̯̩͎̾̈́̀̈͋͌͌͜͜͜͠K̸̛̋̊̈̉͘͝u͎͇͋K̎̄͗̔͑́̈͘͝͝B̸̵͓̆̈́͝͝͝K̸͘a̲̬͂ă̧̯͓̩͋̚͝͠ck̶̷͎̭̱̰͕̺̦̘̗̃̇̓̌͒͝͝͠͝p̸̧̱͉̦̂͜͝(Ljava/lang/Object;)Lcom/android/settings/dashboard/DashboardFragment;

    move-result-object v2

    invoke-static {v2}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->l̶̷̷̶̸̸̢̧̧̨̧̛̼̮̘͚̗̯͕̖͇̹̩͖̍̇̾̏́̈̈͗̈́̈́̊̃̍̎̾̎͗̆̀̑̃͌̑͆͘͜͜͝͠ͅa̷̧̘͙͇̹͆̑̒̚̕B͈̙̘̫̻̈́͗͋̾͗͠͝͝͠͝h͈̫̤̠͗̑͋͋̌p̸̢̛̭͕̯̮̗̾̐̇̏̒̑̽̆̋̈́͜͜͠͝a͌̑͗̀̄͠͝K̸̢̧̛̪̖͓͚̺͚̫̫̫̞̭̫͚͚̫͕̺̑͐͒͗̾͋͗̈́͗̑̾̌̂̀̍̄͌͋̅̚̚͜͠͝ơ͚̦̻̺̾̾̋̋͠o̴̢͉̖̫̤̖̯̾̋̈͘͝͝ͅK̶̛̥̘̮̯͎̖͎̦̂̀͋͐̄̋̋̒̍͘ő̦̮̱͚̎̂͌̂̐͝ǔ̶̸̴̟͉̫̥͎̱͋͑̂̀̄͋͘͝͝a̰̎a̧͚̻̜̭̩͗̈͐̆͜͝͝aB̗̲͈̖̪͋à̜̪͂̆ĥ̲̥̂̿̂͗̍̕͜͝ḩ̫͙͊̎̌(Ljava/lang/Object;)Landroidx/fragment/app/FragmentActivity;

    move-result-object v2

    invoke-static {v2, v3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ẗ̸͚̮ä̧͉͕̱̘̚p͈̫̭̀̂ä̲͎̦͑a̹̪͎̤̮̼̾̂o̧̧̠̺̤̯̤͌̾͌̅̄̃̈́̅̃͑͝͝ͅtc͇̱͉̿́̈́hK̷͈̠͉̫̠̫̦͐̈̄ņ̸͈͎̱͚̦̼͙̐̆̂̽̎͋͋K̪̦̃̕͜ļ̷̺̮̺̥͕̜͗̈̑̂̉̂͊͑̈͌c̨͋̆̾̋̚o̺̫̫̿͗̄̆̈̋̕͝B̸̨̘̯͈̔̃ã̶̧͈̝͚͎͚͕̯̱͕͙̙̦̮̋͗͒̑̃̂̂a̡̤̙̭͌̅̋̿̍̃̾̌̂̕͜p̻̫̗̭̭͗͑͋͒͘k̷̛͎͉̘̎͊͗͌͗̎̿̋̍̀̈́͜͠a̸̷͙͈͉͋̑̽̌͘͜K͘o̶̶̘͗͑̓̄̈͗͋̿͝l̵̨̛̮̥͖̠̮̍̋̎̐͂̐̈́͘͜͜͝B̢͕̲̆̈̅͘͘p̷̴̸͎͖̊͠͝a͇͘ĕ̶ő̢̦̬͕͘p̸̏̆K̇̅(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->k͈̝̙̫̫͗Kk̸̴͈͈͕͎̪͕͓̯̺͚̥̾̀́̎̒͒̂̿͊͘͠à̱̲̥̫͓̲̫̖̈̔͗͗̏͘͘͝͠o̫̝̖͜lk̴͉á̷̵̔̇͝ue̦͗t̷̮̿̐̾̌͝ḁ̷̴̶̸̧̛̺̦̗͚̫̹̙̟̯̀̈͊̋̅ͅk̶̛̭͇̖̫̥̻̗͋̕͜c̶̠ú͝P̵̶̸̢͓̫͓̟̘͚̺̥̮̺̌̋̐̅̉̌͑͌̏͠ç̸̗̞̮̰͎͗̊̀̀̑͘͠u̔ą̶̛̠̺̦̗͒͒̎̋͜u̴̬̹͉̔̔̈̿̅l̎͆̿k̴̷̶̶̨̢̛̛̭̥͙̼͓̫̻̘̗͉̮͓͙̫̫̥̫͙̗̙̑̂͊̇͌͐̃̄̋̅̆̑̋̋͒̍̑͋̋̈̇͑̚͜͜͝͝͝͝͝͝ͅa̶̹̫̭̅̋͂͝aBeP̨͈̄̀ä̸̸̷̸̛̭͎͈͈͖͈͙̺̠͚́͊̉̂̋͂̈̎͌̋̅l̮̆ͅ()Ljava/lang/String;

    move-result-object v2

    invoke-static {v2}, Lcom/android/settings/device/MiuiMemoryCard;->n̷̥̻̎̔̐͝h̴̭̹͈͎͗́̂͘͜͜͜o̯̺̹͙̠͇̖͝B̴̵̸̸̸͉͎͇͙̺̹̱̮̋̆̄͗̋̍̈̀̔̍̈͝K̷̦͓̗͈̖̹̊̑̏̂͑́́̀͗͌̏̾̚͝͠ą̷̸̡̡̹̦̻̻̘̭̺̆̑̔̑͋̈́̅̃͐̑͊͑̀̈́̌͌̃̀̔̋̅̿̚̚͘͜͝͝ͅK̨͕̥̫͋̎̄̚l̻͠ư̪̤͈̋̌̎̾̃̒̔̏̂̋͜͜ͅp̴̩͎͗̌͘p̛̗̪͚͗̂̑̋͌ȧ̵͕̺͘̚K̵̸̶̰͕̪̤̐̃̉͗͑̆͊͑̚ͅḧ̛͙͈͎̼̩̩̺͕̭̩͊̎̏̌̆̌̎̄̈͜nha̶͋̑̀ȧ̧̩̙̯̅̂͑̃͗̍͑͊͜k̢̢̛̛̛̼̺̩̺͎̼̦̄̂͋̃͋͌͐̈́͘͜͝͝K̸̷̸̨͚̘̠͚͙͎͚͚̱̘̺̼̲̈͂̃̔̈́̍̋͒͌̎͒͋̋͋̃̃͘͝͠(Ljava/lang/Object;)V

    return-void
.end method

.method public setFragment(Lcom/android/settings/dashboard/DashboardFragment;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    iput-object v1, v0, Lcom/android/settings/device/MiuiMemoryCard;->mFragment:Lcom/android/settings/dashboard/DashboardFragment;

    return-void
.end method
