.class public Lcom/android/settings/device/MiuiDeviceNameCard;
.super Landroid/widget/FrameLayout;

# interfaces
.implements Landroid/view/View$OnClickListener;


# static fields
.field private static final short:[S


# instance fields
.field private mDeviceNameText:Landroid/widget/TextView;

.field private mFragment:Lcom/android/settings/dashboard/DashboardFragment;


# direct methods
.method static constructor <clinit>()V
    .registers 52

    const v0, 0x38

    new-array v0, v0, [S

    fill-array-data v0, :array_c

    sput-object v0, Lcom/android/settings/device/MiuiDeviceNameCard;->short:[S

    return-void

    nop

    :array_c
    .array-data 2
        0x673s
        0x67es
        0x666s
        0x670s
        0x66as
        0x66bs
        0x630s
        0x67bs
        0x67as
        0x669s
        0x676s
        0x67cs
        0x67as
        0x640s
        0x676s
        0x671s
        0x679s
        0x670s
        0x640s
        0x676s
        0x66bs
        0x67as
        0x672s
        0x640s
        0x674s
        0x67es
        0x66cs
        0x677s
        0x676s
        0x4ees
        0x4b9s
        0x4bds
        0x4a1s
        0x4bds
        0x4ees
        0x4a7s
        0x4a0s
        0x4b5s
        0x4a6s
        0x4a0s
        0x4bds
        0x4bas
        0x4b3s
        0x48bs
        0x4a3s
        0x4bds
        0x4bas
        0x4b0s
        0x4bbs
        0x4a3s
        0x48bs
        0x4b8s
        0x4b5s
        0x4b6s
        0x4b1s
        0x4b8s
    .end array-data
.end method

.method public constructor <init>(Landroid/content/Context;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1}, Landroid/widget/FrameLayout;-><init>(Landroid/content/Context;)V

    invoke-static {v0}, Lcom/android/settings/device/MiuiDeviceNameCard;->a̷P̶̢͎̪̺̯̌̾͌̽̌̀͝n͚̂͒̕K̪̬̗̍͠K͚̞̯p̵̶̢̧̛͙͎͈̦̤͉̦̋͆͗̃̎̾̆͗͋̿̌̌͝à̢̨̺̗̠̚͠é̶̸̮̖͉̮̱̲̫͎̹̈̈͋̌̀͌͜͝ȟ̸̵̶̡̖̯̙̗̱͕͈͉̲̂͆͒͂̔̈̃̾͘c̷̤̠̠͎̭͕͇̥̅̀̏͗̊̌̎̕͝o̬P̶̢̧̰̹͉̼͑̋̂͠B̵̶̢̗̭͙͚͙͈̖̱̱̩͓̺̱̯̀̇͐̃͒̂͋͑̋̄̌̔̀͆̈́͘͠͝͝t̘̫̂͝ơ̵̷̶͎̪̭͐̃́͂͋̚͜l̹͌̎͗͗̿͜͠Kp̭͓̲͋a̸͕̼̯n̷̗̘̤̞̘͓̱͙̦̩̅͌͑̌̿̂̔̕͜͜͝͝l͌̑͜͝P̵̢̧̛̯͎͕͚̥̮̃̎̌̐͒͒̈́̈̃̋̉͐͝͝͠͝ͅa̸̴͓a̋͠ǎ̸̢̧̧̩̦̥̂̃̈̈́͆͆(Ljava/lang/Object;)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;)V
    .registers 54

    move-object/from16 v2, p2

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1, v2}, Landroid/widget/FrameLayout;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;)V

    invoke-static {v0}, Lcom/android/settings/device/MiuiDeviceNameCard;->a̷P̶̢͎̪̺̯̌̾͌̽̌̀͝n͚̂͒̕K̪̬̗̍͠K͚̞̯p̵̶̢̧̛͙͎͈̦̤͉̦̋͆͗̃̎̾̆͗͋̿̌̌͝à̢̨̺̗̠̚͠é̶̸̮̖͉̮̱̲̫͎̹̈̈͋̌̀͌͜͝ȟ̸̵̶̡̖̯̙̗̱͕͈͉̲̂͆͒͂̔̈̃̾͘c̷̤̠̠͎̭͕͇̥̅̀̏͗̊̌̎̕͝o̬P̶̢̧̰̹͉̼͑̋̂͠B̵̶̢̗̭͙͚͙͈̖̱̱̩͓̺̱̯̀̇͐̃͒̂͋͑̋̄̌̔̀͆̈́͘͠͝͝t̘̫̂͝ơ̵̷̶͎̪̭͐̃́͂͋̚͜l̹͌̎͗͗̿͜͠Kp̭͓̲͋a̸͕̼̯n̷̗̘̤̞̘͓̱͙̦̩̅͌͑̌̿̂̔̕͜͜͝͝l͌̑͜͝P̵̢̧̛̯͎͕͚̥̮̃̎̌̐͒͒̈́̈̃̋̉͐͝͝͠͝ͅa̸̴͓a̋͠ǎ̸̢̧̧̩̦̥̂̃̈̈́͆͆(Ljava/lang/Object;)V

    return-void
.end method

.method public static Ķ̸̢̻͇͕̿̿̃͆̄̑̚͝ȟ̵̲͕̔̌̈͆̎̒h̨p̺̼̮̃͗̂̈́͌̿̆a̵̡̮̗͕̙̥̘̯̖̪̤̯̋͋̾̂̑̃̂̑̄̈̾͒͑͝͝Ḱ͓͎̂̂o̷̶͕̫̹̪̤̥̪͉͌̍̌̌̚͜͜͝͠͝͝k̷̬̈̈l̃B̯̎͋̎͒͂̂̚B̛̈́̑̃͜Kţ̧͉͓̑ű̢̮̋n̛͚̟͎͙̹̝̖̅̍͒̎͝ě̴̖͚̘͕̺̗̫̌̎̋̍̋̑͑͊͒̌͜͜o̶̖̯̠̿̈͌͌͝a̴̤̜̠̰͌͜ͅB̧̭̠̈̎̎k̴̨̹̚ą̵̸̸̸̷̡̧̧̧̧̺̗̺̟͇̯̫̯̹̪̯̫̫̭̱̈̂̀̈̂͘͘͜͝͝ͅȩ̵̭͚̫͉̫̿̋̃̂̚Ṗ͉͙͙̭̹̬̮̂̊̑̋̋̍̂̆͝h̷̛̝͈̺̬͋̑̋͘͠͝͠a̷̯͕͈̔̋̂͠o̷̦̿̿̌̅̂͌͂̇(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->h̸̸̵̶̢̛̛̛̛̛̖̦͇̺͎̟͙̥̗̞̼͈̥̙͕̘̾͂͌͂̈́͗̂͒̂̂̈̄̋̋̇̎͗̽͗̐̃̋͘̕͝͠͠k̫̺̔͌ȟ̯͚͎̠̠̗͈̜͂̈̈́̆̽̈͌̑͆̾̚͜lu͉̹͊tẽ̤͎̄h̴̺̦̥̦̲̃͋͒͘͝͝ó̸̶̢̧̯̦̺͎͕̙͚̖͈̺͖͐̃̃̎̐̈́͂̾̋̂̈̋͑̑̃͘͜K̻͉t̷̵̷̪̱̂̌̐̋̃̂̃͜a̹͎̱̹̱͌̍̍̓̈́̽̕h̨͋K̻͙̦t̸̷̗̯̮͙͚̝͓̭͓̼̀̈́͋͗̿̋̀̂͘̚͜͝P̸̶̵̢̘͉̗̗̘̺̗̱̓̔̊̈́͗̓̈̋͂̂̑̊̇̆͠͝Kae̹͚̫̙̋̅̃n̸̴̫͈̫̫̭̭̖̼̯̄̂͗͗̂͌̓̋͘ḁ̷̴̴̶̶̢̛̗̗̱̮̫̦̘̫̗̱͈̫͊̂̌̿̋͌̀̾̑̂̽̔̅͘͘͝͠([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static a̪̮h̷̏͋a̶̯̻̮͌́̂́̃͝ǒ̴̶̴̶̵̧͚̘̭̗̬̹͓̩̫͂͗͋́͐̆̍̋͒̾̀̋̏̐̐̚͝ōo̸̷̧̨̘͎͓͚̤̱͚̖̫͊̋͒̂̀̾͑̎̿ắ̧̼̖͚͉̯͎̯̠̏̌̾̎͜͝k̴̙̙̗̂̔̅̌͜a̸̴̸̢̧̛͙̱̫̝̤̭̮̦̮͖̎̍͐̄̋͌̆̍͑̌̚͘̚͜͠͝a̧͎̗̭̯̠͈̥͖̗͗͌͑̄̈̈́̈̄͆͜a̴̒̈́ķ̵̸̧̛͙̭̯͕̘̈̍̌͋̏̽̔̌t͚͘͝P̷̭̕nņ̶̵̶̢̫̯̦͓̫͓̘̩̫̘̲̗̾̈͋̋͌̈́̈́̃͂̃̊͗͐̂͋͝K̶̯̫̥̈̽͌͜͝a̸̵̹͈̯̱̮̹͎̤̦͙̤̔̄̃́̋̆͘͜ą̵̶̛̼̞͉̰̥̰̙̺͙̫̈́͌͗̍̂̀̒͆̈́͌̌̋͝͝͝P͚̗͙̈͂͒ǎ͙̐͘ͅ()I
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    sget v0, Lcom/android/settings/R$id;->title:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̷P̶̢͎̪̺̯̌̾͌̽̌̀͝n͚̂͒̕K̪̬̗̍͠K͚̞̯p̵̶̢̧̛͙͎͈̦̤͉̦̋͆͗̃̎̾̆͗͋̿̌̌͝à̢̨̺̗̠̚͠é̶̸̮̖͉̮̱̲̫͎̹̈̈͋̌̀͌͜͝ȟ̸̵̶̡̖̯̙̗̱͕͈͉̲̂͆͒͂̔̈̃̾͘c̷̤̠̠͎̭͕͇̥̅̀̏͗̊̌̎̕͝o̬P̶̢̧̰̹͉̼͑̋̂͠B̵̶̢̗̭͙͚͙͈̖̱̱̩͓̺̱̯̀̇͐̃͒̂͋͑̋̄̌̔̀͆̈́͘͠͝͝t̘̫̂͝ơ̵̷̶͎̪̭͐̃́͂͋̚͜l̹͌̎͗͗̿͜͠Kp̭͓̲͋a̸͕̼̯n̷̗̘̤̞̘͓̱͙̦̩̅͌͑̌̿̂̔̕͜͜͝͝l͌̑͜͝P̵̢̧̛̯͎͕͚̥̮̃̎̌̐͒͒̈́̈̃̋̉͐͝͝͠͝ͅa̸̴͓a̋͠ǎ̸̢̧̧̩̦̥̂̃̈̈́͆͆(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Lcom/android/settings/device/MiuiDeviceNameCard;

    invoke-direct {p0}, Lcom/android/settings/device/MiuiDeviceNameCard;->initView()V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static ą̷̷̸̶̻͚̘͕̥̤̬̮̦̤̮̭̭̤͓̮̙͚̫̹͑͐͑̈́̋̒͑̌͒̈̃̆̆̀̏̕͝͝͠n̵̴̯̘̗̻̠̹͓͉͚͇̤̾̋̊̍̂̏̅B̛̩̼͚͉̎̎̎̎͘͜͝co̸̧̡̍̈͂̑k̶̼̱̗̮̦̰͚̱̬̫̎̋̈̌́̃̃͑͗̅̅̽͜͜͜͠n̪͚͕̮̱̋̿üo̶͕̮͌̑̈́͜͜u̫͈ǩ̶̶̙̥͙̪͈͎͌e̶̻͈̦̺͐͂̊̉͗̑͘͜c̶̢̢̺̮͚̫͕̻̫̄̿̕ǫ̸̷̜̰͈͇̼͎̭̱̌̿͑̅̂̑̈́̋̀̿̂͌̚͜͝ť̸̫̞̖͚c̸͚̖͈͊͗̔̒͝͠o̴̸̼̖a̝̫̗̋̀̍̎̃͘͠ň̶̴̶̶̶̸̶̨̛͕͚͈̭̠̠̥͈̫̼̱̞̥͈͕̬̮̱̎̓́̋͒̿̆́̎͗̎̈́̅͂̾̈̑̈͊̈́͌͗͋̎͜͜͜͜͜͝͝͝͝()[S
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    sget-object v0, Lcom/android/settings/device/MiuiDeviceNameCard;->short:[S

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ç̶̢̼͖͓̥͈̯̾̑͂͂̕oṳ̶̢͓̲͓̘̲͎̠̪̘͓̼̀̌̓̄̋͋̄̌̋͆͘͘̚͘͝͝k̒e̲͗͘á̶̶̛̗̫̖͎͖͚͈͕͗̌̐̈̾̐̍͝e̷̷̺͝͝č̢͓̥̫͓͈̮͕͉̗̯̑̅̂̅̎̃͘͘̚͜ā̴̸̡̨̢̧̱͈̭͓̥̪̌̇͑͌̀͝Ḵ̷̸̷̸̸̭̯͚͎̲̭͉̫̠͕̘̮̱͇̠͓͎̌͋̌̋́́̂͒͑͊͑̃͒̋̆ô̷̢͙̈̌̚͠ä̸͎́̿K̴̸̢̧͉̭͕͚̘̬̖̹̀̋͗̎͌̂̊̑͋͝p̌K̯͕̭̦͕̫̼̲̮͈̔l̮̯̮͓̼̈́̂̏͝͝ḵ̤͗͆͌̿ȁ̫k̄a̶̷̴̺̻̺̭͎̰͓̖̭̯̮͉̻̮̱͒̃̍̿̔̂͗͆͌̈́̀͋̋̅̚͝u̧̠̚ḽ̷̛̮̹̥̼̅͗̋͂̔̿̅̂̂̌ͅą͗e̸̎(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̖̯͈̩̠̄̎͋̋̑͌͂̎̕͘͝o̷͎̘̖̼̺̯̦̫̻̖͌͒̋̀̃͌̋̃͝P̵̢̥͉͎̥̫͌͋̈́͜͝P̷̄t̷̶̲̪̀̄̋̇͊͜͜͜Bu̸̴̸̧̧̯̥̤̮̭̹̖̖̮̿̎̾́͗̃̌̂̈́͘͝͝P̈e̦̺̊͜p̶̷̶̢̨̺̗̹̭̥̼̝̬̐̂͗͒͊̆̾͌p̮̌̑͂͠ǎ̗̖͒͆͠ṱ̏̌P̢̛̫̂̎̌͊̆͌̌̔̑̆̋̍̄̇̚͜Ķ̯̺̻̥̭͈͓̫͈͗̌̅̎̃̃̃̃̂͗̀̅̾̅̐̕͠o̴̵̶̸̧̘̦͎͉͇͒̃̃́ą͖̮̩̯̮̱̩̮̥̃͊͌͌̃̈́̓͐͌̊̿͌̈͌̂̚͘͝a̶̸͓̔͑̎́̃͐̉̄̀̚͜n͚̋͌̌͜͝ȃ̸̺̝̦̯̀͜P̶̸̢̧̧̱̯͈̟̹͉͙͓̭͉̙̐͒͌̿̇̋̔͌͌̍̂̌͑̾͝͠ͅKa([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ȩ̸̸̸̵̵̷̸̢̭̗̙͎̮̖̞͕̲̤̯̫̰̙̮̲̠̥̺̫̲̹̰͗̌̍̑͋͑̍͌͌̾̄̓̾͌͆͌̀̂̅̄̀̌̌̏̈́͐͑̚͜o̷̸̧̧̬͈͇͓͖̠̯̝̗̲̪̟͓̎̋̆͋͑̑́̈̂̂̏̒̂͠͝͝͝P̷̩̼̹n̸̸̫͈̹̫̗̺̘̺̅͌̈́͌̈̋͑̚͝a̸̷̢̫͗͗̅̏͌͒̌̎̋̍̈͘c̷̷̢̛͈̰̫͓̲̫̫͕̱̫̥̥͎͎̎̃͌̎̏͆́̎̏̅̌̄̍͑͊̈̂̿͒̅̓̚͘͝͝͝͝ç̴̸̨̱̞͚̺̔̋̄̍͑͘̚͝͝ç̷̴̵̻̬̫̺̟̲̗̺̗͒̃͂̈̎͗̎͋̄̑̈́̃͗̑͝n̤͂̎̾̕ḵ̶̛̭̱̜̠̱̰̯̭̺̈͂̋̋͌̀͘͘͠͝͝ͅh̵͓̭͗́̈̈aą̸̛̺̻̻̖̱̯̫̥̟̟̗̠̗̦̭͊̍̑̏́̀̈́͑͠(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;ILjava/lang/Object;I)Z
    .registers 7

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_13

    check-cast p0, Lcom/android/settings/SettingsPreferenceFragment;

    check-cast p1, Landroidx/fragment/app/Fragment;

    check-cast p2, Ljava/lang/String;

    check-cast p4, Landroid/os/Bundle;

    invoke-virtual/range {p0 .. p5}, Lcom/android/settings/SettingsPreferenceFragment;->startFragment(Landroidx/fragment/app/Fragment;Ljava/lang/String;ILandroid/os/Bundle;I)Z

    move-result v0

    :goto_12
    return v0

    :cond_13
    const v0, 0x0

    goto :goto_12
.end method

.method private initView()V
    .registers 55

    move-object/from16 v3, p0

    invoke-static {v3}, Lcom/android/settings/device/MiuiDeviceNameCard;->l̨̛̺̫̹̦̼̺͚̯̊͐̈́̀̌͘̚ͅc̶̸̸̛̮̫͈͕̹̤̞̭̪̦̫̍̿́͗̽̂̀̍̌̿̌̓̾̉̍͆͌͘̚̚̚͜͜͜͝ͅã̸̵̶͚̹̫͈̩̼̲̦̤̎̄̌͑͌͝͠K̸̯̫̔̈́͒̌P̶̺̦̥̈̂͒̌̈̅͝͝o̸̸̶̢̖͈̫̯̪̭͚̯̯͎̮̠͐̃̈́̿͌͊̎͑̈́̀͘͝ṷ̼̋͒̈́͊̎ű̯̗̝̃͜B̶̵̻̘͓̫͒͌̄̄̀͜ͅä̸̶̸̺̗͖̾̓̌̄̈́͜ȧ̵̱͉̯͙̂̔̈̄͌͒̀̋͑͝͠p̫̺̃ä̸̸̱̫̂͋̋̂̈̕̚͠e̦̒l̛̗͚̆̿͋͜K̷͇͕̺̍͝ã̧̮̹̎̋͊̎͗̀͝ö̮̱́̃͑ẗ̵̸̸̢̛̛̠̫̦̠̦̥̩̺̱̤̝̫̯̹̗̦̰͓̮͖͙̭̲̭̥͐͊͊͑͐̉̂͋̅̈́͋̌͗̔̌͌͜͜͠͝(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v2

    invoke-static {v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p͌a̴̴̧̡̧̡͙̺͎͕̮̮͖̯͈̫͖̔̈́̌̃̾̋̄͑̀̾͋̀̃̕͜͠͝t̛̙̊̀̅͌͝p̴͑͗͜͠ḁ̸̺̎̆ͅṋt̪̹̄̑̃͘͘k̪̩̄̎͜͝K̨̂ņ̯͈̹̑̈́̚o̸̵̷̴̷̧͈̮͓̯̙͙̙̫̗̞̾̌̌͐͊̌͊̚ͅa̷̫̫̘͈̭͗͆́a̸̞͈͝P̶̸̱͚̺̱̲̫̲͚̉̾͌͗́̋ņ̵̧̡̛̹̫̰͎̉̄̈̌̈́̐̾̆͌͋͘͜͝͝n̤̄͑P̛̫̗͈̃̅̔̚ȩ̸̵̺͚̱͂͌̈̈́͗pḩ̷̵̷̨̛͙̯̩͚͚̺̠̬̦̭̤̯͈̩̥̦̃̔̑͒̎̄̈́͒͐̄̎̔͋͆̂̈́̏̇̑̅̏̿͌͒̿͜͝K̨̫͕͉̺̼̑͊̔͝t̷̤̘̫̘̙̼͇̭̭͉̻͎̗̭͎̺͑̂̾͐͋̾̄͘̚ę͕̫̹̦̪͈̥̂̂͗͗̑̎͜͜͠(Ljava/lang/Object;)Landroid/view/LayoutInflater;

    move-result-object v0

    invoke-static/range {}, Lcom/android/settings/device/MiuiDeviceNameCard;->ą̷̷̸̶̻͚̘͕̥̤̬̮̦̤̮̭̭̤͓̮̙͚̫̹͑͐͑̈́̋̒͑̌͒̈̃̆̆̀̏̕͝͝͠n̵̴̯̘̗̻̠̹͓͉͚͇̤̾̋̊̍̂̏̅B̛̩̼͚͉̎̎̎̎͘͜͝co̸̧̡̍̈͂̑k̶̼̱̗̮̦̰͚̱̬̫̎̋̈̌́̃̃͑͗̅̅̽͜͜͜͠n̪͚͕̮̱̋̿üo̶͕̮͌̑̈́͜͜u̫͈ǩ̶̶̙̥͙̪͈͎͌e̶̻͈̦̺͐͂̊̉͗̑͘͜c̶̢̢̺̮͚̫͕̻̫̄̿̕ǫ̸̷̜̰͈͇̼͎̭̱̌̿͑̅̂̑̈́̋̀̿̂͌̚͜͝ť̸̫̞̖͚c̸͚̖͈͊͗̔̒͝͠o̴̸̼̖a̝̫̗̋̀̍̎̃͘͠ň̶̴̶̶̶̸̶̨̛͕͚͈̭̠̠̥͈̫̼̱̞̥͈͕̬̮̱̎̓́̋͒̿̆́̎͗̎̈́̅͂̾̈̑̈͊̈́͌͗͋̎͜͜͜͜͜͝͝͝͝()[S

    move-result-object v18

    const v21, 0xdaa1

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ą̸̶̴̡̧̫̺̝͎͓͎̮̫͙͎͖̗̀́͋̊̀̍̔̊̈́̒͂̂̋̿͌̌͜o̷̸̴̧̘͚̪̮̫͎͒̂̑͋̅̅͑̏̾̈̿͘͜͜͠t̵̸͈̯͎̻͋̋̅͑ơ̥͌͠ḁ̸̵̷̵̸̢̧̧̨̲͎̺͚̱̮̘̺͇͉̝͎̦̗͉̲̺͉̆̂͌̈͐̈́͗͋̆͐͂́̈̌͐̈́̌̓͆̅̅͘̚͜͝͝͝͝͠ͅp̛̛̙̭̮͙̿̑̐̔̚e̙̗̝̝̻̥̺͓̋̂̋͗̀̈́̃͝c̸̸̨͎̻̬̥̻̠̭̯̩̮̥̭̫͌̎̔̂͌͋̎̋̎͗̐̈̌̾̋̕͝k̷̷̢̛̪̫͕̮̻̫͈̹̲̹̤̯͈͕͈͎̗̭̘̫̿͌̑͋́̈̑̀̋̎̎̓̌̂̂̀͑̋̅͆̅͋̂̅̾͋̚͘͘͜͝͠͠P̢͓͎̥̭̯̯͋̌̉̾̅̾͘͘͘á͉̗̺̯̈́̋̌̊͝â̸ą̸͈͚͉͚͚̓̚͜()Ljava/lang/String;

    move-result-object v17

    invoke-static/range {v17 .. v17}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v17

    xor-int v21, v21, v17

    const v19, 0x1aaea6

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷͙̠̆ͅņ̴̸̷̴̢̧̛̛̟̱̥̘̖̭͈̘̻̮̭̥̥̫͈̫̥̺̫̭͚̗͓̑͐̅̈́͐̄̀̋̈́͂̑̈́̋̈̃̍͊̾͊̊̌̊̌͋̃̑̂̅̍͆̑̈̔͑͌̇͗̂̚̚͘͜͜͜͝ţ̴̶̸̢̙͎̦̖͕͈̰̫̻̔͋́̂̃̀̀̅̏̋͜͜͝ả̸͎̫̜̫̘̯͎̻̓̎̆̚͠͠a̋h̪̫͉̥̤͆̂̀̈͑́̌t̖͎̻̭̦͉̮̦̲͕̃̑͗͑͗̀͝u̵̶͕̩̫͑͒l̷̩̫̠͗̐͌̏͋͋̋̎̕͠ư̸̜̗̋͋̊͗̅͊͋pä̴̸̧̢̧͚̘͈̯̩̭̦͎̯̥͎͚̱̠̘́̌̋̑͐͑̎̉̅̄̈́͘͠͝͝͝áe̦K̪͗h̵̷̴̸̸̷̷̛͚̖̙̮̬̰̞̭̃̑͗̐͌̈́͂̈̋̈́̂̽̈́̏͝a̶̶̸̸͈̤̗̱̭̾͊̋͗̋͆̿͝͠ĉ̸̭̭̠͝()Ljava/lang/String;

    move-result-object v17

    invoke-static/range {v17 .. v17}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v17

    xor-int v19, v19, v17

    const v20, 0x1aaf61

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->t̢̚K̩̘̗̏͆̈́Pḩ̻tk͐e̶̵̢̨̨̫̯̮̫̗̯̞͑̈͌̇́͋́̔̅͐̈́̋̑͗̃͜͠ã̸̪̼̖͂͑͊̈a͉̘̩͑̔͝o̶̷̧̥̥̹͎͐͗̃̊͂͜e̍̽̔̆h̚ţ͎̙̘͐͐̋̂̌̏̎͑̚l̼̪̾͋͋͝ǎ̛̯͂̈̈K̠͉̗͈̘̎͋̂̎K̘lc̸̶̛̬̯̗̫̮̦̆̄̎̈́̑p̸̸̛̛̖̙͚̲̼͕̘̰̫͚͈̂̿̑͆͋́͋̀̌̿̂̚͜͝͝ö̵̶̢̧̢̢̩̲̲̯͎̠̻͙̅̽̈́̈́͗͊̑̅̌̌͜͝͝a͘K̵̷̨̡̦͎̟̰̹͓̙̠̄̎̄̾̀̔̋̌u̶̗̘͗͗͜͠a̸̸̷̢̢̺̘͈̩̯͋̑̋͘h̶̢̯͈̯̫͌̌̈̋͜a̸̫ä̹̭̹̙̱́̈͆̆̌̌͜͝B̶̨̧̛̯̟̺͕̦̺̂̏̋̌̈́͊̅͑̀͘͜͝͝()Ljava/lang/String;

    move-result-object v17

    invoke-static/range {v17 .. v17}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v17

    xor-int v20, v20, v17

    invoke-static/range {v18 .. v21}, Lcom/android/settings/device/MiuiDeviceNameCard;->Ķ̸̢̻͇͕̿̿̃͆̄̑̚͝ȟ̵̲͕̔̌̈͆̎̒h̨p̺̼̮̃͗̂̈́͌̿̆a̵̡̮̗͕̙̥̘̯̖̪̤̯̋͋̾̂̑̃̂̑̄̈̾͒͑͝͝Ḱ͓͎̂̂o̷̶͕̫̹̪̤̥̪͉͌̍̌̌̚͜͜͝͠͝͝k̷̬̈̈l̃B̯̎͋̎͒͂̂̚B̛̈́̑̃͜Kţ̧͉͓̑ű̢̮̋n̛͚̟͎͙̹̝̖̅̍͒̎͝ě̴̖͚̘͕̺̗̫̌̎̋̍̋̑͑͊͒̌͜͜o̶̖̯̠̿̈͌͌͝a̴̤̜̠̰͌͜ͅB̧̭̠̈̎̎k̴̨̹̚ą̵̸̸̸̷̡̧̧̧̧̺̗̺̟͇̯̫̯̹̪̯̫̫̭̱̈̂̀̈̂͘͘͜͝͝ͅȩ̵̭͚̫͉̫̿̋̃̂̚Ṗ͉͙͙̭̹̬̮̂̊̑̋̋̍̂̆͝h̷̛̝͈̺̬͋̑̋͘͠͝͠a̷̯͕͈̔̋̂͠o̷̦̿̿̌̅̂͌͂̇(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v18

    move-object/from16 v1, v18

    invoke-static {v2, v1}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̈́ñņ̶̵̸̷̢̢̛͚̥͎̟̱̭̫͈̼̗̗͈͈̖̌̐̋͑͋̃͌̋̇͂͗̉̃͐̈́͌̊̎̎̚̚͘͜͠͠ͅo̵̖̱̫̥͆͒̿̈́̈́̊̕͜l̩̯̺̗̺̙̲͙̀̈̋̿͗̋a̭̗͜P̷̢̡̱̤̖͉̩͉͙͓̘͚̃̿͝h͈͚̲͂̆̏c̸̰̼̗̥̯͎̫̄͋͝k̡̯̂͋a̸͙̘̫͓̰̎̏̋̆͊t̸̩͙̲̘̫̮̺̅̎̈́̄̈̑͊̌͐̌̆͘̚̚͘t̴̰̗͎͖̖̺̰̘̮͙̘̅͗̿͐̂̍̌̀̒̕͜͝͝͝ṉ̢̫̮̺͚͈̻͚̰͚͑̾̌̌̏̈́̌͊̒͠o̸̧̗͓̙̜̙̐̈́̑̎̎͗̑̿̃̿ͅâ̷̷̶̯̤̫̫̭̋a̶͋͂̋K̛̯͙͓͕̲̦͊̈pa̸̶͓͚̙̫̍̃hȩ̧̧̡̛̛̘̫̩̥̮̩͓̖̌͋̓͑͊͊͜͜e̷̢͖̾͂͗͜͜(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v1

    const/4 v2, 0x1

    invoke-static {v0, v1, v3, v2}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->e̫̮̅ư̶̶̧̢̡̛̱͈̘̦̼̮̺̩͕͕͕̥̯͈͎̬͙̑̑͗͐̈̀͗͊̅̈́̂͗̕͝͝K͙̀͠ā̶̸̸̲͕̬̼̮̾͘͠epą̛͚̼̗̮͎̎̉c̸̴̶̸̶̡̧̡̛̫̪̥̲͉͕͉̺̾͌̃̐͗̅́͑̐̑̔n̿̕̚n̸̷̷̢̛̘̭͚̙̩̩͓̫̔͐̑̂̔͜Ķ̷̸̛͈̩͇̀͒̈́̑͋̚͝͠o̩͉̗̦̭͈̭͗͗̃͐̇̂͌̿̚͠͝ǎ̸̭͈̱̻͖͙̩̋̋̏̍͌̔́͘͜͝͝ͅȩ̶̷̨̛͇͚̖̰͈̫̦̻̦͖͂̎̃̇̑͌͜n̻̗̲̫̫̑̌͝p̯̭̈̑͑n̷̴̻͉̖̟̜̗̹͈͎̞̤͈͋̈́́̋̍͌͋̌͑̌̑K̴̨̛͓͉̱͓̫͕̑͗̿̌̌̌̾̚̕l̶̡͕̻͉͗̎̒͘͜Kt͘K̴͎̻̈n̠̯͑ä̸̶̧̹͎̹̋̏̂(Ljava/lang/Object;ILjava/lang/Object;Z)Landroid/view/View;

    invoke-static {}, Lcom/android/settings/device/MiuiDeviceNameCard;->a̪̮h̷̏͋a̶̯̻̮͌́̂́̃͝ǒ̴̶̴̶̵̧͚̘̭̗̬̹͓̩̫͂͗͋́͐̆̍̋͒̾̀̋̏̐̐̚͝ōo̸̷̧̨̘͎͓͚̤̱͚̖̫͊̋͒̂̀̾͑̎̿ắ̧̼̖͚͉̯͎̯̠̏̌̾̎͜͝k̴̙̙̗̂̔̅̌͜a̸̴̸̢̧̛͙̱̫̝̤̭̮̦̮͖̎̍͐̄̋͌̆̍͑̌̚͘̚͜͠͝a̧͎̗̭̯̠͈̥͖̗͗͌͑̄̈̈́̈̄͆͜a̴̒̈́ķ̵̸̧̛͙̭̯͕̘̈̍̌͋̏̽̔̌t͚͘͝P̷̭̕nņ̶̵̶̢̫̯̦͓̫͓̘̩̫̘̲̗̾̈͋̋͌̈́̈́̃͂̃̊͗͐̂͋͝K̶̯̫̥̈̽͌͜͝a̸̵̹͈̯̱̮̹͎̤̦͙̤̔̄̃́̋̆͘͜ą̵̶̛̼̞͉̰̥̰̙̺͙̫̈́͌͗̍̂̀̒͆̈́͌̌̋͝͝͝P͚̗͙̈͂͒ǎ͙̐͘ͅ()I

    move-result v0

    invoke-static {v3, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    check-cast v0, Landroid/widget/TextView;

    invoke-static {v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ḧ̶̨̦͕́̅k̞͋́o̸̠̞̲̐̓͝͝ͅP̴̸̧̧̖̱͚̭͚̙̲̻͌̄͌̇͊͗̋͜ơ̴̶̧̢̩͕̫̘͎̭̯̭͈͓̬̫͒̾̃̈́̌͑̐͋͊͑͑̍̿̋̃̂͜͠͝͝͝͝h̷͚̯͌̚͝͠a̧͙̹̼̙̘̙̽̿̔̀̏́̂͗̒̔͗͂̌͘ṳ̦̯͝ų̶̶̛̗͙̦̫̥̯̗̋̑̔͜͝å̴̅̈́͝a̴̶̴̡̢̘͉̪̺̭͕̮̥̱̗̥̫̪͎̱̜͈̅̏͐̐̐̿̌̎͂͜͜h̨̹̥̙̻̯̠̉̾̌͌̿͊̑͂͐̓͌̚͜͝P̷͚͂̋͑p̴̸̢̢̧̛̛̛̹̻͚̫̹̮̤̱̥̮̼̩͎̔̍̃̊̀̑̑͌͋́̈́́̋̾̐̂̈́̈́̏̂̓̅͊̂̚͘̚͜͝͝͝͝͝p̴̶̴̸̢̛͎̫̭͉̆̃͗͗̔̎̆̔̿͋̚͝͝͠͝͠B̴̸̸̶̨̢̛̻̿̋͋̂͒̈́̕(Ljava/lang/Object;)Landroid/content/res/Resources;

    move-result-object v1

    invoke-static {}, Lcom/android/settings/device/MiuiDeviceNameCard;->n̛͚͓̥͂K̸̮ö̭̎ç̸̷̮̫̗̫̰̰̍̄̚͠ä̷̷̜̪̘͈̫̯͚́͋͊̋̋͊͑̋͜͜B̘̺̯̒o̶̧̧̠̘͉̫̙̘̹͇̊͂̆̋̅ȅ̴̥̭̗̙̠͚̫̮̺̗̘͚͎̦̠̅͋͗͌̉́̂͐͑̆͆͘͜ã̶̷̢̛̰̪̱̯̗̫̰̙̜͙̼̫̲̼̫̯̫̲͉̗͗̾͒̈̑͊̎̏̃́̈̉̈́͋̊͘͝͝Ķ̸̴̜͎͚̗̘̀̽͑̾̿̂͌̅̄͗̚k̷̫͎a̗̎̄͌͂̃̚ḩ̷̭̭͕̥̇̀̈͑̅̈̀̄P̱͙͇̮͈̋́͜Ķ̧͉̹̹̯̦̪̹̃̆̄̂̈́̄̃͝͠aã̵̸̷̭̰̭͉̯̬͚̱̲͚̪͓̮̲͎̱́͒̀̂̆̂̈̿̃͊̄͆͋̈͗́̏̓̿̚͜͜͝͝ͅa͓a̼͋̅̈̂͋̍͝ȃ̧̲̫̩͘u̠̲̫̞͎̠̅̎͑̌̾̎̈ŭ()I

    move-result v2

    invoke-static {v1, v2}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->P̷̸̷̢̛͎̙̺͗̽̋̂̕͝K̴̭̺͈̺̭͚̭͚̭̙͌͗̀͌̇̒̀̃̀̃̋̍́̆́͝͠a̶̫͒͜a̡̗̲͙͈͚͌̿̑͌̚Ka͈̜͒̋ḧ̙̠́͗͐͝h̶̶̸̴̛̪͉͙̺̯̯̤͋̀̈̒̎͌͋̑͜t̴̸̡̮̻̪͉̺̞̙̘̬̯̂̃̂͘͘͝p̸̫͉͓͙̼̻̭̙̯̥̼͕̋̔͆̈̂̑̀͘͘͜͝͝l̺̼̫͌͋̋͌̈́̆͗̒P̵̟̤͆B̝̪͈̅͗͠ȁ̘̦̙̚͜ä̞́̐ţ̧͕̖̥̈́̈̋̔̂̍͘͝ã̧̭̩̪̯̂̂͗̄͌͋̈͘͠ǒ̷̸̶̶̴̧̺̗̺̺̠̼̦̭͚̙̟̘͈̩͓͉̞̤̭͉̞̥̪̺̗̯̈͌̌̃̔̋̈̈́̏͐̈́̌̑͗͒̐̂̄͗̾̄͘̚͜͠͝o̶̷̥̹̍̔â̧͒͝͝p̨̹͓̝̖̤̺̹̈́͂͗̉̐͊͘͝ü͜(Ljava/lang/Object;I)Ljava/lang/String;

    move-result-object v1

    invoke-static {v0, v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ơ̸̤͓͓̯̟̱͈̯̎̂͗̅̎̎̌͑́̌͗͋͝͝ką͚͚̭͕̠̫̪͚͚̯̠̗̭̹̭̪̭̫̎͌̔͌͂̐̈́̌̓͑̂̃͊̅̽͆́̌͘͘͘͝͠͝ͅK̸̸̸̷̢̹̯̟͈͎̈́͂͋̾̽̆̂̆̄͋͌̊hh̵̸̛͎̮̬͑͊̓͒͠k̴̸̶̴̨̛͈̙̠͕̪̲͓̲̂͑̒̈́̄̃̈́̈́̐̿̚ả̶̧̧̺͓̥̭̭̑̂̈͗͘̚͝c̴̢̖̮͕̼̯̦̪̪̠̺̯̙͖͓̎̈́̎̾̋͗̆̂͗͌̏̈̚̚͝͝p̸̵̷̶͈̼͈̹͙̫̘̘̘͓̐̅̈́̂͗̋͘͜͝P̵̴͓͂͋̀̈́̆̀à̶̌̓̑̈́ö̴̷͙̘̗̯̥͖̻́͐̈́̾͊͆̑̄̑̀͘u̸̫̟̯̔̂͌̃̋́̆̅̔͌͆̃͗̿̅ắ̸̺̺̞̦͈̩̺͒̅̾K̶̸̸̛̪̰̺͓͎̜̭̬͚̿̋̆̋̑͜(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {}, Lcom/android/settings/device/MiuiDeviceNameCard;->ut͈̱͘c̷̸̶̷̴̸̨̛̹͉̱̪̭̫̠͊͗̔̌͗̀̀̈̌̂̂̈́̌̅́̒̚͘̕̕͜͜͝͝͝͝l̛̺͉͈̠͗́̋̈́̃́ơ̷̸̛̜̟̺̯̮̩͚̯̈̈́̋̾̑͝͝n̶͎͕͚̫̮̈͑̐̅̎͂̌̌̊͐͠ͅp̸̶̷̢̲͈͕̮̝̦͈̯̈̋̽̃͊̔̆̃̉̚͜͝ö̵̷͕́̆̎̌B̸̙͉͋͊̏̋̐̎̆̾̚͜͝͝l̶̴̴̛͖͉̻̭͎̗̫̹͕̗̹̭͕̈́͋̈̂͑̌̍̎͊̽̆͌̋͌̚͜͝͝͠K̶̛̝̋͌̈l̵̨̧͙͎̺̞̹̱̭̱̪͙̋͊̎̅͂̑͒́͝͠e͎̯͌̂͋à̸͎̲̤̋a̸̷̷̭̦̲̘̔͘͝Ḱ̷͕̱̺̻̭̥̃͗̍̀̌͘ac̢̨̪͎͓̤̮̟̙͚̹̪̙̼̭̈́̎̃͒̂͂͌̌͗͘̕͜a̷̶̴̴̺͚̦͚̘̎̅̌͌͗͊͘()I

    move-result v0

    invoke-static {v3, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;I)Landroid/view/View;

    move-result-object v0

    check-cast v0, Landroid/widget/TextView;

    iput-object v0, v3, Lcom/android/settings/device/MiuiDeviceNameCard;->mDeviceNameText:Landroid/widget/TextView;

    invoke-static {v3}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->p̻̤̦͎̭͖̘͌̄̀̾̏̾͗͘ḩ̴̵̡͎̦̾n̞̥̦̝͗ö̴̶̴̴̷̸̧̢̢̲̦̱̹̫̫̮̺̘̺̻͎̦͙̫̗̫̤͂͌́̃̒̅͗̌͌́̄̃͒̓̈́̑̈̆̀̈̌̆̍͋͊͐͌̑͘͜͜͜͜͝͝͝ą̶̶̨̧̛̭̘͈̮̲͓̖̪̩͙̫̝̫̰͇̝̔̑͋̂̈́̄̈̌̏̅̋̿̈́͜͝͝ͅB̧̥̫͙͙͌͒̍̎̈͌̚͝ǎ̸̸̫̮̖̋͆̑̑̍̈͘͘B̶̧̝̙̗̰̉͒̍̎͒̿̋͌͒͝ň̷̵̢̛̛̺̤̯̝͎̫̪͇̮͎̘̹͈͉̜̘̻͓̫̜̐̋̈́̋̀̊̅͘̚̕͘͠oűơ̘̬̮̹̈̈́͌̀̎t̶̙̥̘̯̭̂̿̌͊͌̎͌͗̑͌P̙̔͜oa̸̸̧̻͓̺̫̦͚̩̩̮̺̦̮͊̂̃̈̃͌̈́̎̾́̈̿̈́̑͘͝͝ͅț͚ṷ̧c̗͎̲(Ljava/lang/Object;)V

    invoke-static {v3, v3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->o̸̴̶̡̧̧̩̗̥̹̪̮̺̲͖̯͖͈͗͗̈́͌̍̇̈͋̏̈̀̾̏̑͑͗͗͜͝͝͝ǎ̧̦͚̺̖̈́̑̇͐͜o̹u̸̖̦ķ̫̠̗͎̿̀̔͑a̷͕̯̰̯̋͊͗̈͋͌ţ̸̷̸̢̛̗̯̻͚̥̪̋͋̇̎̌̎͜a̶̶̶̶̵̸̛̰̪͙̩̻̮͌̎̔̂͗͌̄͑͌̂́̕l̢̹̫͚̗̘̱̬̻͙̯͈̀͗̐̓̑̿͗̎̆̃̃̋́̅͋͘͜͝͝͝͝͝P̆͝uŏ̴̧̢̢͓̻̗͎̭͖̋͗̋̂̋̅͗͒̈͝o̷K̘̂̈́̌̚e̥t̴̵̢̹͚̗̮̫͇̮̲̪̭̗̼̰͚̗͗̌̋́̈̿͋̂̓̈́̂̄p̥̩̾͋̈́͗â̶̸̙͝űk̩̲̤͑͒͂̚h̛̪̼̫̩̠͗̆̌̇̋͘ë͎͕̽t̜͕́̑ç̸̖̙̮͙̫͙̤͎̰̎̾͐͂̈̀̌͑͗̉͌̂̚͠(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->a̰̟͐̅̈́̂ą̸̷̡̛̮͈̫̫̪̫̹̋̐́͗͗͊̑̊̈͝u̶̹̺̮̯̫̦͚͕̺̲͓̺͚̺̫̘͙̒̄̎͒̋̃͐̑͘h̘͗͊͝Ķ̷̛̱͕̙̫̈́͊͗͋͑̀͋̋͝Ķ̷̵̶̸̛̠̤͎̰̹͓̻̯̙͇̘̫̎͒̂͋̿́̅̑͂̽̀̏̄̇̍́̍̿̐́͘͠͝͝͝͝͝ͅͅķ̶̧͉̺̯̱̮̹͚̰̎̈́̀̐͌͜ö́̇P̧͚̮̍̈́á͈̹̠͗k̞̥̗̭̯̯͌̃̚k̸̛̺͎̠̫̭̂̋̋̋̆͑͠t̷̸̷̷̴̶̢̧̢͈̭̼̞͉̼̹͌̌̉̌̂͂̑̓͋͜͠n̷̢̫͓̗̜̈́̈̑̐̆̌̍̉̋̈́͝͠pĉ͌ţ̵̨̨̛̥͚͎̠̼̜̼͎̿̑̈̌͗͗̈́̍͌̈́̌̈́̀͘u͕͝e͉͐lpK̡̧͉͙̓̌̈́̌ĥ̠̫̤̫̑a̵̸̺̱̭͗̋̓̂͠()I

    move-result v0

    if-eqz v0, :cond_7e

    const/4 v0, 0x0

    invoke-static {v3, v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ȟ̸̸̞̗͝P̷̨̧̱͇̖̫̎͊K̂P̸̷̸̢̨͚̹̭͚̫̪̱̭̤̦̮̀͌̄͆͂̂̀͌͠a̡̩͙͐̊͌̾ç̀̃̎͑̌B̴̸̛̮̜͓̫͙̮̋͌̈͗̍̎̚͘͝l̺̹̲̿B͒a̸̧̡̲̺̪̞͓̖͆̌̈̔̍̾̔̂͐̂́t̴̫͝pl͉̠̱͊̇̈͌͑â̢̲͎̋p̧͙̤̪͖̯̖͑̓͑͗̋͌̀̐͝ͅB̴̡̢̧̛̗͉̪̂͌l͕̭̩ņ̸̷̶̷̨̨̢̨̫̱̭̗̰͓̰̺̱͚͉̼̯̝̜̘̗̭͖̹̱̠̺̫̱͇͚͂̅̐́͐͒̅͗̅͌̽͌̎̈́̈́͋̿͌̌̂̋̂͜͜͝͝͠ḩ̶̸̴̧̢̮̘̤̫̘̔͌̑̏̂̃͘͜k͓̂̇a̶̢̧̧̛͉͚̪̤͈͓͙͎̤̮̙̟͓̘̱̫͈̋̂̈́̋̓̍̌͗̋̿͂͊͑̍̆̅̈́̎̃̀̾̒̃̀͜͜͝͝͝(Ljava/lang/Object;Z)V

    const v0, 0x3e99999a  # 0.3f

    invoke-static {v3, v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->o̡̨̢̪̱̱̺̻̪̯̱̩͑̈͗̊̚͝ta̧̦̹̻͕̤̯̱͚̝̖̙̲̪͎̖̽̌̍̿͑̋̾͗̉̋̈́̈͘͘͜ķ̸̸̶̸̴̨̢̹͕͚̙̗̱̯̱͓̥̫̫̭̗̖̞͎͕̪̆̎͗̔̋͋̋͑̾͘̚͝͝ͅu̶͖͚͐̇͠ĺ̛͇̘̲͕̈͌̄B̫̐h̸nt̵̨̪̺̥͓͈̰̙͚̞́̅̂̋̃̅̑̋͝͝͝͝͝ḁ̧̈̋͜c͚͓͗l̯̈̀̈́ȩ̸̴͎̲͚͕̯͗̾̂̄͘͜BKh̸̗̖͌̒̋̈́p̛̹̲e̛̦͌̂K̶̶̶̵̛͙̫̰̯̥̫̦̹̍̌̈̿̇̔̎͝ͅua̸͓̤͈a̧̖̗͎͒͌ç̸̵̶̭̺̭̹̮̺̹̮̦̪̺̆͑́͋̂̑̔̋͌̀͗̆̃̎͜͝a̷̷̢̧̲̫̭̘͕̫͋̋́̎̅̈́͗͘͜͝t̷̢͈͈̻̙̮̮̾̈́̆̆̔͑̿̆͘̚͜(Ljava/lang/Object;F)V

    :cond_7e
    return-void
.end method

.method public static l̲̻̔̑̎͘P̴̷̛͓̝͕̮̪͓̩̫̆̅̅̔́͋̌̈́͂͠͝ő̸̶̤̋͑͋̋̀͌Ķ̧̲̌ö̻̻̭̫͌K̛̺̦̥̫͉͕̑̚K̸̶̈͌̌͘͝͝h̷̢͎̯͈̫̘̃͂͑̑̃̊̄͊̌͌͗̋̈a̻͠a̸̸̫͖̮̼̾B̘̗̰̔̈̒̾̏̋͘ơ̶̵̵̴̶̢̢̫̤̯̗̹͚̠̥̰̝̫̱̹͎͕̄̌̎̈͌̑͗̌̌̅̂̌́̈́̈͗̃̎͋̎̍̚͝ͅl̸̺̼͎̺̑̒́̌͊̔͑a̸͕͈̭̫͎̮̹͕̪͉̮̱̭͕̘̜̦̱̅͑͆͌͐̂̑͂̄͒̿͊̄̈̎͗̈́͗͌̚̕͜͝͝o̎͑ǎ̫͜K̸̷̵̸̵̷̢̫̦̫͈͕̮̱̭̹̥͈̘͈̫̄̅͌̑͑̈́͒̃͆̎͒̍͑̃̋̆͜ke̛͗ä̸̶̵̫͕̮́̎̿̌̔͋̈̎̅̐̚͜͠l̢̯͝͝ä͚̌͝(Ljava/lang/Object;)Lcom/android/settings/dashboard/DashboardFragment;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_b

    check-cast p0, Lcom/android/settings/device/MiuiDeviceNameCard;

    iget-object v1, p0, Lcom/android/settings/device/MiuiDeviceNameCard;->mFragment:Lcom/android/settings/dashboard/DashboardFragment;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static l̨̛̺̫̹̦̼̺͚̯̊͐̈́̀̌͘̚ͅc̶̸̸̛̮̫͈͕̹̤̞̭̪̦̫̍̿́͗̽̂̀̍̌̿̌̓̾̉̍͆͌͘̚̚̚͜͜͜͝ͅã̸̵̶͚̹̫͈̩̼̲̦̤̎̄̌͑͌͝͠K̸̯̫̔̈́͒̌P̶̺̦̥̈̂͒̌̈̅͝͝o̸̸̶̢̖͈̫̯̪̭͚̯̯͎̮̠͐̃̈́̿͌͊̎͑̈́̀͘͝ṷ̼̋͒̈́͊̎ű̯̗̝̃͜B̶̵̻̘͓̫͒͌̄̄̀͜ͅä̸̶̸̺̗͖̾̓̌̄̈́͜ȧ̵̱͉̯͙̂̔̈̄͌͒̀̋͑͝͠p̫̺̃ä̸̸̱̫̂͋̋̂̈̕̚͠e̦̒l̛̗͚̆̿͋͜K̷͇͕̺̍͝ã̧̮̹̎̋͊̎͗̀͝ö̮̱́̃͑ẗ̵̸̸̢̛̛̠̫̦̠̦̥̩̺̱̤̝̫̯̹̗̦̰͓̮͖͙̭̲̭̥͐͊͊͑͐̉̂͋̅̈́͋̌͗̔̌͌͜͜͠͝(Ljava/lang/Object;)Landroid/content/Context;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_b

    check-cast p0, Landroid/widget/FrameLayout;

    iget-object v1, p0, Landroid/widget/FrameLayout;->mContext:Landroid/content/Context;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static n̛͚͓̥͂K̸̮ö̭̎ç̸̷̮̫̗̫̰̰̍̄̚͠ä̷̷̜̪̘͈̫̯͚́͋͊̋̋͊͑̋͜͜B̘̺̯̒o̶̧̧̠̘͉̫̙̘̹͇̊͂̆̋̅ȅ̴̥̭̗̙̠͚̫̮̺̗̘͚͎̦̠̅͋͗͌̉́̂͐͑̆͆͘͜ã̶̷̢̛̰̪̱̯̗̫̰̙̜͙̼̫̲̼̫̯̫̲͉̗͗̾͒̈̑͊̎̏̃́̈̉̈́͋̊͘͝͝Ķ̸̴̜͎͚̗̘̀̽͑̾̿̂͌̅̄͗̚k̷̫͎a̗̎̄͌͂̃̚ḩ̷̭̭͕̥̇̀̈͑̅̈̀̄P̱͙͇̮͈̋́͜Ķ̧͉̹̹̯̦̪̹̃̆̄̂̈́̄̃͝͠aã̵̸̷̭̰̭͉̯̬͚̱̲͚̪͓̮̲͎̱́͒̀̂̆̂̈̿̃͊̄͆͋̈͗́̏̓̿̚͜͜͝͝ͅa͓a̼͋̅̈̂͋̍͝ȃ̧̲̫̩͘u̠̲̫̞͎̠̅̎͑̌̾̎̈ŭ()I
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    sget v0, Lcom/android/settings/R$string;->device_name:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ò̷͎̗̼͊̍̂̚̚͠l̶̛̯̏̌ä̛̩̎́̚c̸̷̶̛̫͕̰͂̾͝͝Kn̵̷̸̘͑K͌̉̃̾ę̷̵̛̛͓͈̫̫̫̞̘̹̫̗̜͚̖̬̫̻̂̍͂̎̋̑̿̂͑͜͝͝k̸̷̷̜̖̫̭̠̺̖̲̭̘̭͆̈́̃̈́̉́͌͋̄̂͗̉̕̕͝K̭̜͌̋͗l̷̛͕̫͕̈̈́̎̆̈́͐̔̋Ǩ̷̥̥ḧ̸̷̶̶̴̸̢̢̨͚͈̦͉̬͈̯͇͈́̌̌͐͑͌̕̚͝͝h̴̶̢̢͓͈̯̼̜̖͚́̋͊̈́̑͊͊̈́́̒̈́̄͘͘͝ǎ̸̑ă̷̶̴̸̷̧̧͙͈̦͉̥̾̈͂̌̋̂̑͗ç̸̸̲̩̻͉̞̞̗̺̫̰͒̋̋͗̄̌̂͜͝a̶̧̛̫̟̭͙̰̦̮̫̮̱̾͐̒̈́̃̄̃̂̈́̋̂̿͘͝ͅn̛̑t̶̩̘̭h̩̯̹͎̖̋̀̆̄̂͗̋̃̾̍̂̈̃̚(Ljava/lang/Object;)Landroid/widget/TextView;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_b

    check-cast p0, Lcom/android/settings/device/MiuiDeviceNameCard;

    iget-object v1, p0, Lcom/android/settings/device/MiuiDeviceNameCard;->mDeviceNameText:Landroid/widget/TextView;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_b

    invoke-static/range {p0 .. p0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̫̤͙̦̂̃̄̍͘͜͠c̴͎̫̬̠̞̋̈̈́̀͐͜͝͠͠͝K̵̛̼͋̍̌n̵̸̻̠͕̥̂ä̘̬̥͌̏͝oa̴̶̸̧̩̯͈̋̈́͝c̵̛̩͓̗̹̺̦͉̖̼̯̋̑͌̎̿̋̔͒̿̋̌͌͘͝a̛̩̹̹͐̄̓̅͗B͖͓̫͉̔͌oa̤͚̋̂͜ẖ͙a̸̛̛̞̦̫̭̿̋̌͌͋̂̿͘͠K̴̸̷̸̛̦̯̹̺̘͇͎̦̭̉͂̎̏̾̽͗͆̅̂͑̾͗̈́̅̈́̑͘̚͘t̷̷̵̶̶̶̴̨̧̗̗̘͕̰͈̠̱̠͈̺͉͇͓̙̫̮͕̪͎͎̗̝̼͊̿̑̈̋̌͂̽͗̋̍͐̆̈́̃͗̑͗̑̈́͌̒̀̀̌̓͂̄̐̑͒̚͘͜͜͜͜͠͠K̠͈̫̻̲̫͂̎̋̂͒͠a̮̤̫̪̎̃͜o̧u͇P͉ḻ̷̺̲̫̺̦̫̗̺̫̫̫̻̎̂́̈͌͐̽͌͊͗̀̌̽͘͜(Ljava/lang/Object;)I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static t͓̭͎ṱ̶̶̴̴̢̨̧̢̧̨̛̛̲̫̞̭̥͓̫̼̮̖̯̫͚̯͈̫͖̞̼͋͋͑̽̈̅͊̅̌͌̈́̅̎̈̌͌́̾͊͜͝B̶̶̘̎͋͒̌̄͘ḧ̸̨̖̦͇̯̹̭̔̋̄̋̋̒͗͊͝͝ȃ̸͚͓̩̟̹͙͈̾̂͑͋̈͂̐̌̌͜ņ̶̷̷̸̧̛̹̗͕͖̜̮̻̮̤̫̱̦͚̱͚̘̬͌͋̔̽́̐̏̋̌̋͐͗͂͗̈́͐̽͗̏̄͑̔̿́̎̂̚͘͘͜͝͝͝͝l̶͈̺P̸̸̭͈̄̋͆͐̈́͂͌͘̚͝ǘ͓p̸̷̸̸̛͉̩̮͚͉̦͎̫̦̥̰̘̟͈͎̋̂̽͋͗̋̌̋̌͒̀͜͝͝͝͝k̄̔̂͝Ķ̸̴̜̪̗͕͈̱̼̮͓͙̩̱̮̗͂̋͌͗̈́͑̊͆̀̉͑͗̂͝͝h̯͌̈͂̋̃B͈̗̯͌͑͝͠K̂P̸̱͕̺͉͚̫͗̏̍̿̋̂̅̈́͗̑͘(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_c

    check-cast p0, Ljava/lang/String;

    invoke-static {p0}, Lcom/android/settings/report/InternationalCompat;->trackReportEvent(Ljava/lang/String;)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static ut͈̱͘c̷̸̶̷̴̸̨̛̹͉̱̪̭̫̠͊͗̔̌͗̀̀̈̌̂̂̈́̌̅́̒̚͘̕̕͜͜͝͝͝͝l̛̺͉͈̠͗́̋̈́̃́ơ̷̸̛̜̟̺̯̮̩͚̯̈̈́̋̾̑͝͝n̶͎͕͚̫̮̈͑̐̅̎͂̌̌̊͐͠ͅp̸̶̷̢̲͈͕̮̝̦͈̯̈̋̽̃͊̔̆̃̉̚͜͝ö̵̷͕́̆̎̌B̸̙͉͋͊̏̋̐̎̆̾̚͜͝͝l̶̴̴̛͖͉̻̭͎̗̫̹͕̗̹̭͕̈́͋̈̂͑̌̍̎͊̽̆͌̋͌̚͜͝͝͠K̶̛̝̋͌̈l̵̨̧͙͎̺̞̹̱̭̱̪͙̋͊̎̅͂̑͒́͝͠e͎̯͌̂͋à̸͎̲̤̋a̸̷̷̭̦̲̘̔͘͝Ḱ̷͕̱̺̻̭̥̃͗̍̀̌͘ac̢̨̪͎͓̤̮̟̙͚̹̪̙̼̭̈́̎̃͒̂͂͌̌͗͘̕͜a̷̶̴̴̺͚̦͚̘̎̅̌͌͗͊͘()I
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    sget v0, Lcom/android/settings/R$id;->summary:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method


# virtual methods
.method public onClick(Landroid/view/View;)V
    .registers 59

    move-object/from16 v7, p1

    move-object/from16 v6, p0

    new-instance v4, Landroid/os/Bundle;

    invoke-direct {v4}, Landroid/os/Bundle;-><init>()V

    invoke-static/range {}, Lcom/android/settings/device/MiuiDeviceNameCard;->ą̷̷̸̶̻͚̘͕̥̤̬̮̦̤̮̭̭̤͓̮̙͚̫̹͑͐͑̈́̋̒͑̌͒̈̃̆̆̀̏̕͝͝͠n̵̴̯̘̗̻̠̹͓͉͚͇̤̾̋̊̍̂̏̅B̛̩̼͚͉̎̎̎̎͘͜͝co̸̧̡̍̈͂̑k̶̼̱̗̮̦̰͚̱̬̫̎̋̈̌́̃̃͑͗̅̅̽͜͜͜͠n̪͚͕̮̱̋̿üo̶͕̮͌̑̈́͜͜u̫͈ǩ̶̶̙̥͙̪͈͎͌e̶̻͈̦̺͐͂̊̉͗̑͘͜c̶̢̢̺̮͚̫͕̻̫̄̿̕ǫ̸̷̜̰͈͇̼͎̭̱̌̿͑̅̂̑̈́̋̀̿̂͌̚͜͝ť̸̫̞̖͚c̸͚̖͈͊͗̔̒͝͠o̴̸̼̖a̝̫̗̋̀̍̎̃͘͠ň̶̴̶̶̶̸̶̨̛͕͚͈̭̠̠̥͈̫̼̱̞̥͈͕̬̮̱̎̓́̋͒̿̆́̎͗̎̈́̅͂̾̈̑̈͊̈́͌͗͋̎͜͜͜͜͜͝͝͝͝()[S

    move-result-object v27

    const v30, 0x1ac113

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->a̛̖̬̟͙̿̀B̸̗̯̮̭͑̈́u̗̓̈é̶̶̶̸̶̷̴̢̻̠͓̖͕͚̠̺͗̄̈́̏̀̔͌̈̌̋̽̍͠a̶̴̷̧̟̭̦̭̼͎͎͕͌̋̂͗͋̄̾̀̏͐͝͝ö̫́̒̿͜ͅṕ̶̼̼̯̘͙̯̹̑͒͗͗͘͝͝n̼̟̮̫̼̱̤̱̹̐͋͌͗̿̂̈̑B̄n̴̢̋̾a̵̴̢̨͓̼͚̯̭͎̮̮͖͖̯͗̈̍̂̀̎̓͘͜͝B̸̵̧̭͈̯̖̗͓͙̫̭̎͗͗͌́̂͊̄͗̈̕͜͝͝ķ̬̗̫͋̑̏̎̌͠͠Ķ̶̸̶̗͉̗̼̖̮͓͆̈͜t̮͎͂̌̄P̷̷̸̷̶̶̥̩͚̬͕̗̗̯̠̫͙̪̱̻̗͚͎̜̖̯̦͋̈̎͗̀̈́̂̾̑̌̈́͋̂͗̋͗̎̌͌͌̈́̆͌͗̚͘͜͜͝͝͠͠t͚͓̘͓̋͘h̶͕̦͓̼͓̰̩̼̫͑̑̃̀̍́͋̅̈̃͘()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v26

    xor-int v30, v30, v26

    const v28, 0x1ac571

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->aö̩́͐ǎ̯̗͈͋̉k̸̢͈͌̑͗͌̌̾̋͝a̸̵̷̢̫̗̯̙̟͆͑̈́͐̔͜͜͝a̸̗͕̺̦̗̤͈̜͚̹̋͐̄͋͋͌̒̈́͌͘͝͠ļ̸̷̶̸̵̴̢̯̹͎̪̮͇̘̗̙̺͖̫̘̮͉͇͕̲̗̮̩͙̤̺̻͕͕̻̜͉̯̠̪̗̈́̄̍̈́̾̑̌͋̆̍̏̑͗͊̿̀̅̑̒̿̂͌̿̃̈̈́̆̒̋̃̆̎̍̑̒̇̿̐̑̈́̍̂͘͘̚̚̚̕͜͜͜͝͝ͅl̲̮͝a̷͓͓č̘̘͜e̶̥̫͎̠͈̓͌̈́͌̇̎͠͝c̶̸̭̲̱̄͗̆̈́͘͝ā̛͕͕͜ę̸̸̸̴̪̻͕͙̎̆͑͐͒̑̄͝p̸͕̯̲̦̞̲̦͉̫͓͒̌́̃̌̎̓͗̍̈́̎̆̎̈́̽̉̅͂̋̒̾͘̚͜͝o̶̶̷̴̡̭̤̭̩͙͉̮͈̿͋̅̾̀̈̍̔̎̋̕͘ļ͎̽̀̈́̿̇k̿()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v26

    xor-int v28, v28, v26

    const v29, 0x1abe3c

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->K͈̋o̸̢͓̯̩̗͖̺̼̪͂̿͗̊́̚̚̕͜͝ȩ̡̛̺̰̹̱̗̙̱̃̾͌̄̋́̏͘͝ͅá̧̄̍͠k̹̯͎͉̙̫͊̋̀͝͝c̸̹̼̬̻̦̱̘̝̙͊̆̑̈́͌̂̈́̈̈́͝n̫͉̦͚͆͜n̄͒̍a̾l͈͈̜̪̂͋͐̔̚P̤t̎a̭͝͝t͎ȃ̸̢̗̰̹͋̎P̷̙͎͒K̪K̖̱͎͐͗̕aa̷̸̡̘̘͌̈̉͊̂̆̾͘͝ͅͅu̧̧̻̺͎͙͓͎̿̐̃̑̑͋̏̕p̡̛̲̥̲̭͕͉͎̑̃͗̎͑͋̂͘͠l̷͚̦̘̈̈̉͆͋a̛P͈̗͎͓͒K̛̩̺̃͠ȍ̱͌a̵̶͈̜̭̫̙̫̹͗̌͌̌̄̑͌̋͘̚ͅä̸̛̗̲̘̗̭̲̺͉̫́̃͗̀̚͠l̃̎͜á̺͚̦͈͗̌̎p̯̺͈̤͇̗̠̱̫͌̋͌̉̏̑̾̌̋̐͘͘͘͜͝()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/android/settings/device/MiuiDeviceNameCard;->p̸̅̈́o̶͎̠̻B̶̢͉̠̈̂̏̾̀̃̀k̮n̮̫͓͙̖̤̪̝̊̅̽̚͝c̑̿a̧̿͋̏͒̚͠aB̸̴̷̛̲͙̺̤͈̌͌̂͜ȏ̸̸̶̧̧̭̘͕͚̺̩̥͇̺̘̹̭̲̹͇͕̂̿̃̃͌̄̋̅͝͝͝a̢̛͚̱͋̌̃͐̿͐͊̈̚ͅě̶̗̻̠͓̫̘̦̭̞͎̱̲͓͈̋͌͌̔̌́̒͗͌͂͑̎͑̌̋̎̕͘͝oǒ̫̑̐͘͠o̺̖͙̘̭͌̃̄̏͗̐̈͒͋͜l̸̶̛͓̯̾͗̉̔͐͒͋̀͋́̌̕͝n̷̡̢̙̻̱̙̗̭͈̗̺͂̌̈̔̀̎̈́͊̿̅ń̨̘͙̟̂K͉̪̮̅͑͂͠l͑͌͠o̸̢̧̭͓͘͝a̸̧̦͓̐̐̂͜͜͠a̧̤̹͗́̋̃̕͝n̹̼k̷̴̵̢̯̮̦͕̫͎̱̹͙̘̩̖͈͌̎̌̈͘ͅȟ̸̯͉̮̔̃̚a͐(Ljava/lang/Object;)I

    move-result v26

    xor-int v29, v29, v26

    invoke-static/range {v27 .. v30}, Lcom/android/settings/device/MiuiDeviceNameCard;->ç̶̢̼͖͓̥͈̯̾̑͂͂̕oṳ̶̢͓̲͓̘̲͎̠̪̘͓̼̀̌̓̄̋͋̄̌̋͆͘͘̚͘͝͝k̒e̲͗͘á̶̶̛̗̫̖͎͖͚͈͕͗̌̐̈̾̐̍͝e̷̷̺͝͝č̢͓̥̫͓͈̮͕͉̗̯̑̅̂̅̎̃͘͘̚͜ā̴̸̡̨̢̧̱͈̭͓̥̪̌̇͑͌̀͝Ḵ̷̸̷̸̸̭̯͚͎̲̭͉̫̠͕̘̮̱͇̠͓͎̌͋̌̋́́̂͒͑͊͑̃͒̋̆ô̷̢͙̈̌̚͠ä̸͎́̿K̴̸̢̧͉̭͕͚̘̬̖̹̀̋͗̎͌̂̊̑͋͝p̌K̯͕̭̦͕̫̼̲̮͈̔l̮̯̮͓̼̈́̂̏͝͝ḵ̤͗͆͌̿ȁ̫k̄a̶̷̴̺̻̺̭͎̰͓̖̭̯̮͉̻̮̱͒̃̍̿̔̂͗͆͌̈́̀͋̋̅̚͝u̧̠̚ḽ̷̛̮̹̥̼̅͗̋͂̔̿̅̂̂̌ͅą͗e̸̎(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v27

    move-object/from16 v7, v27

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǒ̥̼̲̠͚͈͉̌̈́͌͘͘͜ą̶̧̘̩̫͉̯̰̤̯͈̭̮̗̎͊̿̄̃̈̌̚͘h̺̩̫͚̑̈́͋̈ĉ̷̸̴̲̫̲̱͎̌̌͋́͠͠a͖̮̒a̭̯͊̂̓͗͌͘l̶̦̱̠̹̫͋͂͂͊͋͂͗ȁ̶̴̷̧̢̛̤̗̺̥̗̥͚̘̭̘̽̎̐̄͋̒̌̌̈́̑̎͜͜͝͝P̷̢̞̖͕̱̺̟͎̫͚̼̬͎̬̘̤̺͗́̈̈́̈̈́͋͊̌̎̌̈͆̏̃̎͑͘͜͠͝K͓͑͑̊p̫̋͋͘k̷͚̭͚̻̅͌͂͗ŏ̸̴̶̢̨̯͚̭͉̮̫̗̫̫̪͕̹̎̄̊̂͘͝͝c̶̴̢̡̘̰̟͙̰͉͚̭̱̗͎̹͚̫͋͌͌̂̋̋͋̌̂̌̌͌͠͠h̶̭̲̦́́͌̈́̒̑ơ̶̴̷̫̘͎̠̼͎͊̋̏̉̋̈́͊̿͑̈̌̈̕͝ȟ̵̸̡̧̥̮̫̟̘͉̰̙͉̪͊̐̓̚()Ljava/lang/String;

    move-result-object v0

    invoke-static {v4, v7, v0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->u̴̢̧̨̝̺̪̪̻͓̠̱̯̔̎̃̒̌̔̾͗͌̎́͗̋̎̿̚̚͜͜ͅĶ̸̷̸̶̡̨̨̧̧̢̛̥̠̱͕̫̪͕͈̹̯͚̠̹̘̯̰͓͎̰̹͎̫̂̄̈́̔̈̈̎̿̀͐̑͋͌̂͌̅̌͑͌̌̌̂̚͘͠͝͠͝ơ̮̠̯̾̍̚u̴̠͈͈͓̮̾̂͒̆͑̈̊̃͜a̹͑ā̢̫͉h̯͝lp̖͙̯̄͘͝ȯ͙̼̅͌̅͒͆h̺̖͝p̵̶͈̪̹̌â̸̫̫p̺̫̗̖̝̋̃̎͑͘c̸̫͕̈́̒͑͘B̷̻̯͚̞́̎͌̔͒p̶̛̙̉̌̑̚a̮e̸̶̸͉̗͚̭̫̺̮̻̜͕͑́͘͜͝ͅk̸̸̸̢͙̱̼̬̩͗̿͌͋̎̑̓̋͠ǎ̸̵̧̧̛̛̘̭͎̤̲̟̱͚̯̹̦͂̐̌͋̋̈́̅͌͑͌͋̄̃̄̾͊̌̈́͗͂͘͠͝a̸̸̺̙͚̭̥͉͌͠͝o͊(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {v6}, Lcom/android/settings/device/MiuiDeviceNameCard;->l̲̻̔̑̎͘P̴̷̛͓̝͕̮̪͓̩̫̆̅̅̔́͋̌̈́͂͠͝ő̸̶̤̋͑͋̋̀͌Ķ̧̲̌ö̻̻̭̫͌K̛̺̦̥̫͉͕̑̚K̸̶̈͌̌͘͝͝h̷̢͎̯͈̫̘̃͂͑̑̃̊̄͊̌͌͗̋̈a̻͠a̸̸̫͖̮̼̾B̘̗̰̔̈̒̾̏̋͘ơ̶̵̵̴̶̢̢̫̤̯̗̹͚̠̥̰̝̫̱̹͎͕̄̌̎̈͌̑͗̌̌̅̂̌́̈́̈͗̃̎͋̎̍̚͝ͅl̸̺̼͎̺̑̒́̌͊̔͑a̸͕͈̭̫͎̮̹͕̪͉̮̱̭͕̘̜̦̱̅͑͆͌͐̂̑͂̄͒̿͊̄̈̎͗̈́͗͌̚̕͜͝͝o̎͑ǎ̫͜K̸̷̵̸̵̷̢̫̦̫͈͕̮̱̭̹̥͈̘͈̫̄̅͌̑͑̈́͒̃͆̎͒̍͑̃̋̆͜ke̛͗ä̸̶̵̫͕̮́̎̿̌̔͋̈̎̅̐̚͜͠l̢̯͝͝ä͚̌͝(Ljava/lang/Object;)Lcom/android/settings/dashboard/DashboardFragment;

    move-result-object v1

    const-class v6, Lcom/android/settings/MiuiDeviceNameEditFragment;

    invoke-static {v6}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->P̷̱͓͉̀ȗ̶̶̹̜̮uṋ̴̛̭͓̞̘̪̰̭̌̌̌̂̎̐̅̃͘̚͠c̶͉͙͚̎̐͒BK̺̼̠̗̂̍̽̈́ṳ̶̢͎͉̔̈́͂̋̂c̸͈̰̈̑̀̂̎B̶̲̦̎̃̏̂ͅt̨ç̸̛̘̠̺̫̄͑͂̈͑͊̂͋̈́͘B̶̸̨̛̛͓̗̝̯̙̺̋̈͌̐͗̍̍̏̈̿͂̚͜͜͜͝t̶̷̷̸̸̢̛͕̮͇͚͕̺̪̙̩̂̋͗̌̌̂̾̎͋̿̔̈̿̈͌̃̎̈́̋̃͌̈́̈́͘̚͘͜͜͝͝ͅp̂̾ţ̧̨̛̪̤͕͋̑̈̃͌̌̎̿͜͝n̶̴̶̡͓͉̩̦̋̔ǎ̷͉̥̊͘lB̊a̮̯̱̮͗̅̿́͝o̶̱h̸̺̤̭̫̏͂͌͝a̷̵̪̺͓n̷̬̫͕͌͗͌͌̏͗̒̓͋͑̀̍͗̋̕a̗̜̫͂a̶̺̰̻̭̺̥̞̱̘̗͐̑͋͗͗͋̂͐̋̆͜͝͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v2

    const/4 v3, 0x0

    const/4 v5, 0x0

    move-object v0, v1

    invoke-static/range {v0 .. v5}, Lcom/android/settings/device/MiuiDeviceNameCard;->ȩ̸̸̸̵̵̷̸̢̭̗̙͎̮̖̞͕̲̤̯̫̰̙̮̲̠̥̺̫̲̹̰͗̌̍̑͋͑̍͌͌̾̄̓̾͌͆͌̀̂̅̄̀̌̌̏̈́͐͑̚͜o̷̸̧̧̬͈͇͓͖̠̯̝̗̲̪̟͓̎̋̆͋͑̑́̈̂̂̏̒̂͠͝͝͝P̷̩̼̹n̸̸̫͈̹̫̗̺̘̺̅͌̈́͌̈̋͑̚͝a̸̷̢̫͗͗̅̏͌͒̌̎̋̍̈͘c̷̷̢̛͈̰̫͓̲̫̫͕̱̫̥̥͎͎̎̃͌̎̏͆́̎̏̅̌̄̍͑͊̈̂̿͒̅̓̚͘͝͝͝͝ç̴̸̨̱̞͚̺̔̋̄̍͑͘̚͝͝ç̷̴̵̻̬̫̺̟̲̗̺̗͒̃͂̈̎͗̎͋̄̑̈́̃͗̑͝n̤͂̎̾̕ḵ̶̛̭̱̜̠̱̰̯̭̺̈͂̋̋͌̀͘͘͠͝͝ͅh̵͓̭͗́̈̈aą̸̛̺̻̻̖̱̯̫̥̟̟̗̠̗̦̭͊̍̑̏́̀̈́͑͠(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;ILjava/lang/Object;I)Z

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->õ̻ȁ̗̫̖͉̬̦̬̱͕̎͌̈́̑̌̌͑̃͜͝n̘̥͗̈ṵ̸̢̠̦̭͙̎̐̎̓͜e͚̙̯ĺ̴̷̷̲͈̙̥̼͉̥̙̂̋̾̈́̀̌̉͋B͕̙̄͌̋͌̓̃͘h̶̴̷̨̧̛͉͓̻͈̫̘͖͈̫̱̖̲̙̯̏̀̀͆̍̂̌͌̌̽̔̍̌̾͋͜͝͝͝B̧̥̋̈́̈n̸̗̜͇̦̱͙̞̭̞͑̐͋͜c̴̷̸̷̶̸̸̨̨̢̭̮̩͓̪͈͓͚̭̺͉̱̮͚͌̋̈̏̇͌̈̈̾̀̾̂̿͐̅̈́̈́̈͌͂̊͑͘̚ͅc̨̢̫͕̤̟̫͈͎̫͚̫͎͋͆̂̅̌͒̔̈͌́̋̒̔̚͠ͅn͈͉p̷̧̪̜̯̤̹̤̭̿͌̌͗̔̈́͆̈̃̈͌͌͘̕͝p̷̯̗̘̽͊͗͠ţ̶̯̱͎͓̦̫͌͋̈́͑̉̚̕͠k̴̸̷̴̦͉̫͓̂͑̍̊͘ͅu̶̬̻͚͎͒͋̑͋̋̃͝()Ljava/lang/String;

    move-result-object v6

    invoke-static {v6}, Lcom/android/settings/device/MiuiDeviceNameCard;->t͓̭͎ṱ̶̶̴̴̢̨̧̢̧̨̛̛̲̫̞̭̥͓̫̼̮̖̯̫͚̯͈̫͖̞̼͋͋͑̽̈̅͊̅̌͌̈́̅̎̈̌͌́̾͊͜͝B̶̶̘̎͋͒̌̄͘ḧ̸̨̖̦͇̯̹̭̔̋̄̋̋̒͗͊͝͝ȃ̸͚͓̩̟̹͙͈̾̂͑͋̈͂̐̌̌͜ņ̶̷̷̸̧̛̹̗͕͖̜̮̻̮̤̫̱̦͚̱͚̘̬͌͋̔̽́̐̏̋̌̋͐͗͂͗̈́͐̽͗̏̄͑̔̿́̎̂̚͘͘͜͝͝͝͝l̶͈̺P̸̸̭͈̄̋͆͐̈́͂͌͘̚͝ǘ͓p̸̷̸̸̛͉̩̮͚͉̦͎̫̦̥̰̘̟͈͎̋̂̽͋͗̋̌̋̌͒̀͜͝͝͝͝k̄̔̂͝Ķ̸̴̜̪̗͕͈̱̼̮͓͙̩̱̮̗͂̋͌͗̈́͑̊͆̀̉͑͗̂͝͝h̯͌̈͂̋̃B͈̗̯͌͑͝͠K̂P̸̱͕̺͉͚̫͗̏̍̿̋̂̅̈́͗̑͘(Ljava/lang/Object;)V

    return-void
.end method

.method public refreshDeviceName()V
    .registers 54

    move-object/from16 v2, p0

    invoke-static {v2}, Lcom/android/settings/device/MiuiDeviceNameCard;->l̨̛̺̫̹̦̼̺͚̯̊͐̈́̀̌͘̚ͅc̶̸̸̛̮̫͈͕̹̤̞̭̪̦̫̍̿́͗̽̂̀̍̌̿̌̓̾̉̍͆͌͘̚̚̚͜͜͜͝ͅã̸̵̶͚̹̫͈̩̼̲̦̤̎̄̌͑͌͝͠K̸̯̫̔̈́͒̌P̶̺̦̥̈̂͒̌̈̅͝͝o̸̸̶̢̖͈̫̯̪̭͚̯̯͎̮̠͐̃̈́̿͌͊̎͑̈́̀͘͝ṷ̼̋͒̈́͊̎ű̯̗̝̃͜B̶̵̻̘͓̫͒͌̄̄̀͜ͅä̸̶̸̺̗͖̾̓̌̄̈́͜ȧ̵̱͉̯͙̂̔̈̄͌͒̀̋͑͝͠p̫̺̃ä̸̸̱̫̂͋̋̂̈̕̚͠e̦̒l̛̗͚̆̿͋͜K̷͇͕̺̍͝ã̧̮̹̎̋͊̎͗̀͝ö̮̱́̃͑ẗ̵̸̸̢̛̛̠̫̦̠̦̥̩̺̱̤̝̫̯̹̗̦̰͓̮͖͙̭̲̭̥͐͊͊͑͐̉̂͋̅̈́͋̌͗̔̌͌͜͜͠͝(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v0

    invoke-static {v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->c̸̢̨̼͈̼̮͉̯͓̮͚̯͋́̌̃̑͌̂a̫͒̈̎̔p̶̷̶̵̶̧̢̛̛̛̗̜̹̹͉͓̘̋̑̂͂́͌̋̇̈̈̃̋̾͌͌̈́͐̇̕͝p̛͌̂̓̃͝p̥͈͆͌͜͜͠o̺̰͖̗͑́̌̈́ͅḁ̴̧͈̗̎a̡̛̯͂̒̆̌K̵̢̫͕̯̜̈́̂͂̅͝͠K̩̪̅͋K̙͎̗̬͇͋̒̇͠Kě̛̋͠Kę̺̈́̎͑͘ķ̤̟̲̩̃͋̚͜͝ķ̶̖̝͉̱̘̖̝̼̈̃̋̐̈͒̌̋͘ͅơ̴̸̸̸̢̢̛͎̟̹̦̦̯̜͙̱̭͈̮͗̈͐͒̋͂̈́͗́́̌̔̋͗̔̑̎̌̾͌̾̋͜͝͝͝Ǩ̞͗͂à̸̢͓͝o̷̼̤͎͑͌̚͘ͅB̴̡͉̈͂̽̾͊ả̸̴̶̧̫̥̯̫̰̭̹̯̻̭̥͎̈́̾͑̃̓̂̈́̾͗͝B̰̺o͘c̸̀ṋ͇̻͚͈̌̾(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v0

    invoke-static {v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̧̨̙̩̘̭͎̮̯̬͖͌͐͒̑̔̂͌͌́̎͋̏͗̚̕͜͜͜͜͝o̵̸̧̤̘͙̺̩̫͑̾̚̚͝p̧̛̬̮̄̎́͑̈͑́͠o̷̧͙̮̗̔̾̌e̶̸̛̺͚̲͎̅̋̂̽͗͌̋̓͝ḻ̄̅̇̅͑͋͜B̵̙̭̱̋̌P̴̷̧̻̥̹̫̦̹̙̺̋͑̃͐̏́̂̌͐̑͂͜͝͝K̷̷̢͓̱͓̤͈̰͎͋͗̿̿̄͌̌̌̎̂̆͌̒̕͘͠P̊p̡̺͚̫͈͗̎̋̐̍͐͗oa̴͚̹̤̦̫̘̘̠͓̎͌͗͆̄͋̑̌̋̾͂̂͒e̘͋a̶͈̹̍n̸̶̢̫̪͉̰̹̗̥̫̺͕͈̭̙̺̞̩̤̝͓̭̉̎̈́̈́͑́̂̈́͋̌͌̏̂͊̃̾͌̿̄͋̅̀͌̆͜͠͝͠a̺̦̹ė̖̭̲̯̹̠̟̂̋̌̈́͘͝p̷̴̨͈̫͎͚̭͕̯̈̋̐̌̌̎̌͐̀̌̃͘͘͝(Ljava/lang/Object;)Z

    move-result v1

    if-nez v1, :cond_19

    invoke-static {v2}, Lcom/android/settings/device/MiuiDeviceNameCard;->ò̷͎̗̼͊̍̂̚̚͠l̶̛̯̏̌ä̛̩̎́̚c̸̷̶̛̫͕̰͂̾͝͝Kn̵̷̸̘͑K͌̉̃̾ę̷̵̛̛͓͈̫̫̫̞̘̹̫̗̜͚̖̬̫̻̂̍͂̎̋̑̿̂͑͜͝͝k̸̷̷̜̖̫̭̠̺̖̲̭̘̭͆̈́̃̈́̉́͌͋̄̂͗̉̕̕͝K̭̜͌̋͗l̷̛͕̫͕̈̈́̎̆̈́͐̔̋Ǩ̷̥̥ḧ̸̷̶̶̴̸̢̢̨͚͈̦͉̬͈̯͇͈́̌̌͐͑͌̕̚͝͝h̴̶̢̢͓͈̯̼̜̖͚́̋͊̈́̑͊͊̈́́̒̈́̄͘͘͝ǎ̸̑ă̷̶̴̸̷̧̧͙͈̦͉̥̾̈͂̌̋̂̑͗ç̸̸̲̩̻͉̞̞̗̺̫̰͒̋̋͗̄̌̂͜͝a̶̧̛̫̟̭͙̰̦̮̫̮̱̾͐̒̈́̃̄̃̂̈́̋̂̿͘͝ͅn̛̑t̶̩̘̭h̩̯̹͎̖̋̀̆̄̂͗̋̃̾̍̂̈̃̚(Ljava/lang/Object;)Landroid/widget/TextView;

    move-result-object v2

    if-eqz v2, :cond_19

    invoke-static {v2, v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ơ̸̤͓͓̯̟̱͈̯̎̂͗̅̎̎̌͑́̌͗͋͝͝ką͚͚̭͕̠̫̪͚͚̯̠̗̭̹̭̪̭̫̎͌̔͌͂̐̈́̌̓͑̂̃͊̅̽͆́̌͘͘͘͝͠͝ͅK̸̸̸̷̢̹̯̟͈͎̈́͂͋̾̽̆̂̆̄͋͌̊hh̵̸̛͎̮̬͑͊̓͒͠k̴̸̶̴̨̛͈̙̠͕̪̲͓̲̂͑̒̈́̄̃̈́̈́̐̿̚ả̶̧̧̺͓̥̭̭̑̂̈͗͘̚͝c̴̢̖̮͕̼̯̦̪̪̠̺̯̙͖͓̎̈́̎̾̋͗̆̂͗͌̏̈̚̚͝͝p̸̵̷̶͈̼͈̹͙̫̘̘̘͓̐̅̈́̂͗̋͘͜͝P̵̴͓͂͋̀̈́̆̀à̶̌̓̑̈́ö̴̷͙̘̗̯̥͖̻́͐̈́̾͊͆̑̄̑̀͘u̸̫̟̯̔̂͌̃̋́̆̅̔͌͆̃͗̿̅ắ̸̺̺̞̦͈̩̺͒̅̾K̶̸̸̛̪̰̺͓͎̜̭̬͚̿̋̆̋̑͜(Ljava/lang/Object;Ljava/lang/Object;)V

    :cond_19
    return-void
.end method

.method public setFragment(Lcom/android/settings/dashboard/DashboardFragment;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    iput-object v1, v0, Lcom/android/settings/device/MiuiDeviceNameCard;->mFragment:Lcom/android/settings/dashboard/DashboardFragment;

    return-void
.end method
