.class public Lcom/kashi/settings/view/BlurBackgroundImageView;
.super Landroid/widget/ImageView;


# static fields
.field static ALPHA:I = 0x5f

.field private static final DEBUG:Z = true

.field static DIVIDE:F

.field static RADIUS:I

.field private static final TAG:Ljava/lang/String;

.field private static final short:[S

.field static wallpaperManager:Landroid/app/WallpaperManager;


# direct methods
.method static constructor <clinit>()V
    .registers 52

    const v0, 0xe3

    new-array v0, v0, [S

    fill-array-data v0, :array_4e

    sput-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->short:[S

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v29

    const v32, 0x1aab1c

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̴̩͕͓͌̎̿̈͒͜͠k̵̷̷̷̸̵̸̨̧͕͕̠̦̯̝͎̯̘̜͎̫͉̺̗͚̐͑̎͌͋̅͆̈̈́̔̀̊͋̀̀̈̌͘̚͘͝ͅͅţ̶̷̨̖̖̰͉͈̼̤̍͋̉̌̑͌̂K͕̺p͎̌B̸̴̸͗̇͘̕al̴̥͈̙̹͙͕̄͑͋̍̚ę̗̼͉̭̥̿͑̋̋͘ͅn̷͈̫͖̾͐͠ą̶̴̴̴͎͚͕̖͇̯̼̹̀͐͋̂̃̎̈́̍͌̃̋̚͠͝a̧̮̗̭̍̌e̶̛̟̹̫͚̼̠͋͑̔́̈́͌̇̃̔̿̋̕͝ah̡̥̻̦̹̲̖̲͙̫͓̀̃͐̔́͑̈́̋͜͝͠h̸̸̵̛̩̩̙͎͉͓͎̯̖̋̎̎̋̈́͌̌͝͠͝ư̶̡̢̛͚̌̾̂̿̂̀̄̋͌̋̈́͜͜͠o̸̹̾͌̅̌̈́a̸̸̻͈̮̹͚̗͈̲̪͑̇̌̃͋̎̎̑̌̂͘͝͝a̶̧̛͇̭̭͙̦͌͂͝()Ljava/lang/String;

    move-result-object v28

    invoke-static/range {v28 .. v28}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v28

    xor-int v32, v32, v28

    const v30, 0x1ac90b

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->u̦͗͊͌̚͜k̶̘͙͈̙̱͎͚̺̞̫̋̋̋̅̌̎͌́̈́̈́͑͜͠͠K̯a͚̹̟a̷̸̶̧̧̘̰̲̺̖̘͚̹̦̹̮̦͚͈͈̫̫͎͗̆́̍͐̈̑͒̂̑̃̿̌̈̚̕͘͝͝Kh̷̷̴̸̸̡̨̛̹̗̦͓̪̥̙̲̮̹̫̘͇̮̤̿̎͐̒͌̃̃̃̌̾͑̾̋̀̑̅̆͜͝͝͠e̶̷̵̵̢̛̦̫̭̺͉̖̩̦̰͇͇̅̈̎̀̊͊́̾͝͝B̷͎̲̈͗̌̐̌͜K̴̸͎̰̮̘̋̍̈̚͜͜p̴̢̥õ̴͉̬̾̂͜͜͝k͎B͚͈̅̿͜K̤̎͒B̴̤̠͕̫͆́̀̌̊͝h̯̓̎͌̕̚uB͎̮͚̈͜B̶̨̧̫̺̤̭̼̌̆͌̏͌̍̈́̕͝͝K̹̲̬͗͑̿͠ṯ̦͓̊͐å̰̖̦̦͎̋͜͠B͈̍̚͜Ķ̯̼͉̔͋͊͋h̴̢͒k̯̫͕̯̱͒̌()Ljava/lang/String;

    move-result-object v28

    invoke-static/range {v28 .. v28}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v28

    xor-int v30, v30, v28

    const v31, 0xdc28

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̷̤̲̫̈̋̋̈͜͝n̆͝l͈̝̈̿a̯l̸̷̺̭͚̗͈̗͎͎̗̪̓̋̅̌̂̀͗̆̓͂̋̍́̚͜P̸̸̷̸̧̢͓͚̠͚͕͓̲͚͇͋̂̐͗͑̆̈̊͆̾͗̽͋͋͋̑̌̾̎̀͊͘͜͜͠͠l͈̠͕̯̈̂͐͌h̸̪̯͎̔̋ë̴̱̤͓̫̹̫́ơ̶̷̵̶̢̢̛̼̫̥̹̫̖̯͎̻̺͓̯̼̇͋͌̀̈́̊̅͗̿̋͝͠͠o̮̙̺͋̀̂̎͒͘͜n̛͈̘̮̺͑͊͗̇̈͘ķ̸̷̷̷̴̶̶͕̭̹̺̭̻̺͓̘͓̦͇̟̰̊̿͗̅͑̃̓̉͌͋͌͗̐̔͗̆͂͜͜͝â̱͓̥̠͒̕P̛͖͈̙̏̋P̙Bcķ͓̠̋K̗̂͜͝Pn̶̷̘̱̺̯̠̍̆̽̌͊̒̕͠P̵̷̸̧̛̘͕̱̘͓͉̪͗̌̍̈̆̌̃͊̌͐̏̃͜͝͝͝ä̧̜B͚̾()Ljava/lang/String;

    move-result-object v28

    invoke-static/range {v28 .. v28}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v28

    xor-int v31, v31, v28

    invoke-static/range {v29 .. v32}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v29

    move-object/from16 v0, v29

    sput-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->TAG:Ljava/lang/String;

    const/16 v0, 0x8

    sput v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->RADIUS:I

    const/high16 v0, 0x3f800000  # 1.0f

    sput v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->DIVIDE:F

    const/16 v0, 0x0

    sput v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->ALPHA:I

    const/4 v0, 0x0

    sput-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->wallpaperManager:Landroid/app/WallpaperManager;

    return-void

    nop

    :array_4e
    .array-data 2
        0x5dfs
        0x5f1s
        0x5e8s
        0x5efs
        0x5dfs
        0x5fcs
        0x5fes
        0x5f6s
        0x5fas
        0x5efs
        0x5f2s
        0x5e8s
        0x5f3s
        0x5f9s
        0x5d4s
        0x5f0s
        0x5fcs
        0x5fas
        0x5f8s
        0x5cbs
        0x5f4s
        0x5f8s
        0x5eas
        0x71fs
        0x706s
        0x717s
        0x154s
        0x939s
        0x708s
        0x711s
        0x700s
        0xbads
        0xba9s
        0x18as
        0x1a4s
        0x1bds
        0x1bas
        0x18as
        0x1a9s
        0x1abs
        0x1a3s
        0x1afs
        0x1bas
        0x1a7s
        0x1bds
        0x1a6s
        0x1acs
        0x181s
        0x1a5s
        0x1a9s
        0x1afs
        0x1ads
        0x19es
        0x1a1s
        0x1ads
        0x1bfs
        0x5dfs
        0x5f3s
        0x5d4s
        0x5c6s
        0x5c1s
        0x5d7s
        0x5d9s
        0x5c0s
        0x5c7s
        0x595s
        0x5c1s
        0x5d4s
        0x5des
        0x5d0s
        0x595s
        0x704s
        0x749s
        0x74ds
        0x748s
        0x748s
        0x74ds
        0x757s
        0x704s
        0x757s
        0x741s
        0x747s
        0x70as
        0x994s
        0x9bas
        0x9a3s
        0x9a4s
        0x994s
        0x9b7s
        0x9b5s
        0x9bds
        0x9b1s
        0x9a4s
        0x9b9s
        0x9a3s
        0x9b8s
        0x9b2s
        0x99fs
        0x9bbs
        0x9b7s
        0x9b1s
        0x9b3s
        0x980s
        0x9bfs
        0x9b3s
        0x9a1s
        0x63cs
        0x62as
        0x63bs
        0x60ds
        0x623s
        0x63as
        0x63ds
        0x606s
        0x622s
        0x62es
        0x628s
        0x62as
        0x60ds
        0x626s
        0x63bs
        0x622s
        0x62es
        0x63fs
        0x66fs
        0x63bs
        0x62es
        0x624s
        0x62as
        0x66fs
        0x953s
        0x91es
        0x91as
        0x91fs
        0x91fs
        0x91as
        0x900s
        0x953s
        0x900s
        0x916s
        0x910s
        0x95ds
        0x56ds
        0x543s
        0x55as
        0x55ds
        0x56ds
        0x54es
        0x54cs
        0x544s
        0x548s
        0x55ds
        0x540s
        0x55as
        0x541s
        0x54bs
        0x566s
        0x542s
        0x54es
        0x548s
        0x54as
        0x579s
        0x546s
        0x54as
        0x558s
        0x29fs
        0x289s
        0x298s
        0x2aes
        0x280s
        0x299s
        0x29es
        0x2a5s
        0x281s
        0x28ds
        0x28bs
        0x289s
        0x2a8s
        0x29es
        0x28ds
        0x29bs
        0x28ds
        0x28es
        0x280s
        0x289s
        0x5acs
        0x582s
        0x59bs
        0x59cs
        0x5acs
        0x58fs
        0x58ds
        0x585s
        0x589s
        0x59cs
        0x581s
        0x59bs
        0x580s
        0x58as
        0x5a7s
        0x583s
        0x58fs
        0x589s
        0x58bs
        0x5b8s
        0x587s
        0x58bs
        0x599s
        0x23as
        0x22cs
        0x23ds
        0x21es
        0x228s
        0x225s
        0x225s
        0x239s
        0x228s
        0x239s
        0x22cs
        0x23bs
        0x208s
        0x23as
        0x200s
        0x224s
        0x228s
        0x22es
        0x22cs
    .end array-data
.end method

.method public constructor <init>(Landroid/content/Context;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1}, Landroid/widget/ImageView;-><init>(Landroid/content/Context;)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;)V
    .registers 58

    move-object/from16 v6, p2

    move-object/from16 v5, p1

    move-object/from16 v4, p0

    invoke-direct {v4, v5, v6}, Landroid/widget/ImageView;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;)V

    invoke-static {v5}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ă̍͋̌P̸̸͓͓̙̭͋̅̾ḩ̶̶̷̵̛̩̥̹̹̮̗̼̘̗̬͈̥͕̹̯̃̌̌̏̎̾̃̔̅̅̔͊͊͂̑͘͜͜͠͠o̥͎͜B̻̦͓̋͘B̸̴̰̘͚͈̮͈̖̹͎̭̠͎͚̭̤̈́͗͒́́̈́͊͒̓͂̿̅͑̆̋̚̚̚͘͝B̥ṕ̦̑̈́͝ò̷̩ḙ̸̀͊̎̕P̾̌l̸̴̶̸̨̧̛̖͓͈͕̮̫͖̘̬̗͓̺͓͎͓̱̘̭̞̭̎̄̄͑̾̂̌̋̎͗̈̅̃̂̈́̉̚͘͜͝͝͠ͅK̸͉̫̹̲̠̯̗͎̈̀̋͊̒̂̂̂͘̚͜͜͜͝͝ĉ̷̡̛̯̥͌̃͘a̢̛̛̘̭̦̪̖̺͖̤͈͉͎̗̮̻̘͒̈͌̌͌̄̋̑̿͌̾̆̂̚͜͝p̷̊͑ǫ̸͚̦͖̱͚͚͌͗̋͗̄̾͆͊̇͘͘͝͝͝t͎͠Ǩ̷̛͙̯͚̱͋̂̎̑̌́̚͝͠P̧̫̭͚(Ljava/lang/Object;)Landroid/app/WallpaperManager;

    move-result-object v0

    sput-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->wallpaperManager:Landroid/app/WallpaperManager;

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̙̫Ḇ̸̴̵̧̘̩̖̼͓̀̇̎̑͐͋͠k̺̰̮̺̈̈́̂̌͠P̶̢̢̱͓͓̺͖̘͓̯̪̜̟̱̥̗̗̹̬̹͉̖̮͕̿̌̏̅̌͑̈͌̈́̄̂̈͐̋͘͜͠K̷̺̘̻̎̐̿͒̍̂͜ͅča̰ṱ̨̢̛̱̬̦͎̂͋͌͌̈͌̂͝͠͝K̺̲͌̚ḧ̴̵̸̸̸̶̢̛̛̖͈͚̱̰̝͇̫͉̩̺͕̬̥̻̘̺́͆́̋̿̏̍̑͑̌̐̑̈͋̋̾͋̑̐́̌̀͘͜͜ͅp̷̢̥͎͚͕̫̯̫̗̟̱̙̤̮̩͎̺̞̹̭̩̗̃̈́̾̀̃̃͑̅̿͂̌̌͜͝ü̸̯̼̯̭̤̋͋̌̉̋̿͠ol̸̛̲̩̫̭̪̖̬͕̥̫͎̥͂̽͌͌̉̿̔́̇͋͐̒̋̔͂͌͜͝K̴̴̥̫͎̦̮̦̘͕͗̏̿̿̎͗͘͘͘͝a̛̫͑̀̚o̷̸̻̬͚̺̺̟͙̙͒̑̒̊͌̏͜()Landroid/app/WallpaperManager;

    move-result-object v0

    invoke-static {v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->B̸̵͚́̾̈͒̕n̴̸̸̡̛̝͚̮̭̩̺̲͎͎͈͉̰̩̹͚̗͕̦̞̺͓̂͋͒̈́̆̑̌͑̌͌̅͌̀͊͗͒͜͜͜͜͝͝͝ě̴̹̮̖̭̪̥͈͚͎̩̮̼͂͑͐̋̂̋́̿͘͝ǫ̷̸̵̷̨̢̧͕̹͉̭͎͈̩̖͑͂̐̈́͂͋̌͒̾͝͝͝͠ȁ̷̶̸̝̲̲̫͎͓̖͚̃͌̿̌̂͠ñ̺̲͂̅ę̶̘̗̲͚̭͙̎̑͑̎̋̂͐́̚͘u̷̱̯͇̪̥̭͓̮̽̋̈́́͐̚͘͜oo̟̹̾̿ac̸̷̷̶͎͙͕̜̫̪̹̔͋̀̂͂̊̋͘͝t̷̶̛̛̙̖̤̼̠̺̼̘͓̑̔̃̄̆̋̒̌̂̐̌h̸̸͖̤͙̺͕̗͚͉͕̫̥̘̲͋̈́͗͋͌͗̋̔͂á̠̱̌͌͠p̱̅̈͂ǘ̡̼̦̅͝p̸̧͖͈̫̼̙͎̰̯̫̹̆̌̑̈́̂̄͗͋̂͒̈́͌̈͝(Ljava/lang/Object;)Landroid/graphics/Bitmap;

    move-result-object v0

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ǔ͕̆̋c̢̰̅̂̒̈́ḙ̴̢̰̮̺̥̰̞̠͕̾̑͜ͅa̺͙̖̋̆̋̒̏͝ȏ̸̪̩͗́̂̏B̷̧̫̹̅̎h̀̌̄ơ̡̞̱̹̺̬̋̅͘͝ͅo̗̓̃̌̎͘͜h͉ņ̷̸̛͓̪̗̯̤̎͆̂͌̎̌̂̃̒̚͘͜͜B̢̾̂k͕̹̫̈́̌̃͜B̋h̸̶̸̢̧͈͇̗̫̘̥͌̆̌͆́̑́̉̀͌̈̍͘͘͜͝p͉͇̩̕͝a̫̚ç̱͉͗̈Ḵ̷̵̶̷͎͉̟̯͉̥̮̼͚̭̎̑̑͗̐̏̊͌̿̈̍̌͝e̯̮̠ầ̶̸̷̴̢̡̫̖̠̖̗̱̻̯͇͑͗̉̏͗̐͝K͝a̧̻̼̗̥͝K͕̘͙͘ͅp̵̶̶̴̶̧̨̭̦̩̫͎̦̼̰̺̤̮̆̃̀̅̀̎̾͐̈́́̾̇͂̑̎̆̑̃̃͘͜͜͜͝ṵ̷̙̻͈̫͓̅͋͗͜a̢̢̫̿̂̄̿̀̋͝()I

    move-result v1

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->a̎a̞̜̠̿̋̾ơ̵̧̧̪̞͉̦͚̩̮̫͉̤̾̃͌̅̌̉̈͆̈́̂͝ͅĶ̷̴̷̮͈̱̫̥̯̙̤̯̮͕͉̺̈́̌̿̑̈́̉̂͋̍̆̔̚͘͝͝t̺̀p̗e̸̷̶̢̡̫̦̤̦̖̘̫͋̋̿́̄͊̀͋̾͠h̷̴̯͈̫̖́̎̂̌͑̋̍͘ṏ̗Ķ̸̸̸͚̱̻͑̄͝a̧̮̲̰̎͌͐͑cć̢̪̹Ķ̸̸̸̛͙͓͓̫̗͎̘̫̭̅͋͐͌̄̍̌̏̓̽̌͜͝͠͝ļ̵̸̨̧̫͈͈̼͖̰̭̯̘͈̺̫̝̺̥͓̘̯̈̑͌͋͌̈́́̂̈̈́̽͂̑́̐̌̈̾͐͒͒͘͘͜͜͜͠ĉ̴̴̸̢̨͚̫̭͉̱̥͙̱̫̙͎̪́̀̾͌̂̂̔̃͜͜á̴̗͕ķ̶̸̴͚̦̥̯̰̖̫̅̎̒̌͑͊͊͝h͗͝K̗̲͋́͗p͎̹͌͑͗̂̈́̑̀̈́ṱ̴()F

    move-result v2

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->B̲ļ̢̨̧̱̘͙͉̗͉̈̏̆͝B̸̶̨̧̲̭͚͈̺̔͠ḩ̸̶̨͉̭̥͚͉̂͒̎̈̈à͠h̴̛͉̲̖͚͉̑̅̄̐͌͗̋̏̋͜͜Pč̞̺̤̯̱̘͚͋̔̈̂̌n̪̦͈͝ȃ̸͙̰̭̤̖̤̲̂̃ĥ̗p̴̢̨̛̛̤̼̯͕̼̫͙̯̱̘̹̥̗̆̄̐̑͌̅̎̈́̈́͐͌̋͊̏̇̾̚͘͜͜͜͝lü̧̈́̾ţ̷̸̶̷͙̜̹̟̺̍̄̾̒o̷̹̕Ḇ̸̴̧̛̮͎̯͓̦̙̩̲͚̼̑̋̆̄̌̎̌̆̿̆͘͝͝á̶̴̵̧̧̡̫̮̻̤̭̭͎̠̋̃̒̏͗̎̌͝e̶̸̷̵̶͉̦̯͈͉͕͓̰̰͚̋̎̑̅̄͑̌͂͑̃̊͂̌̅̋̃͘͜͠ͅa̷̶̧̨̯͓̘̲̙̜̫̻͕̭̫̰̥̘͎̖͐̅͌̈͆̔͌̋͗̐͆͗̉̑̌͜͜͜͝͠͝P̾()I

    move-result v3

    invoke-static {v4, v0, v1, v2, v3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->P̶̞̖̏K̫̗̑̆̋ä̴̸̧̫̪̗̭̹̺̫͓̔̎̆͊̄͂̅̂̄̃͝ẵ̶̘͈̖̙͋̃͘͠ç̵̴̴̧̧̧͎͓͚̰̗͉͕̘̭̼̦̞̹͎͓͈̗̈́̀́̀́̔̌͋̄̑͐͌̌͐͑͜͜͝K̇̐͌͝ç̵̷̸̧̛̩͓͚̭͂͑̀̌̾̌̏̿̄P̷̵̶̸̶̢̛̛̫̪̯̥̦̪̭̺̠̞̖̰͎̜͚̫̏̾̌͋͋̿̿̐͗͋̌͗́̌̔̂͋͌͗̕͜͜͠͝K̺̦̦̕ͅh̨̧̪͊͆͋ḁ̵̸̡̛̛̙̦̻͗͌̎̌̿͒B̧̧͈͚̺͖̄̊̃͊̔͜K̸̟͙̂̾̌̅ḛ̶̈́̔͊̚̚a̋ṕ̴̵̢̜̯̺̿̑̃̚͘͜͝ot̷͕͚̰̲͓̠̹͐̈́̅͗̋͋͝ǔ̵̷̢̫̼̥͚̎̈ka̧̘̰̫̫̩̻̥̮̰̫̋̈̌͐̈̃̈́͌̎͌͋͝c̰̥̈́K̨̃(Ljava/lang/Object;Ljava/lang/Object;IFI)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;I)V
    .registers 55

    move/from16 v3, p3

    move-object/from16 v2, p2

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1, v2, v3}, Landroid/widget/ImageView;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;I)V

    return-void
.end method

.method public static B̲ļ̢̨̧̱̘͙͉̗͉̈̏̆͝B̸̶̨̧̲̭͚͈̺̔͠ḩ̸̶̨͉̭̥͚͉̂͒̎̈̈à͠h̴̛͉̲̖͚͉̑̅̄̐͌͗̋̏̋͜͜Pč̞̺̤̯̱̘͚͋̔̈̂̌n̪̦͈͝ȃ̸͙̰̭̤̖̤̲̂̃ĥ̗p̴̢̨̛̛̤̼̯͕̼̫͙̯̱̘̹̥̗̆̄̐̑͌̅̎̈́̈́͐͌̋͊̏̇̾̚͘͜͜͜͝lü̧̈́̾ţ̷̸̶̷͙̜̹̟̺̍̄̾̒o̷̹̕Ḇ̸̴̧̛̮͎̯͓̦̙̩̲͚̼̑̋̆̄̌̎̌̆̿̆͘͝͝á̶̴̵̧̧̡̫̮̻̤̭̭͎̠̋̃̒̏͗̎̌͝e̶̸̷̵̶͉̦̯͈͉͕͓̰̰͚̋̎̑̅̄͑̌͂͑̃̊͂̌̅̋̃͘͜͠ͅa̷̶̧̨̯͓̘̲̙̜̫̻͕̭̫̰̥̘͎̖͐̅͌̈͆̔͌̋͗̐͆͗̉̑̌͜͜͜͝͠͝P̾()I
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    sget v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->ALPHA:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ȟ̸̶̶͈̎̋͌̈̈͗͌̇̐t͉͚͖̩̤̔k̦̂͠e̴̴̷̸͇͌͒̋͜ā̸̶̴̴̢̧̧̛̱̤̥͓̰̦̺̩̗͈̩̟̯̯̻̗̦̮̤̦̙̲̘̈́̈́͌͗͌͌̎̈́̅̑̔̂̃͑̀̔̅͂̂͘͜͜͝k̗̱͕͉̂̇̇͑͘͠͝h̸̴̶̖͚̮͎͖̭̼͚͗͌͌̀̑̋͗̋͋͘͜͜͝aB̗͕͒̂̚͜͠u̩ţ̛̘̖̪̫̭̂͊̌̈́̔́̂̓aa̪͜ļ̸̸̴̹̙̹̜̗̤̰̰̙̮̙̺̗̭̇̑̄̎̏͆́̋͌͗͑̂̅̂̿̄ͅc̨͈͖͓̺͑̎͊̆͠ǫ̸̶̵̛̮̺̟͉͇̘͇͎̮̺̞͚̫͂̃̑̌̋̎̍̋̌̈̎͑̎̂͘͜͜͝͝͠͝͝͝p̶̶̴̱̹͚̗͈͓̺͇͋̑̋͐̌̉̂͊̿̂͜͜͝B̭͌̓̈́͜ͅȗ̢́͘t̵̛͎̼̭̙̂͂̾̀̃̆̅([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_b

    invoke-static/range {p0 .. p0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̫̤͙̦̂̃̄̍͘͜͠c̴͎̫̬̠̞̋̈̈́̀͐͜͝͠͠͝K̵̛̼͋̍̌n̵̸̻̠͕̥̂ä̘̬̥͌̏͝oa̴̶̸̧̩̯͈̋̈́͝c̵̛̩͓̗̹̺̦͉̖̼̯̋̑͌̎̿̋̔͒̿̋̌͌͘͝a̛̩̹̹͐̄̓̅͗B͖͓̫͉̔͌oa̤͚̋̂͜ẖ͙a̸̛̛̞̦̫̭̿̋̌͌͋̂̿͘͠K̴̸̷̸̛̦̯̹̺̘͇͎̦̭̉͂̎̏̾̽͗͆̅̂͑̾͗̈́̅̈́̑͘̚͘t̷̷̵̶̶̶̴̨̧̗̗̘͕̰͈̠̱̠͈̺͉͇͓̙̫̮͕̪͎͎̗̝̼͊̿̑̈̋̌͂̽͗̋̍͐̆̈́̃͗̑͗̑̈́͌̒̀̀̌̓͂̄̐̑͒̚͘͜͜͜͜͠͠K̠͈̫̻̲̫͂̎̋̂͒͠a̮̤̫̪̎̃͜o̧u͇P͉ḻ̷̺̲̫̺̦̫̗̺̫̫̫̻̎̂́̈͌͐̽͌͊͗̀̌̽͘͜(Ljava/lang/Object;)I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static a̎a̞̜̠̿̋̾ơ̵̧̧̪̞͉̦͚̩̮̫͉̤̾̃͌̅̌̉̈͆̈́̂͝ͅĶ̷̴̷̮͈̱̫̥̯̙̤̯̮͕͉̺̈́̌̿̑̈́̉̂͋̍̆̔̚͘͝͝t̺̀p̗e̸̷̶̢̡̫̦̤̦̖̘̫͋̋̿́̄͊̀͋̾͠h̷̴̯͈̫̖́̎̂̌͑̋̍͘ṏ̗Ķ̸̸̸͚̱̻͑̄͝a̧̮̲̰̎͌͐͑cć̢̪̹Ķ̸̸̸̛͙͓͓̫̗͎̘̫̭̅͋͐͌̄̍̌̏̓̽̌͜͝͠͝ļ̵̸̨̧̫͈͈̼͖̰̭̯̘͈̺̫̝̺̥͓̘̯̈̑͌͋͌̈́́̂̈̈́̽͂̑́̐̌̈̾͐͒͒͘͘͜͜͜͠ĉ̴̴̸̢̨͚̫̭͉̱̥͙̱̫̙͎̪́̀̾͌̂̂̔̃͜͜á̴̗͕ķ̶̸̴͚̦̥̯̰̖̫̅̎̒̌͑͊͊͝h͗͝K̗̲͋́͗p͎̹͌͑͗̂̈́̑̀̈́ṱ̴()F
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    sget v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->DIVIDE:F

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    sget-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->short:[S

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static o̙̫Ḇ̸̴̵̧̘̩̖̼͓̀̇̎̑͐͋͠k̺̰̮̺̈̈́̂̌͠P̶̢̢̱͓͓̺͖̘͓̯̪̜̟̱̥̗̗̹̬̹͉̖̮͕̿̌̏̅̌͑̈͌̈́̄̂̈͐̋͘͜͠K̷̺̘̻̎̐̿͒̍̂͜ͅča̰ṱ̨̢̛̱̬̦͎̂͋͌͌̈͌̂͝͠͝K̺̲͌̚ḧ̴̵̸̸̸̶̢̛̛̖͈͚̱̰̝͇̫͉̩̺͕̬̥̻̘̺́͆́̋̿̏̍̑͑̌̐̑̈͋̋̾͋̑̐́̌̀͘͜͜ͅp̷̢̥͎͚͕̫̯̫̗̟̱̙̤̮̩͎̺̞̹̭̩̗̃̈́̾̀̃̃͑̅̿͂̌̌͜͝ü̸̯̼̯̭̤̋͋̌̉̋̿͠ol̸̛̲̩̫̭̪̖̬͕̥̫͎̥͂̽͌͌̉̿̔́̇͋͐̒̋̔͂͌͜͝K̴̴̥̫͎̦̮̦̘͕͗̏̿̿̎͗͘͘͘͝a̛̫͑̀̚o̷̸̻̬͚̺̺̟͙̙͒̑̒̊͌̏͜()Landroid/app/WallpaperManager;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    sget-object v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->wallpaperManager:Landroid/app/WallpaperManager;

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->k̴̴̴͎̫̤̠̓͒̂͑̾͑̈́̅a̷̶̧̲͂̌͌̕Ḇ̴̷̵̸̴̶̟̠̲͈̹̻̽̌͑̀̈́̋̀̈͑̂̃͘͜͝K̶̵̪͕̭̠̗̃͌͋l̷̛̹̝̯̿̽͆̾͘͝͝K̵̵͈̐̈n̢̦̪͌̾̈ta̷̗̗͕͋̄̍̏͘͘Ǩ͗c̵̸̸̨̢̯̥͈͈̤̤̯̫̫̫̦͗̍̔͌̔͌̌̿͌͋̍̎͒̎͜͝͝͝͠͝ea̿̏͐̑̋̑͠o̾͌͗͝K̴̷̸̨̨̧̧̧̭̦͈̯̹͈͕̪͉̈́̃͌̾͑̃ą̸̴̴̺͕̭̮̹͎̺̙͙͎͚̗̜̪̱̭̮̘̺̺͊̋̌̅́͗͑̌͌̅̎̎̎͌̐͗̌̀̑͋͗̒̉͌̚͜͠͠ͅâ̷̭̹̙̂̑͂͜u̢̧̥̹̯̥̥͓̲̝͎͑̏̚͝͝Ķ̫͚͚̈́̑ȧ͚̭̹̃c̵̸̨̖̖̺̖̆̋̌̚͘͝n͂̐̋͊h̷̽͠K̗̈([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̖̯͈̩̠̄̎͋̋̑͌͂̎̕͘͝o̷͎̘̖̼̺̯̦̫̻̖͌͒̋̀̃͌̋̃͝P̵̢̥͉͎̥̫͌͋̈́͜͝P̷̄t̷̶̲̪̀̄̋̇͊͜͜͜Bu̸̴̸̧̧̯̥̤̮̭̹̖̖̮̿̎̾́͗̃̌̂̈́͘͝͝P̈e̦̺̊͜p̶̷̶̢̨̺̗̹̭̥̼̝̬̐̂͗͒͊̆̾͌p̮̌̑͂͠ǎ̗̖͒͆͠ṱ̏̌P̢̛̫̂̎̌͊̆͌̌̔̑̆̋̍̄̇̚͜Ķ̯̺̻̥̭͈͓̫͈͗̌̅̎̃̃̃̃̂͗̀̅̾̅̐̕͠o̴̵̶̸̧̘̦͎͉͇͒̃̃́ą͖̮̩̯̮̱̩̮̥̃͊͌͌̃̈́̓͐͌̊̿͌̈͌̂̚͘͝a̶̸͓̔͑̎́̃͐̉̄̀̚͜n͚̋͌̌͜͝ȃ̸̺̝̦̯̀͜P̶̸̢̧̧̱̯͈̟̹͉͙͓̭͉̙̐͒͌̿̇̋̔͌͌̍̂̌͑̾͝͠ͅKa([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static t̴̢̛̛̲̤̰̖͉̂̔̾̋͋̋̆͑͘c̨̜͑la̶̷̦͎͋̌̿k̟̪͙͒̆̅̄̑͠͝h̵͚͊̀͑̍͝a̲̭o̶͉̩͎͜P̷͂̑͜l͉̭h̸̸̶̷̸̸̶̸̵̨̢̛̫̦̜̖̫̤̗̹͚̹̞̲̯̯͚͎̠͚̯̰͎͈͚̭̘̩̻̻͇̯̥͚̖̗̯̝̜̱̺̘̯̖̑̓͗̎̎̃̍̇̈́̋̀̃̏̉̑̈͂̃̃̂͑̋̎̒̌͆̈́̏̍̈̂̆̑́́͌̌́̿̏̈̈̈́͋̎̈́̏̉̈̂̀̈́̀͑̔̃̈́̏͌͜͜͜͜͜͝͝͠͝aţ̸͕̭̫̫͚̬̃̿̽̑u̺͚͖͋̂̑̋o̷̍͐͗͋ť̴̷̸̰̻̬̺̫̜͇̺͌̚͠ķ̧̧̫̟̭̤͈̺͇̺͚̈́̀̌̃̍̓̎̑͌̋̅͂̌͘̕K̛̿̂̿ae̵͎͕̎̍͋B͓̭̮̊͗͒͝u̘̭k̫̼P̶̢̗̮̜̆̈́̈́͝(Ljava/lang/Object;)Landroid/content/Context;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_b

    check-cast p0, Lcom/kashi/settings/view/BlurBackgroundImageView;

    iget-object v1, p0, Lcom/kashi/settings/view/BlurBackgroundImageView;->mContext:Landroid/content/Context;

    :goto_a
    return-object v1

    :cond_b
    const v1, 0x0

    goto :goto_a
.end method

.method public static ǔ͕̆̋c̢̰̅̂̒̈́ḙ̴̢̰̮̺̥̰̞̠͕̾̑͜ͅa̺͙̖̋̆̋̒̏͝ȏ̸̪̩͗́̂̏B̷̧̫̹̅̎h̀̌̄ơ̡̞̱̹̺̬̋̅͘͝ͅo̗̓̃̌̎͘͜h͉ņ̷̸̛͓̪̗̯̤̎͆̂͌̎̌̂̃̒̚͘͜͜B̢̾̂k͕̹̫̈́̌̃͜B̋h̸̶̸̢̧͈͇̗̫̘̥͌̆̌͆́̑́̉̀͌̈̍͘͘͜͝p͉͇̩̕͝a̫̚ç̱͉͗̈Ḵ̷̵̶̷͎͉̟̯͉̥̮̼͚̭̎̑̑͗̐̏̊͌̿̈̍̌͝e̯̮̠ầ̶̸̷̴̢̡̫̖̠̖̗̱̻̯͇͑͗̉̏͗̐͝K͝a̧̻̼̗̥͝K͕̘͙͘ͅp̵̶̶̴̶̧̨̭̦̩̫͎̦̼̰̺̤̮̆̃̀̅̀̎̾͐̈́́̾̇͂̑̎̆̑̃̃͘͜͜͜͝ṵ̷̙̻͈̫͓̅͋͗͜a̢̢̫̿̂̄̿̀̋͝()I
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    sget v0, Lcom/kashi/settings/view/BlurBackgroundImageView;->RADIUS:I

    :goto_8
    return v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->h̸̸̵̶̢̛̛̛̛̛̖̦͇̺͎̟͙̥̗̞̼͈̥̙͕̘̾͂͌͂̈́͗̂͒̂̂̈̄̋̋̇̎͗̽͗̐̃̋͘̕͝͠͠k̫̺̔͌ȟ̯͚͎̠̠̗͈̜͂̈̈́̆̽̈͌̑͆̾̚͜lu͉̹͊tẽ̤͎̄h̴̺̦̥̦̲̃͋͒͘͝͝ó̸̶̢̧̯̦̺͎͕̙͚̖͈̺͖͐̃̃̎̐̈́͂̾̋̂̈̋͑̑̃͘͜K̻͉t̷̵̷̪̱̂̌̐̋̃̂̃͜a̹͎̱̹̱͌̍̍̓̈́̽̕h̨͋K̻͙̦t̸̷̗̯̮͙͚̝͓̭͓̼̀̈́͋͗̿̋̀̂͘̚͜͝P̸̶̵̢̘͉̗̗̘̺̗̱̓̔̊̈́͗̓̈̋͂̂̑̊̇̆͠͝Kae̹͚̫̙̋̅̃n̸̴̫͈̫̫̭̭̖̼̯̄̂͗͗̂͌̓̋͘ḁ̷̴̴̶̶̢̛̗̗̱̮̫̦̘̫̗̱͈̫͊̂̌̿̋͌̀̾̑̂̽̔̅͘͘͝͠([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method


# virtual methods
.method public jFastblur(Landroid/content/Context;Landroid/graphics/Bitmap;IFI)Landroid/graphics/Bitmap;
    .registers 106

    move/from16 v54, p5

    move/from16 v53, p4

    move/from16 v52, p3

    move-object/from16 v51, p2

    move-object/from16 v50, p1

    move-object/from16 v49, p0

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->č̸̵̗̻̗̠̫̯̾̏̂̊̌̋̋͂̃l̨͓͚̪̿̈́̋͐͗̂̄͜ō̸̸̸̢̧̰̥̘̎͐͋̕͠͝͝͠KK̍e̴͉̫͂͐̿̅̈͌͂͜͠t̵̜̺̯͚̙͊̂̋̚͘B̷͈̥̫͊k̝̭̥̪̞̽͋͌̈́̅K̨̭͌̋̈́̄c̸̴̶̛̘͕̖̩̹̺̰̼͉͉̭̱̖̮̦͙̎̂̈͋͗̿̾̅̑̈͌̑̎͌̂͜͝a̛͇͋a̵̸̸̬̺͕̹̿̂͗͗͗̑̂͘n̷̢̫̩͕̩̔̄͑B̩a̧̢̠̱̔̈͌̅̍͐ͅh̡̩̮͗̌͌̂̌P̥͎̝͎̫̞̹̾̍̈̐̂͑͠͝͝ǘ͇̲͈͓̗̄̋̃̈̂͊͝Ḱ̪P̶̧͓̯̫̩̖̫͋͋̃̃̎̋̊͗͘l̷̵͎͚̠̗͚̭̂̂͊̔̚ͅơ͙̈́a̡̛͚̗̫͙͓̾̽̔̈̈́̈́o̵̶͕̭͌̾̉͗ţ̋o̺͚̲̱̫͊͘̚̚()J

    move-result-wide v38

    const/16 v42, 0x0

    const/16 v24, 0x0

    const/16 v4, 0x60

    invoke-static/range {v51 .. v51}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v6

    invoke-static/range {v51 .. v51}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v7

    div-int/lit8 v7, v7, 0x60

    div-int/2addr v6, v7

    const/4 v7, 0x1

    move-object/from16 v0, v51

    invoke-static {v0, v4, v6, v7}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->P̷̸̶̴̛̛͖̬̪̗̘̯͎͖͕͙͉͎͚̭̺̥͚̠̝̫͎͗̈̅̃̈́̔͑͌͒̂̌̎͘͜͝c͋͗û̵̶̧̫̖̄̍̎̉̂͠a̸̖̗̿͂͝áę̧̟̯̺̮̻̟̖̹͓͒͗̑͑͌͗̇͠͝ḁ̃P̍͑K̗͌̑͘Ķ̛͌̈̐̆ă̶̶̘͓̱̥̙̘̗̭̎̾̑͌̊̍́͑͝K̂͜l͚B̟̮̽͋͗̅͋̕͘ä̸̧̛̛̫̗̱̫̙̖͈͙̈̈́͑͆̋̌͌͌͗͗̃̅̃͋̑͘̚͜͝ä̶̈͌̑l̸̤̮̖̹̃̇͊̄̚͝k͙ó̠̯̖͕͓̲̬̘̾̑̃͜͠o̴̴̮̅͒̂l̷̹̱͖̦̈́̌̿͝͝͝l̄͋̓ḻ̸̛̫̘̹̌̋̎̚P̻̲u̸̼̩͙̩͎͚̎̌̔̋̾̚̕͜͜͜B̶̧͚̗̭͕̥̓̔̄̃͌̚P̶̧̭̥͚̠̈̕ç̷͎͈͕̰̭̀͋͗(Ljava/lang/Object;IIZ)Landroid/graphics/Bitmap;

    move-result-object v2

    const/4 v4, 0x1

    move/from16 v0, v52

    if-ge v0, v4, :cond_2f

    const/4 v2, 0x0

    :goto_2e
    return-object v2

    :cond_2f
    invoke-static {v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v5

    invoke-static {v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v9

    mul-int v4, v5, v9

    new-array v3, v4, [I

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v86

    const v89, 0x1ac50a

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->c̖̭̱̻͉̃̎̈́̾̑̈́́͘͝͝Ķ̵̷̶̶̸̴̶̢̧͕̭̘̼̼̮̬͚̺̯̘͙̫͉̟͊̿̐̿͌͗̋́̅̈̌́͐͑̏̕͜͠͝B̶̸̨̛͚͓̫͉̰̱͉̫͓͎͓̫̫̮̞͉͓̭̫͓̺̋̂̐̎̋̈́̂̍̍̓͆̈́̽̽͐̎͌̀̆͘͘͜͝͠â̷̧̛̛̩͈̲̫̑̂̈͘͠͝ņ̷̻͎̥͐̈́̍ą̷̛̭͎̤̼̂̊̎̈̈́̌͋ȗ̶̠̯K͗ă̙nê̷̶̷̸̷̱̪̩̘̩̘̮̆͌͂͗́̌K̫̎͂̅͝a̹͝ȃ̴̫̈́͌a̧̠̾̏͠a̩l͈̿l̸̛̮͗̌̎̑͝p̴̨̧̛̱̫̭͉̤̫̠̫͑̆͗̌̿̀͊͗̋̿̏͗͗͘͘͜͜͝ä̸͓́́͝l̲̝͈̫̫̩̄̂͌ȃ̺̞̄̂̂̚͝ķ̶̶̶̨̧̠̯̗͙͉̱̫̫̪̃̾͜͜õ̸̸̧̹̘()Ljava/lang/String;

    move-result-object v85

    invoke-static/range {v85 .. v85}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v85

    xor-int v89, v89, v85

    const v87, 0xdc12

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ǘ̶̶̴̧̧̖͙̘̙̥̫̫̖̹̱̺͉̂͌̀̃͗̅̈́̏͌̾͘̚͜͠͠͝l͎͈̑̈́̇B̪́̂̑͘͜͝co̱̤̼͙̩͓̤̬̘͈̮̫̮͙̠͑͂̑̌̊̔́̊͋́̍̑͊́̃͌̂́̾͜͜͝͝ẖ̷̹̥̯̥̯̱͈̄̎͗̅͑͘̚ȃ̧̘̰̮̩̘͑̈̂̐͆͗l̨̨̛̛̜̦̭̈̌̄͗̉ḙ̵̹̭̙̺̋͋͋̈́̃͗̀͋̐͜͠ő̪̈́͋͝͝l̽͠à͙͗c̡͚̘̺͑̑t̄̚ơ̸̵̶̛̥̙̮̫͝͝tę̸̛͓͎̭̟͕̫̈͐͗̈͑̕͜͜͜l̎Ḱ̶̦̗͎̩͑̋͒̄͗̄͂͘n̸̛̗̤̥̲̯͕͚̪̺̻̺̤̩̅̃͂̄̂́̑̈̄̿͘͘͝t̖̘͒̆̌P̠͓̈̂ç̧̭̜̩̖̎͐̋̃̚K̽̑̚ä̷̷̶̡͎̬̥̤̯̼̯̮͎́͌̋̈̆̚()Ljava/lang/String;

    move-result-object v85

    invoke-static/range {v85 .. v85}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v85

    xor-int v87, v87, v85

    const v88, 0x1ac94a

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ȁ͓̌͋͝͠B̢͚̠̋̂͜Ḱ̴͓̤̹̆̌c̟ļ̸̛͎͖̫͚͆̅̈́á̴̻̦̥͉̌͗̈͒͗̍̍͝͠p̴͙͖̞̻͇̻̯̈̀̋̈̈u̧̺͙̩͋̈͝K̸̸̰̘͈̱͇͕͙̰̮̗̃́̂̀̈́͝â̫̎ṗ̹͕̙̯̤͈̄̈̌͂̌̌̀̈́͊̕̕a̹̘̿̂B̺p̴̴̛̩͓̦͉̮̲͎̥̆̌̆́́͌͐̌͜ͅa̒ṱ̠̓û̺̕ą̼͓̲͚̈̍̋͌͌͜p̸̧͖͕̥̼͕͚̤͚̪̙̠͑̿͌̌͑̈́̿̎͜͠͠͝ḱK̷̨̼͓̪̤̫̿͝l͗h̢̧̖͚̑͗̈̆̎̾̕͝e̸̷̴̴̡̧̛̪͙͕̞̥̹̟̦̫̮̗̺̦̪̺̱̦͚̗̜͓͉͋̏̈̈́͗̑͋̀͑̎̌͊̃͊̃̈͊͜͜͠ͅṅ̨̛͓̺̺͇͙͙̞̙͈̋̈͘͝ḻ̶̡̼̜͉͚͎͂̋̈o()Ljava/lang/String;

    move-result-object v85

    invoke-static/range {v85 .. v85}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v85

    xor-int v88, v88, v85

    invoke-static/range {v86 .. v89}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v86

    move-object/from16 v4, v86

    new-instance v6, Ljava/lang/StringBuilder;

    invoke-direct {v6}, Ljava/lang/StringBuilder;-><init>()V

    invoke-static {v6, v5}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v64

    const v67, 0x1aafaa

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̧͈̰̦̯͚͕̮̱̲̑̂Ķ̶̷̶̨̤̤͓̗͕̫̲͈̱̯̭͎͙̯̦͋͒̆̉̿̀̍̑̎̈́̈́͆͝͠͝p̸̛̦̈́͜n̸̩̝̈́̇ṗ̡̧̠͎̪̯͈̗̠͒̀͌̿̊͘̚͘uk̸ț̸̡̛̛̛̝̤̞̹̫̭͎̯͉̬̗̙̠̫̜̠̮̭̯̭̫̄̑̿̋̈́̈͋̂̔̏̈́͘͘̕͜͠nk̸̾̈́̿̂P̌̈́̈́̐͂͜ȩ̴̫͎̩͉̘̒u̻͜͝a̷̛̗̮̗̿͗͐̑̇͗͋̈̈͝ͅç̸̛̥͎̩͚̥͈͊̂̎̽͋̍̚P̧͓̘͎̫̫̭̂̔͋͂̈́̚ň͎ͅn̷̵̴̯̪̼̩͙͓͚̯̮̪̠̜̂̾͋̇͗͋͋͝ķ̫̯̗͑̃͘͝͝l̸̨̲̺̎̔́̀p̸̧̛̭̖̫̤̹͗͗͠op̴̙̟̆a̧̨̮̪̗̙͚͈̋͂͜kp̵̷̸͕̘̜̙̻̈́̓̃̑̇̈́̅̃̚()Ljava/lang/String;

    move-result-object v63

    invoke-static/range {v63 .. v63}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v63

    xor-int v67, v67, v63

    const v65, 0xdc5e

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ã̴̤̯̮̹͗̈͘t̸̯͎̱̭̥̥̋̋̋̂͋̎̈̅̎̍ţ̵̧̛͕̥̟̦̼͉͕͓̺̈́̄̎͗͠c̴̖̩̽̅ą̸̢̫̲̫̖̞͉̈̄̾̈́̊̌͋̔́̑̋͌͜͝͝a͈̭̼̹͂̂͝Kā̵̫̮̙͐͑̀͊͋̕͜P̵̸̢̛̻̫̫̭̗͖͈̺̻̲̠̩̲̖̙̹͒̌̂͆̔͑͆̃̑̀̎̌̆̕͘͘͜͜͝͝Pľ̸̶̷̫͕̥͈̺͙̝͈͚̘̅̀͜͝p̶̵̶̥͌̋̽̎͒̈͜͝p̑k̑̀͌h̴̵̸̷̢̡̛̛̰̬̫̗̼͕̪͎̰͙̃̂̃̑̿͌̌̇̑̋̋͌͋͘̕͘͝͝͝aä̧͓̜̙͎́̇̈̌̚c̶̡̢̤̮̮͗̓̋̈͝á̚ȁ̧̧̗̔͗͆͐̐̎̋̈́̿̌͊͜͜ḩ̢̩̥̺̖͕͓̆͂͗̅͐͂̊͘̚͠͝l̵̶̻̂͜͝ļ͌͗a̧̛̦̗͝()Ljava/lang/String;

    move-result-object v63

    invoke-static/range {v63 .. v63}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v63

    xor-int v65, v65, v63

    const v66, 0xdc9e

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ẗ̴̤̅͌́̚͝á̧͉̆̾̾Ķ̴̢̫̭̋̋̈́̑̅̋̅̾͋̔͝ͅơ̷̷̧̧̼̹̭̻͙̪̱̺̮͚̤͕̝̺̭͈̹̤̦͈̰̗̈́͑̇͂̈́̎̑̅̉͂̈̈́͌͗͘͝ã̸̶̵̷̧̢̧͈̪͙̝͎̖͓̥̽̃̈́͌̽̉͗̐̀̎͋̈́̐̀̈́͘̚͠ͅu͗h̶̶̢̧̢̝̮͉̮͇̺̙̪̺̍́̈́̂͗̑̈̈́̈͘͝͝͝ö̫́̚k̷̨̢͎̺̖̺͚̩̗̀̈́̂̈́̋̍͗̈͗͘͜͝͝K̯̮̯̱͇͉͐̌̎͜͜͝é̶̵̸̢̨̢̧̨̨̛̛̛͎̫̫̹̺̦̠̠͉͈̫̫̘͚̦̱̲̖̱̪̗̮̃̏̐̄̂͌͋̀̄̊̾͐͆͗̉̚͜͜a͗k̴̷͚̙̙̪͚͕̫̹̤̫̱͕͕̙̫̫͎͕̗̯͙̮̫͚̯̈̿̾͗̾̍̉̌̋͗́̑͑̌̃̈́̀̅͂̋͌͌̈́͊͑̎̚̚͜͝͝()Ljava/lang/String;

    move-result-object v63

    invoke-static/range {v63 .. v63}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v63

    xor-int v66, v66, v63

    invoke-static/range {v64 .. v67}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v64

    move-object/from16 v7, v64

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static {v6, v9}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v75

    const v78, 0x1ac05f

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->B̷̶̸̸̧̧̛̪͕͚͓̰̫͈̠̠̋͗̌̾̃̾̌̂͌̅́̾̈́̚̚͜͝͝͝͝ļ̫̋͋͘B͈̺̦̝͉̜̬̍̈́̄ͅP̷̷̭̞̫̱̄̈̈͘͜ã̺p̵̸̶̛̛̛̺̱͓̺̩̗̗͉̞̫̫̠͙̏͆͋̽͋͒̏̂͆͌͗͌͗̃̿̌̚̚K̶̴̷̴̭̲̱̭̺̫̹̲͉̥̯̖̲̹̱̱̻͕̭̦̹̹̺͈͗̃̀͋͗͒̌͌̎̀̒̑͗̄̋͑̅̂̈́͐̐̚͜͠͝͝͝͝͝ͅǨ̮͉̱͈̥̫̺̬͈̾͜͝͝c̬̙͑̄͋̈́́͘͝͠K̥͉̪͎̘͋͐a̶̶̢̹̮͌a̸͓ť̴̶̶̢̢̨̡̛̤̫͎̜͉̥̈́̓͋̅̎̋́͊̂̕͜͜aṯ̗͌̉͐̚͝l̵̛̛̛̮̜̗̙̗͚̲̘͋͑̈̋͂͋͊́̌͊̈́̃̆̎͗̕͝͝͝e͗̈́̈̃K̸̴̥̺̹̅́̆͋̔͝u͎͑()Ljava/lang/String;

    move-result-object v74

    invoke-static/range {v74 .. v74}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v74

    xor-int v78, v78, v74

    const v76, 0x1ac8d6

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ñ̶̨̘͓͚̃͆͆̌̌̑̋pp̴̧̱̬͕̻̹̘̦͙̙͉̘͕̗͌̎̈̋͗̿̋̈́̀̊̂͜͠p̷̢̭̲̫̯͇̑̈́͝ĺ̸̢̫̥͎͉̥͚̭̹̙̪̘͌̀̆̈̄͌̑̋̿͂͐̌̂k̸̵̨̻̗̗̱͕̫̫̺̈́̔́͑̾̑͒͘͘͜͜͠͠͝Bp̷̖̲ả̢̦̲̺̔͒̔͝a͆͝ề̗̥̯̖̮̫͎͈͓̗̺̮̺̮͊̈́̀͊̍̆̈́̃̂̚͜͝a͝t̹̾͒̿ȯ̫̦͈̫̻̯̯̑͜͝č̸̶̨̠̘̺͎̱͚̼̜͈̘̙̭̱̯̥̂͑̂̄̈̈̌͊͌̔̈̾̆̾͘͜͝ch̫̗̼͆̀̌̋̈͘ȟ̴̶͉̱̫͓̩̗̗̦͇͚͎̘̫̏̔͠ͅḴ̲̯͕̝͓̫͎͉̐̃̊̌̔̅̅̽̂̄͘͜͠ķ̸̴̈́͑ư̸̴͙̻͙̄̔ö̧͚́͗P̸̸̘͋̂͂̈́͗͜͝K̈()Ljava/lang/String;

    move-result-object v74

    invoke-static/range {v74 .. v74}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v74

    xor-int v76, v76, v74

    const v77, 0xdc61

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̵̶̷̴̸̶̫̘͕͕̗̺̐̑̔̅͑̃͝͝k̫̱̃̊̚ln̷̺̺̅͊̇̂͌̅͌͝ͅt̴̴̨̛̛͎͉͉̹̙͎̭̯̩͇̯̋͊̈́̔̈̔̈́̌̂̈́̔̎̄̄̐̑̚͜͜͝͝͝p̛̥̻̘̋̾̈͌̂͝ą̰̹̓̿P̶̂c̯B̴̠͕͇̌n̵̨̧̦̝̿͜ņ̘̺̫͈͙͚͕̈͒̃̄̀̎̅͌͜͠ä̷̸̶̴̘̥̹̗̦̩̞̰̯̜̘̖͚̫͉̍̆͗̏͌̃̈́̌̌̾̋̿̅͆̾̇̎̌̌͊͝͠a͚òͅc̸̡̧̱̬͚͕͚̭̹̩̲͈̗̿̉͐̾̊̈͋͗̀̐͘͠͠͠u̵̵̫̹̬͑̌̅̂̅͘͜͝͠ṷ̔͜ŏ̺̙̘̑͌ê̫̠͎̖̦͚̠͉̫̖̠̅̍̈́̂̂̃̇͠͝͠u̧͎̖̥̺͎̅̍̃̀̄̌̈͗͜P̶̧̯͚̮͚̲̹̗̹̋̿̋̈́̚aa̬̖̫̾̈́()Ljava/lang/String;

    move-result-object v74

    invoke-static/range {v74 .. v74}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v74

    xor-int v77, v77, v74

    invoke-static/range {v75 .. v78}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v75

    move-object/from16 v7, v75

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    array-length v7, v3

    invoke-static {v6, v7}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static {v6}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ae̮͚͚̭̰͐̔̋ņ̮̝̱̲̫͈̈́͗̅K̮̗̭͒͌̎̋ȃ̧̛̺͚̩̮͓͙͇͚̦̇̀͒͆͜͝K̸̸̸̨̹̗̯̭͎̫̞̗̼̅̏͌̇̈́͋͗͆͗̈́͑̇̒̈͘̕͝͝͠p̷̷̵̸̢̢̠̹̘͉̈̈́̏̿̃̎̀̿̆͘ẗ̸̛̫́͋͑̑p̧̢̖̮͗̆ãPk̵̸̞͉̗̗͉͚̥͕̲͚̼͕̪̗͈̃̿̋̾̂͂̎̈̿̾̃́͐̑̿̀̀̋̂̅̐̂̂̈́̎̂̑͗̊̋́̚͜͜͝͝͝͠k̿͜ṯ̪̫̄̈́̚l̯̆́͠l̸̲̂͑̄͗́o̧B̫͚͌̂̑͋̚ä̹B̗͚̤̘̂͊̂̿͋̋͝K͚̋a̸̷̵͚̞̺̘͙̭̤̺͒̈͆̋̾͑͠a̸̧̛̘̹͈̱̠̍͌̌BK̶͋e̱ę̸̛̛̫̘̥͚̫͗̒̓̌͗̂̈́͝͝ḩ̵̸̧͎͚͎͇̯̌͐̑̔̌͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v6

    const/4 v4, 0x0

    const/4 v6, 0x0

    const/4 v7, 0x0

    move v8, v5

    invoke-static/range {v2 .. v9}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->oa͒̾l̺͎̗̋͑̕a̋c̶̨̏̋ą̸̷̶̴̨̛̻̯̯̼̗̗̩̫̖͈͒́̆̋̑͗̌̌͑̍̃̓̿̓̐hļ̵̴̸̛̰͙̺͉͖̺̰͕̐̎͑́̅̅̃̋̂̃̿͘͜K̵̵̴̢̧̨̛̖̗̠̼̦̯̘͚̼̻̰͚͂̆͑̎̂̌͑̂͊̅͌̌͗̓̈́̃͝͝K̷ḧ̡̧̢̭͇̱̙͉̘̼̤͎̃̌̌̽̍͌̃̎̕͘͜͜l̶̸̛̹̺̥̱̮͈͑̾̏̽̂̌͠u̴̶̸̿̌͆͂̿͝ͅP̶̷̴̷̵̧̛͉͕̠̝͎̰͓͖̫̹͎̥̼̋̀̋́̋̈̑̃̿͆̔̾͌̾͘͘͜͜͜͝p̸̱͊̍͊͊̆̿̇̚͜ò̴̷͈͓̖̗̫̂͐̍̂͒̌̋͜͝K̥̺̝̫̘̲̈́̾͗͜Ǩ̴̢̡̲̙͎̝͇̏̉̌̆́͒̒K̶̢̨̛̺̮̰͈̥̗̈̅̌͌͗͒̑̅̃̆̂̎̑͝ŭ̀(Ljava/lang/Object;Ljava/lang/Object;IIIIII)V

    add-int/lit8 v43, v5, -0x1

    add-int/lit8 v25, v9, -0x1

    mul-int v41, v5, v9

    add-int v4, v52, v52

    add-int/lit8 v15, v4, 0x1

    move/from16 v0, v41

    new-array v0, v0, [I

    move-object/from16 v28, v0

    move/from16 v0, v41

    new-array v0, v0, [I

    move-object/from16 v20, v0

    move/from16 v0, v41

    new-array v10, v0, [I

    invoke-static {v5, v9}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ţ̷̷̸̭̺̯̅̉̋̅̃̾n̈́̑͠o̶̷̴̪̰̗͗̄͠k͖ȃ̺̪̱͚͗̔͋̇͊͑̌͋̈́̚͘͜ç̸̸̶̴̶̛̞̹̲͚̯̮͕̰͈͓̘̰̮̖̗̞̬͎̱͈̯̥̄́̐̆̈́̅̈̃͋͗̌̃̃̂̒̈̚͘͜͜͝l͎̋̎͘͝n̸͉̮̑͌̎͜͝a̯̎ã̗̯͜P̸̢̨̙̠̦̞͚̩͖͑̌͗̄̇̀̄̚͝û̦͈͌͠K̸̸̨̥̞͎̗̬̮͓̗̟̝̾͗̂̂͊̂̋̃̍͜͠K̵̸̢̢͈̫̩͂̿͘P̨͓̫̜̭͓̠̫̾̆̂͋͜͜ç̴̴̷̸̴̵̷̛̺͓̺̹̗͈͉̮͕̯̯̬̱̯̤͓̲̺͚̻̫̖̱̗̮̋͌̌̒͌̃͌͑̃̀̂̃̓̂̈́͂̓̈̎͗̀̏̎̂̎̆̌͊̈̏̂̊̈́͘͘͘͜͜͠͠͝ͅő̷͚͈̰̼͎̫̗͙̗̅͒̽͌͌̔͋̔̒̂͜ͅ(II)I

    move-result v4

    new-array v0, v4, [I

    move-object/from16 v40, v0

    add-int/lit8 v4, v15, 0x1

    shr-int/lit8 v16, v4, 0x1

    mul-int v16, v16, v16

    move/from16 v0, v16

    mul-int/lit16 v4, v0, 0x100

    new-array v0, v4, [I

    move-object/from16 v17, v0

    const/16 v26, 0x0

    :goto_125
    move/from16 v0, v16

    mul-int/lit16 v4, v0, 0x100

    move/from16 v0, v26

    if-ge v0, v4, :cond_134

    div-int v4, v26, v16

    aput v4, v17, v26

    add-int/lit8 v26, v26, 0x1

    goto :goto_125

    :cond_134
    const/16 v46, 0x0

    move/from16 v48, v46

    const/4 v4, 0x3

    filled-new-array {v15, v4}, [I

    move-result-object v4

    invoke-static {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̫c͋p̧̟̦͘͝ā͘ņ̶̸̶̢̛̺̙̮͈̗̱͎̫̠̱̼͕̞͕̗̞̲̯̭̠͎̗͊̈́̀̾̈̃̎́̋̂͌́̇̔͋͘̚͜͝͠͠u̱̪h̶͓̗̼̗̭p̧͙̱̮͓̐͜a͉̗͎͌͋̕͝o̾o͎ā̺͎͑̂̈̐̓ǫ̪̝̱͈̾̚â̆̈̋͜ǫ̮̤͜ć̠̜̜̞̱̥̻̩̩̝̩̭̖̝͈̄̈́̏̄̔̑̾̍̋͑̚̕͝͠͠ȇö̸̸̧̧̰͎͕̘̫̹̮̮̎͑̌͒͜o̴̢͙̦̾P̵̤̖͖͕̗̋̏̋̊͐̅̌͝͠͝Ķ̷̷̧̛̹̭͕̞̮͙̗̻̭̖̑̾̆̑̑̒͗̈́̒͘͜͝a͠͠ͅK̢̨̯̝̾̔̀̂̏ä̸̷̦̎̆ǎ̋l͙͓͎̈p͐t͓̞͗͌K̵̝̪̘͒́lẗ̸͎̺͚͕̪̥̦͗̋̈̋̈͝e̸͜a̺̫B̛̗̱̺͒̔̂ͅ()Ljava/lang/Class;

    move-result-object v6

    invoke-static {v6, v4}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->h̘̥͈͎̗̎̌̈́͜u̮̒̏͌̎̎̀͝p̡͈͋͌a̷ţ̻͕͋̎Ķ̷̢̡̧̻̥̲̹̗̥̱̰̗̻͎̎̏͌̋̋̌̑̿̄̒̾͗͜͝͠p̸̸̴̢̭̪̥̥̘̻̤̫͚̱̯̫͈̿̃́̊͋̋͊̂͜͜͝B̶̸̸̧̛͚̐̋̎͝t̸̛̫̭͕̦̺̩͓͗̿ȁ̷̴̛̭̺̘̭̟̯̙͚̠͑̾̈́͌̊̄͒ų̪̭̑̌͌̔l̛̫͎̜͌̈̍͗̂̎̅̿͒͜͝P̸̛̤̱̪͌̈́̐͘ä̸̸̗̫̖̹̮̦̫̺̯̋͂̋̂̆͆̇̄̈̋̚̚̚͘͘ͅu̸̼͌̆̚͜ḁ̵̥̱̫̗͊̋̈́̆̂̑͝h̩͓͙̙̮̍̉̃͝Ķ̶̵̴̦̫̯͙̬̩͓̭̝͎̥͎̠̔͋̇͗̀̑̉̋̏͋͂̋́̑͗́͘͝͝͝͝n̛̮̥̯͊̈͗͌p̧̺̙͉̙͉̄̎̈͐͐̇͜ä̛̹͉͖́͗(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/Object;

    move-result-object v35

    check-cast v35, [[I

    add-int/lit8 v29, v52, 0x1

    const/16 v45, 0x0

    :goto_14b
    move/from16 v0, v45

    if-ge v0, v9, :cond_274

    const/4 v13, 0x0

    move/from16 v23, v13

    move/from16 v33, v13

    move v12, v13

    move/from16 v22, v13

    move/from16 v32, v13

    move v11, v13

    move/from16 v21, v13

    move/from16 v31, v13

    move/from16 v0, v52

    neg-int v0, v0

    move/from16 v26, v0

    :goto_163
    move/from16 v0, v26

    move/from16 v1, v52

    if-gt v0, v1, :cond_1d4

    const/4 v4, 0x0

    move/from16 v0, v26

    invoke-static {v0, v4}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ţ̷̷̸̭̺̯̅̉̋̅̃̾n̈́̑͠o̶̷̴̪̰̗͗̄͠k͖ȃ̺̪̱͚͗̔͋̇͊͑̌͋̈́̚͘͜ç̸̸̶̴̶̛̞̹̲͚̯̮͕̰͈͓̘̰̮̖̗̞̬͎̱͈̯̥̄́̐̆̈́̅̈̃͋͗̌̃̃̂̒̈̚͘͜͜͝l͎̋̎͘͝n̸͉̮̑͌̎͜͝a̯̎ã̗̯͜P̸̢̨̙̠̦̞͚̩͖͑̌͗̄̇̀̄̚͝û̦͈͌͠K̸̸̨̥̞͎̗̬̮͓̗̟̝̾͗̂̂͊̂̋̃̍͜͠K̵̸̢̢͈̫̩͂̿͘P̨͓̫̜̭͓̠̫̾̆̂͋͜͜ç̴̴̷̸̴̵̷̛̺͓̺̹̗͈͉̮͕̯̯̬̱̯̤͓̲̺͚̻̫̖̱̗̮̋͌̌̒͌̃͌͑̃̀̂̃̓̂̈́͂̓̈̎͗̀̏̎̂̎̆̌͊̈̏̂̊̈́͘͘͘͜͜͠͠͝ͅő̷͚͈̰̼͎̫̗͙̗̅͒̽͌͌̔͋̔̒̂͜ͅ(II)I

    move-result v4

    move/from16 v0, v43

    invoke-static {v0, v4}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(II)I

    move-result v4

    add-int v4, v4, v46

    aget v27, v3, v4

    add-int v4, v26, v52

    aget-object v34, v35, v4

    const/4 v4, 0x0

    const/high16 v6, 0xff0000

    and-int v6, v6, v27

    shr-int/lit8 v6, v6, 0x10

    aput v6, v34, v4

    const/4 v4, 0x1

    const v6, 0xff00

    and-int v6, v6, v27

    shr-int/lit8 v6, v6, 0x8

    aput v6, v34, v4

    const/4 v4, 0x2

    move/from16 v0, v27

    and-int/lit16 v6, v0, 0xff

    aput v6, v34, v4

    invoke-static/range {v26 .. v26}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ţ̷̶̢̖̪͇̯̂̾͌͌̈̌̅̃̈̀́͘͜͝ě͈n̴̶̶̨͎͎͖̼̤̺̫̭̪̹͉̍͊͋̐̂͗̀̾̈́͌͘̚a̯̪̫̝̰̩̪̥̾̍̐͑̔̔̿͝ë̛̗͈̘̺̼̱̺̺̹̑̂̆͗͜͜͜͝ų̥͊͌̓͗͗͌̅͊͋̄ć̸̼̲̗̭͎͉̠͕͉̂̑̌̈͋́̈̈̎͌̅̔͝B̹̥̹͗à̫à̴̸̧̹͈̘̝̹̩̪̺͎̺͉̅́̈̌̈̈́̂͆͠h̲n̠̂̍͌P̢̺͕̥̙͈͕͈̀̄̃̌͗͝p̰̥̃͒͋ļ̶̸̥͚̹͚̝̩͕͉̗͈̻͙̺̽͗͌̌͗̌͘͜ͅc̷̷̸̸̴̢̘̭͎̫̙̹̪̭̺̫̻̻̮̮̾̋̌́̂̃́͑̌͌͋̽͋͌͜͜͝͠ư̸̴̸̶̢̛̰̯̩̠̤̥͇̝̤͎̮͈̯̈͊̑̃͑̾͑̅͋̂̎̔̃̔̀̀͘̚̚͜͠͠͠͠(I)I

    move-result v4

    sub-int v30, v29, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    mul-int v4, v4, v30

    add-int v33, v33, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    mul-int v4, v4, v30

    add-int v23, v23, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    mul-int v4, v4, v30

    add-int/2addr v13, v4

    if-lez v26, :cond_1c5

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v11, v4

    :goto_1c2
    add-int/lit8 v26, v26, 0x1

    goto :goto_163

    :cond_1c5
    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v12, v4

    goto :goto_1c2

    :cond_1d4
    move/from16 v36, v52

    const/16 v44, 0x0

    :goto_1d8
    move/from16 v0, v44

    if-ge v0, v5, :cond_26e

    aget v4, v17, v33

    aput v4, v28, v46

    aget v4, v17, v23

    aput v4, v20, v46

    aget v4, v17, v13

    aput v4, v10, v46

    sub-int v33, v33, v32

    sub-int v23, v23, v22

    sub-int/2addr v13, v12

    sub-int v4, v36, v52

    add-int v37, v4, v15

    rem-int v4, v37, v15

    aget-object v34, v35, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    sub-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    sub-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    sub-int/2addr v12, v4

    if-nez v45, :cond_211

    add-int v4, v44, v52

    add-int/lit8 v4, v4, 0x1

    move/from16 v0, v43

    invoke-static {v4, v0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(II)I

    move-result v4

    aput v4, v40, v44

    :cond_211
    aget v4, v40, v44

    add-int v4, v4, v48

    aget v27, v3, v4

    const/4 v4, 0x0

    const/high16 v6, 0xff0000

    and-int v6, v6, v27

    shr-int/lit8 v6, v6, 0x10

    aput v6, v34, v4

    const/4 v4, 0x1

    const v6, 0xff00

    and-int v6, v6, v27

    shr-int/lit8 v6, v6, 0x8

    aput v6, v34, v4

    const/4 v4, 0x2

    move/from16 v0, v27

    and-int/lit16 v6, v0, 0xff

    aput v6, v34, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v11, v4

    add-int v33, v33, v31

    add-int v23, v23, v21

    add-int/2addr v13, v11

    add-int/lit8 v4, v36, 0x1

    rem-int v36, v4, v15

    rem-int v4, v36, v15

    aget-object v34, v35, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v12, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    sub-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    sub-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    sub-int/2addr v11, v4

    add-int/lit8 v46, v46, 0x1

    add-int/lit8 v44, v44, 0x1

    goto/16 :goto_1d8

    :cond_26e
    add-int v48, v48, v5

    add-int/lit8 v45, v45, 0x1

    goto/16 :goto_14b

    :cond_274
    const/16 v44, 0x0

    :goto_276
    move/from16 v0, v44

    if-ge v0, v5, :cond_38e

    const/4 v13, 0x0

    move/from16 v23, v13

    move/from16 v33, v13

    move v12, v13

    move/from16 v22, v13

    move/from16 v32, v13

    move v11, v13

    move/from16 v21, v13

    move/from16 v31, v13

    move/from16 v0, v52

    neg-int v4, v0

    mul-int v47, v4, v5

    move/from16 v0, v52

    neg-int v0, v0

    move/from16 v26, v0

    :goto_293
    move/from16 v0, v26

    move/from16 v1, v52

    if-gt v0, v1, :cond_2f6

    const/4 v4, 0x0

    move/from16 v0, v47

    invoke-static {v4, v0}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ţ̷̷̸̭̺̯̅̉̋̅̃̾n̈́̑͠o̶̷̴̪̰̗͗̄͠k͖ȃ̺̪̱͚͗̔͋̇͊͑̌͋̈́̚͘͜ç̸̸̶̴̶̛̞̹̲͚̯̮͕̰͈͓̘̰̮̖̗̞̬͎̱͈̯̥̄́̐̆̈́̅̈̃͋͗̌̃̃̂̒̈̚͘͜͜͝l͎̋̎͘͝n̸͉̮̑͌̎͜͝a̯̎ã̗̯͜P̸̢̨̙̠̦̞͚̩͖͑̌͗̄̇̀̄̚͝û̦͈͌͠K̸̸̨̥̞͎̗̬̮͓̗̟̝̾͗̂̂͊̂̋̃̍͜͠K̵̸̢̢͈̫̩͂̿͘P̨͓̫̜̭͓̠̫̾̆̂͋͜͜ç̴̴̷̸̴̵̷̛̺͓̺̹̗͈͉̮͕̯̯̬̱̯̤͓̲̺͚̻̫̖̱̗̮̋͌̌̒͌̃͌͑̃̀̂̃̓̂̈́͂̓̈̎͗̀̏̎̂̎̆̌͊̈̏̂̊̈́͘͘͘͜͜͠͠͝ͅő̷͚͈̰̼͎̫̗͙̗̅͒̽͌͌̔͋̔̒̂͜ͅ(II)I

    move-result v4

    add-int v46, v4, v44

    add-int v4, v26, v52

    aget-object v34, v35, v4

    const/4 v4, 0x0

    aget v6, v28, v46

    aput v6, v34, v4

    const/4 v4, 0x1

    aget v6, v20, v46

    aput v6, v34, v4

    const/4 v4, 0x2

    aget v6, v10, v46

    aput v6, v34, v4

    invoke-static/range {v26 .. v26}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ţ̷̶̢̖̪͇̯̂̾͌͌̈̌̅̃̈̀́͘͜͝ě͈n̴̶̶̨͎͎͖̼̤̺̫̭̪̹͉̍͊͋̐̂͗̀̾̈́͌͘̚a̯̪̫̝̰̩̪̥̾̍̐͑̔̔̿͝ë̛̗͈̘̺̼̱̺̺̹̑̂̆͗͜͜͜͝ų̥͊͌̓͗͗͌̅͊͋̄ć̸̼̲̗̭͎͉̠͕͉̂̑̌̈͋́̈̈̎͌̅̔͝B̹̥̹͗à̫à̴̸̧̹͈̘̝̹̩̪̺͎̺͉̅́̈̌̈̈́̂͆͠h̲n̠̂̍͌P̢̺͕̥̙͈͕͈̀̄̃̌͗͝p̰̥̃͒͋ļ̶̸̥͚̹͚̝̩͕͉̗͈̻͙̺̽͗͌̌͗̌͘͜ͅc̷̷̸̸̴̢̘̭͎̫̙̹̪̭̺̫̻̻̮̮̾̋̌́̂̃́͑̌͌͋̽͋͌͜͜͝͠ư̸̴̸̶̢̛̰̯̩̠̤̥͇̝̤͎̮͈̯̈͊̑̃͑̾͑̅͋̂̎̔̃̔̀̀͘̚̚͜͠͠͠͠(I)I

    move-result v4

    sub-int v30, v29, v4

    aget v4, v28, v46

    mul-int v4, v4, v30

    add-int v33, v33, v4

    aget v4, v20, v46

    mul-int v4, v4, v30

    add-int v23, v23, v4

    aget v4, v10, v46

    mul-int v4, v4, v30

    add-int/2addr v13, v4

    if-lez v26, :cond_2e7

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v11, v4

    :goto_2dc
    move/from16 v0, v26

    move/from16 v1, v25

    if-ge v0, v1, :cond_2e4

    add-int v47, v47, v5

    :cond_2e4
    add-int/lit8 v26, v26, 0x1

    goto :goto_293

    :cond_2e7
    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v12, v4

    goto :goto_2dc

    :cond_2f6
    move/from16 v46, v44

    move/from16 v36, v52

    const/16 v45, 0x0

    :goto_2fc
    move/from16 v0, v45

    if-ge v0, v9, :cond_38a

    const/high16 v4, -0x1000000

    aget v6, v3, v46

    and-int/2addr v4, v6

    aget v6, v17, v33

    shl-int/lit8 v6, v6, 0x10

    or-int/2addr v4, v6

    aget v6, v17, v23

    shl-int/lit8 v6, v6, 0x8

    or-int/2addr v4, v6

    aget v6, v17, v13

    or-int/2addr v4, v6

    aput v4, v3, v46

    sub-int v33, v33, v32

    sub-int v23, v23, v22

    sub-int/2addr v13, v12

    sub-int v4, v36, v52

    add-int v37, v4, v15

    rem-int v4, v37, v15

    aget-object v34, v35, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    sub-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    sub-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    sub-int/2addr v12, v4

    if-nez v44, :cond_33c

    add-int v4, v45, v29

    move/from16 v0, v25

    invoke-static {v4, v0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(II)I

    move-result v4

    mul-int/2addr v4, v5

    aput v4, v40, v45

    :cond_33c
    aget v4, v40, v45

    add-int v27, v44, v4

    const/4 v4, 0x0

    aget v6, v28, v27

    aput v6, v34, v4

    const/4 v4, 0x1

    aget v6, v20, v27

    aput v6, v34, v4

    const/4 v4, 0x2

    aget v6, v10, v27

    aput v6, v34, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v11, v4

    add-int v33, v33, v31

    add-int v23, v23, v21

    add-int/2addr v13, v11

    add-int/lit8 v4, v36, 0x1

    rem-int v36, v4, v15

    aget-object v34, v35, v36

    const/4 v4, 0x0

    aget v4, v34, v4

    add-int v32, v32, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    add-int v22, v22, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    add-int/2addr v12, v4

    const/4 v4, 0x0

    aget v4, v34, v4

    sub-int v31, v31, v4

    const/4 v4, 0x1

    aget v4, v34, v4

    sub-int v21, v21, v4

    const/4 v4, 0x2

    aget v4, v34, v4

    sub-int/2addr v11, v4

    add-int v46, v46, v5

    add-int/lit8 v45, v45, 0x1

    goto/16 :goto_2fc

    :cond_38a
    add-int/lit8 v44, v44, 0x1

    goto/16 :goto_276

    :cond_38e
    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v67

    const v70, 0x1ac235

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̾k̶͚͑͘a͝n̫͈̥̫̅̃͘l̓t̲̫͂͗̔͜B̴̸̸̧̛̫̗̜̫̱͙̋̏̋͝ļ̷̴̸̸̸̵̸̡̧̡̛͈̙͓̠͓͈͇̭̱̤͈̮̯̪̗͈̺̮̻̻̼̗̹̟̀̅̈̌̃̅̿͑͑̑̎͌͊̂͒̎̆̾̾͑̍̾̌͌͘͘͜͝͝ͅa͓̗ļ̷̴͙̑̀͝ô̥͇̐̎a̢͚̫ḽ̙̼͎̗̅̄̈́͜n͗k͕̗̗͌͝͝K̷̢̮̒̅͐̂̑̄͋̽̚ou̸̪̼̿́ķ̀̎͒̌̅͜͠͝a̭̮͗̌͜͝ŏ̴̧̮͉̫͇̞̺̪͎͚͉͌̒̂̾̔͌̃̔̌̽͜͜͜͠k̴̸̫̫̗̆̀̅͆͐̃̚ţ̮P̴̏c͖͘k̷̢̢̨̫̫̥̫̮̟̹̫̂̈̃B̸̷̷̧̢͉̺̫̫̭͚̖͎̭̫̭̖͕̼̫̋̂̄̎̋͗̌͊́̀͆̅̈́͑̿͋̉̌̃̂̄͜͜͜͜͠͝()Ljava/lang/String;

    move-result-object v66

    invoke-static/range {v66 .. v66}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v66

    xor-int v70, v70, v66

    const v68, 0x1ab35c

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->u̫o̸̧̢̫͓͎̫̯̤̗̪͚̬̞̫̤̫͈̮͚̪̥̘̾̋̀́͒͂̾̍͋̿̌̂͐̋̉̓̎͗̔́͒̚͜͝͝͝ä̢̛͎̦́̄̄̀̈́͌͜͜c̶̴̹̱̮̲͓̲̤̼̗̜͓͈̑̎̈́̾͗̃̃̽̃̿͌͋̈̿̚͘͝͝͠͝͝h̸̭̝eK̛̠̦̯͌̉a̧͉͖̦̐̎̾͗͘ô̵̖͎͉͚̌l̸̤̱̘̪̭̯̯͌͌̂̿͐͘͝B̶̸̵̷̨̛̯͙̯̪̦͚͎͈̙̝̖̯̼̗̥̐̌̋͌̔̋̿̄̈̋̍̀̈́͝͝͝a̸̧̧̝͙̻̲͚͉̘̖̘̹̼̫̯̠̫̍͐͌͗̾̔͆͋̌́͗̑̊̅̏̄̍͘͘͜͝ͅK̵̫͒̈́̉̈̚͝Ǩ̴̡̢̥̯̗͓͖͈̼̫̥̦̎̽̊̐̎͊̅̋̚̚ç̸̸̷̧̙͚̥͉͙̺̱̑̂̂̓̍͌́͗̑̎͂̂̈́͘B̧̛̯̯̦͈̮̤͐̿̂͠()Ljava/lang/String;

    move-result-object v66

    invoke-static/range {v66 .. v66}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v66

    xor-int v68, v68, v66

    const v69, 0x1aaae1

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḩ̫͂p̷̷̵̫̫͚̫̝̃̌̆̾ͅpkp̸̸̴̛̫͎̻͕̦̫̮͚̮͎̯͓͐̊̌̑̐͌̐̂̌̾̚̚͘͜͜͠K̗͊a̗̦͗̈͗͌̚͜a̝̋ü̵̷̶̶̶̷̸̶̡̡̧̯̘̱̮̖͚̗̫̭̱̗̰̰͙̥͕̲̭͇͚̭̤̦̑͗͌̆̃͗̋̎̃̌̉̿̈́̌̑̿̑̈̈̾̔̋̿͋̈̈́͂̈́̐̋͘͘͜͜͜͜͠͠͝͝k̭̬̪̰̲̅̾̈̌̂̄̏́͘c̶̴̫͉͈̭̻͒̂̈̏̈̂͘͝ő̸̩͎k̭̰̂̂̈͌̃̈́̕ko̶̼̒̓a̴̧̙͂͑̀̇͗̌̄̕͝K̲̺̞͚̘̫̬̆̎͗ṷ̧̈́̑̾̿̈́̋͘ḁ̸h̥̀B̫̘͈̝̠̜̃̌͌̎̀̑͜c̷̸̶̵̡̢̛̻͚̤̼͓͖̫̺̟̻͐̾͒̆͒̂̃̇̄͌̈́p̛͉̱͙̯̭̰̫̪̃͑͜͜͝a͙̥͂͌̕()Ljava/lang/String;

    move-result-object v66

    invoke-static/range {v66 .. v66}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v66

    xor-int v69, v69, v66

    invoke-static/range {v67 .. v70}, Lcom/kashi/settings/view/BlurBackgroundImageView;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v67

    move-object/from16 v4, v67

    new-instance v6, Ljava/lang/StringBuilder;

    invoke-direct {v6}, Ljava/lang/StringBuilder;-><init>()V

    invoke-static {v6, v5}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v88

    const v91, 0x1abd2e

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v91, v91, v87

    const v89, 0x1ab257

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->t̛͙͕̫̗̪̖̻̘̘̦̗̼̖̦̹̱̓̌̋̀͝͝ņ̵̢̮͚̙͕̤͓̰͌͌̈́̾͘͜͜͜͝͝ͅh̷̤́̌P̶̺͖̬̀n̷̖̟͈̦͌̾̏ë̷̛̙͓͉͉̤͘P̸̶̶̷̢̧̧̛̛̼̘̗̥̭͎̻̤̱̩̗͎̥̌̂̈́̈̀̃͌̑̋͌̌͘̚͜͜͜͠a̕B̴͎͖̅̀͂͒̌̾̋̃͝P̴̼͒͊̈͗̃͘͝͠t̸̜̭̺͈̔̏̐a̗̗̼̥̹͚̱̿̈̄ö̸̸̗̦̯̫͋̉͐͂͜͜͝Ķ̶̶̸̶͇͚̯͚̑͌̎̍͗̃̚͠K̴̴̴̨͓͎̗͈̊́̑͊̊͋̈́̌͜͜͠a̸̶̸̮͓̫͚͎̹͉̼͋̇̆͒͗̉̋͗̿̌͘a̫͉͗͌͗͝ǎ̶̶̛̘͆̈͗̋͜ơ̘͊͜ų̶̶̴̶̪̗̠͖͓͎͚̻̱̘̦́̈͂͗̑͂̌̿͋̈́̑̈́͂̏̈̈̋͆̈́̈́͘͜()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v89, v89, v87

    const v90, 0x1ac929

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̵̷̛͉̫̫̫̠͈̥̖̼͕͚̗͉͈͓̭͈̫͎̫̓̑̈̌̑̂̔̎̈́̈̃̏̆̃̍̄͌̈̎͠K̵͉̹̜̫̟̺̂̾̋̀̍̃h̰ķ̛̝͒̑k̸̸̸̶͉͉͕̫̫̪͙̘̗͙͓̻̘͑̂̌̂̌̇̂͌̐̽u̦͗̎a̢̛̗̦̲̙̥̦̭̥͗̈́́̐̄̽͊̋̍̌͐͜aǫ͉͉ǎ̷̛̛̼̭̥͊̈͑͗̇͋͗̀a̱ḁ̸̢̹͈͋ǎK̶̸̢̧̨̫̫̹̮͚̗̪̩̅̌̅̈͂̂̋̃͌̅̿̈́͋̐̾̈́͌͝͝K̵̶͗͝B̢̛̭̠̈̄̅l͌k̻̤ë̡̱̪́̎̑̀͗̿͘ņ͉́̃ǒ̶̴̶̶̵̢̨̧̠̗̘̹̭̦͈͙̥̪͓̫͌̈́͑̾̈̑̂̋̄̿̃̿̎̄̋̀̂͠h̸͎p̺̫̩̦͉ͅu̹̭̎̂̑͌ơ̥̪̤̘̩͚͎̹̱̫̆̍̂̂̄͗͊̾̿a()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v90, v90, v87

    invoke-static/range {v88 .. v91}, Lcom/kashi/settings/view/BlurBackgroundImageView;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v88

    move-object/from16 v7, v88

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static {v6, v9}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v60

    const v63, 0x1abd4c

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->a̫c͋p̧̟̦͘͝ā͘ņ̶̸̶̢̛̺̙̮͈̗̱͎̫̠̱̼͕̞͕̗̞̲̯̭̠͎̗͊̈́̀̾̈̃̎́̋̂͌́̇̔͋͘̚͜͝͠͠u̱̪h̶͓̗̼̗̭p̧͙̱̮͓̐͜a͉̗͎͌͋̕͝o̾o͎ā̺͎͑̂̈̐̓ǫ̪̝̱͈̾̚â̆̈̋͜ǫ̮̤͜ć̠̜̜̞̱̥̻̩̩̝̩̭̖̝͈̄̈́̏̄̔̑̾̍̋͑̚̕͝͠͠ȇö̸̸̧̧̰͎͕̘̫̹̮̮̎͑̌͒͜o̴̢͙̦̾P̵̤̖͖͕̗̋̏̋̊͐̅̌͝͠͝Ķ̷̷̧̛̹̭͕̞̮͙̗̻̭̖̑̾̆̑̑̒͗̈́̒͘͜͝a͠͠ͅK̢̨̯̝̾̔̀̂̏ä̸̷̦̎̆ǎ̋l͙͓͎̈p͐t͓̞͗͌K̵̝̪̘͒́lẗ̸͎̺͚͕̪̥̦͗̋̈̋̈͝e̸͜a̺̫B̛̗̱̺͒̔̂ͅ()Ljava/lang/String;

    move-result-object v59

    invoke-static/range {v59 .. v59}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v59

    xor-int v63, v63, v59

    const v61, 0xdbc0

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->t̴̢̛̛̲̤̰̖͉̂̔̾̋͋̋̆͑͘c̨̜͑la̶̷̦͎͋̌̿k̟̪͙͒̆̅̄̑͠͝h̵͚͊̀͑̍͝a̲̭o̶͉̩͎͜P̷͂̑͜l͉̭h̸̸̶̷̸̸̶̸̵̨̢̛̫̦̜̖̫̤̗̹͚̹̞̲̯̯͚͎̠͚̯̰͎͈͚̭̘̩̻̻͇̯̥͚̖̗̯̝̜̱̺̘̯̖̑̓͗̎̎̃̍̇̈́̋̀̃̏̉̑̈͂̃̃̂͑̋̎̒̌͆̈́̏̍̈̂̆̑́́͌̌́̿̏̈̈̈́͋̎̈́̏̉̈̂̀̈́̀͑̔̃̈́̏͌͜͜͜͜͜͝͝͠͝aţ̸͕̭̫̫͚̬̃̿̽̑u̺͚͖͋̂̑̋o̷̍͐͗͋ť̴̷̸̰̻̬̺̫̜͇̺͌̚͠ķ̧̧̫̟̭̤͈̺͇̺͚̈́̀̌̃̍̓̎̑͌̋̅͂̌͘̕K̛̿̂̿ae̵͎͕̎̍͋B͓̭̮̊͗͒͝u̘̭k̫̼P̶̢̗̮̜̆̈́̈́͝()Ljava/lang/String;

    move-result-object v59

    invoke-static/range {v59 .. v59}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v59

    xor-int v61, v61, v59

    const v62, 0x1ab363

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ą̧̨̙̩̘̭͎̮̯̬͖͌͐͒̑̔̂͌͌́̎͋̏͗̚̕͜͜͜͜͝o̵̸̧̤̘͙̺̩̫͑̾̚̚͝p̧̛̬̮̄̎́͑̈͑́͠o̷̧͙̮̗̔̾̌e̶̸̛̺͚̲͎̅̋̂̽͗͌̋̓͝ḻ̄̅̇̅͑͋͜B̵̙̭̱̋̌P̴̷̧̻̥̹̫̦̹̙̺̋͑̃͐̏́̂̌͐̑͂͜͝͝K̷̷̢͓̱͓̤͈̰͎͋͗̿̿̄͌̌̌̎̂̆͌̒̕͘͠P̊p̡̺͚̫͈͗̎̋̐̍͐͗oa̴͚̹̤̦̫̘̘̠͓̎͌͗͆̄͋̑̌̋̾͂̂͒e̘͋a̶͈̹̍n̸̶̢̫̪͉̰̹̗̥̫̺͕͈̭̙̺̞̩̤̝͓̭̉̎̈́̈́͑́̂̈́͋̌͌̏̂͊̃̾͌̿̄͋̅̀͌̆͜͠͝͠a̺̦̹ė̖̭̲̯̹̠̟̂̋̌̈́͘͝p̷̴̨͈̫͎͚̭͕̯̈̋̐̌̌̎̌͐̀̌̃͘͘͝()Ljava/lang/String;

    move-result-object v59

    invoke-static/range {v59 .. v59}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v59

    xor-int v62, v62, v59

    invoke-static/range {v60 .. v63}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v60

    move-object/from16 v7, v60

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    array-length v7, v3

    invoke-static {v6, v7}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->p̴̶̧̛͎̞̭̫̗͚͕͕̹͈̯̍̈́̀͌͐̃͗̅̑̾̂̈́̃͗̑͜͠õ̸̡̯͓̠̗̦̠͓̏̑̄̄̂̃̍̔̾̋͌̈P̴̷̧̲͉̫̟͎̙̈́́̈́̓̃̈́̈͑̂͌̈̈́̀͗́̋͒̑̚͝ȁ̝̂͑̏̋a̷̰̩͉̺̅͝͝a͎͐̄̌͂͝ô̸̸̵̡̫̱̘̯͈̪̗̯͇͕̤͕̄̋̂̍̃͂̋̄̾̀̋̋̽͝͝͠͝o̧͕̗͋͒̾͘k̋ĕ̮̫͈͗ũ̶̬̗͙̑͗̾͑̃̾͌͝oõ̹̱̫p̷̸̰̺̼̭̲̀̄̾͜͜͝ͅų̨̛̦̦̼̤̗̦̙̩̺̾̍̓͗͋̂̾̈́̈́͠͝͝k͈̟̄̿̅̑͌̊͌̋ņ̷̰̫̻̼̺̈́̏̀̑̓͐̋͘͜K̸̶̷̢̛̪̯͓͉̝̼̱̜͕̋͆̈́͜B̸̷̶̧̢̺̭̥͉͋̋̌̑̀̂͜͠h̩͌̄a̛͚͎̎̋͗͐̊(Ljava/lang/Object;I)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static {v6}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ae̮͚͚̭̰͐̔̋ņ̮̝̱̲̫͈̈́͗̅K̮̗̭͒͌̎̋ȃ̧̛̺͚̩̮͓͙͇͚̦̇̀͒͆͜͝K̸̸̸̨̹̗̯̭͎̫̞̗̼̅̏͌̇̈́͋͗͆͗̈́͑̇̒̈͘̕͝͝͠p̷̷̵̸̢̢̠̹̘͉̈̈́̏̿̃̎̀̿̆͘ẗ̸̛̫́͋͑̑p̧̢̖̮͗̆ãPk̵̸̞͉̗̗͉͚̥͕̲͚̼͕̪̗͈̃̿̋̾̂͂̎̈̿̾̃́͐̑̿̀̀̋̂̅̐̂̂̈́̎̂̑͗̊̋́̚͜͜͝͝͝͠k̿͜ṯ̪̫̄̈́̚l̯̆́͠l̸̲̂͑̄͗́o̧B̫͚͌̂̑͋̚ä̹B̗͚̤̘̂͊̂̿͋̋͝K͚̋a̸̷̵͚̞̺̘͙̭̤̺͒̈͆̋̾͑͠a̸̧̛̘̹͈̱̠̍͌̌BK̶͋e̱ę̸̛̛̫̘̥͚̫͗̒̓̌͗̂̈́͝͝ḩ̵̸̧͎͚͎͇̯̌͐̑̔̌͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v6

    const/4 v4, 0x0

    const/4 v6, 0x0

    const/4 v7, 0x0

    move v8, v5

    invoke-static/range {v2 .. v9}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̧̛̫̪͈̬̲̭̮͒̈͌͑͋͗̾̔͑͝ļ̴̷̢̰̰̯̝͈̘͇͙͉̫́̆̔͝e̸̴̫̯̭̯͑̇̓̂̐́̌̋͘̚ų̶̸̨̢̧͇̦̬̗̠͓̪̹̫̱̦̍͌̂͌̎̃͑̽̌̑̋͜͜a̵̸̧͈͎͌̄͋̆eh͕̉́͜͜h̦̫K̢̯̭̦͖̭̹̗̫͉̺̐̋̿̎͗͑̌̈́͝a̷̷̶̧̛̦͕͉̱̯̠̎̏̈́̂̀̅͘͜Ķ̶̰̟͂͒̒ä̧̢̡͎̤̻̮̭̤͚͖̙̗̤̦̊̈́͂͜͝u̚͜o͈a͕̼͚̱͝ǫ̸̸̸̸̢̭͈̘̩̭̺̗̦̙̫͎̘͙̬̙̖̫̩̹̔͒̌̂̋̿̄͗̉͗̿̀͊̃̋̍͒̂̂̓̌͘͘̚͘͝l̩͂̌̂a̶̵̧̲̬̭̅̀̏̈́̃a̪̰͌̃ö͈͉͎̮͉́̄͋h͆ļ̸̗̦̦͊̾̌ā̘n͈l̩K͎̫̺̘̤͒̄̋͜(Ljava/lang/Object;Ljava/lang/Object;IIIIII)V

    new-instance v14, Landroid/graphics/Canvas;

    invoke-direct {v14, v2}, Landroid/graphics/Canvas;-><init>(Landroid/graphics/Bitmap;)V

    const/4 v4, 0x0

    const/4 v6, 0x0

    const/4 v7, 0x0

    move/from16 v0, v54

    invoke-static {v14, v0, v4, v6, v7}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->kt̖̗̔ț͈̥͘͠P̕n͓̄͝a͜P̸̴̧̮͉͌̃̃͝h̸̫͕̐̂͗t͕ā̙̱̫͗̿͠a͓͜ȯ͠P̧a̵̭̐̐͗̇̊͑a̦̯̗̗̤̫̺͆̏͗̚͜͠P̷̷̸̷̵̷̧̛͕͉̗̤͈̫̫̺͚̭̘͈̺̦͈̅̋̎̅̈̌̃̋̃̆̔̈́̏͌̌̈́̈̿̈̏͑̔̅͋̿͌̚̚͠͝͝a̵a̷̧̛̙͇͈͖̺̦̪̗̘̠̤̞̬̭̩͓̟̖͈̗͌̂͌͌́͌̽̓̀͋̋̉̅̈́̃͐̈̈́̾K̵̶̸̵̢̢̢̡̧̧̛͉̺̭̠̱͎͎̦̥͓̰̫͎̯̪̖͎͊̍̂̂͋̌̂͌͘̚͜͝͝p̭̙͝ò͈͉̹͓̠̄͐͜ä̪́̐̚u̗̯ah̸̛̛͉̬̤̭͉͉̬͉̯̱͌͗͆̿̃̐͆̎̔͂͘͝͝o̝͙̎͋͜P̧̛̠̫͓̗̺̠̥̪̯̞̀̄́͒̚͜͜͠͝tt̋(Ljava/lang/Object;IIII)V

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->č̸̵̗̻̗̠̫̯̾̏̂̊̌̋̋͂̃l̨͓͚̪̿̈́̋͐͗̂̄͜ō̸̸̸̢̧̰̥̘̎͐͋̕͠͝͝͠KK̍e̴͉̫͂͐̿̅̈͌͂͜͠t̵̜̺̯͚̙͊̂̋̚͘B̷͈̥̫͊k̝̭̥̪̞̽͋͌̈́̅K̨̭͌̋̈́̄c̸̴̶̛̘͕̖̩̹̺̰̼͉͉̭̱̖̮̦͙̎̂̈͋͗̿̾̅̑̈͌̑̎͌̂͜͝a̛͇͋a̵̸̸̬̺͕̹̿̂͗͗͗̑̂͘n̷̢̫̩͕̩̔̄͑B̩a̧̢̠̱̔̈͌̅̍͐ͅh̡̩̮͗̌͌̂̌P̥͎̝͎̫̞̹̾̍̈̐̂͑͠͝͝ǘ͇̲͈͓̗̄̋̃̈̂͊͝Ḱ̪P̶̧͓̯̫̩̖̫͋͋̃̃̎̋̊͗͘l̷̵͎͚̠̗͚̭̂̂͊̔̚ͅơ͙̈́a̡̛͚̗̫͙͓̾̽̔̈̈́̈́o̵̶͕̭͌̾̉͗ţ̋o̺͚̲̱̫͊͘̚̚()J

    move-result-wide v18

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v82

    const v85, 0xdd16

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->P͉ķ̩͕̥͋͗ą͉͕̥̥͎̜̈̅̈́͝k̵̷̨̨̧̧͖̞̥͈̮͓͎͎̪̂͑̑̂̓̐̂̋͝͝ṋ̵̢̢̡̥͕͊́̎̌Ķ̷̶̛̙̫̦̪̙̟̺̎͌̑̋̌͑̂̎͘ơ̸̦̥̂̈́̔̚͠͠ë͈̮͋̄̾Kh̶̷̸̗̫̤͕͚͚̘̞̮̄̋̄̐̓̋͑͗͐K̂p̵̷̪̘̱͕̰͈͐̄̕͘͜͜PB̨̛̘͕̗̫͉̱̫͙̥̯͕͕̰̘̤̤̦͗͗͊̃͋̆̃͐͗́͠B̷̷̤͇̹̋̅̄̋͜͠t̴̤̙̚Ķ̶̧̩̙̮̩̤̩̭̺̺̮͈̍̈͌̂̋̒̔̂̒̿̍̏̌͌̚͝͝at̖̥̠͕͌͊a̸̰̱͂̈́ȩ̶̶̛̛̛̺̩͉̖̱̦͈̫͙̫̥̻͎̯̈̋͌̄͑͂̿͗̌̅͑͂̍̉͘͘̚͜͜͜͝K͚̦̦̫͙̘̺͗͆̅͐̆Ǩ̢̘̠̫̜̼̦̅̅̚()Ljava/lang/String;

    move-result-object v81

    invoke-static/range {v81 .. v81}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v81

    xor-int v85, v85, v81

    const v83, 0x1abebc

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->č̜̫̦̠̻͈͈̤̼͂̂̄͘c̠̱͕̠̻̅̂̎̄͂ḽ̷̛̦̫̲̆̎̍͑̊̋̋̑̋̒̿̏̚̚͘͝͝͠k͌͠͝ȁ̶̭u͎̍̂̎́ũ̙̮̞͌̌͗̾͗̂͒̌͜͝k̑̍̀̾͠ǎ̻͎̮͖̹̺̠̎͊̅̚͝B̡͕̼̥͎͈̭B̵͈̗͗͊͜ḩ̷̸̨̛̮̟̗̻̖̖̟̙̫̯̘̪̺̪͌̔͑͋̏͑̌̋̄́̑̂̿́͌̇̀̈͊̃͘͜͜͝͝͠p̴̵̸̨͙̭͙̈́â̗͈̩͎̋̋̂̈̅̂͜h̘̭͎͐̅ẗ̶̸̨̛̛̥̘̖̤̭̩̫̰̙̖̥̗̘̰̭̒͌̑͗͋͗͐̑̂́̈́̈́͘͜͝K̸̺̰̐̒̐a̧ư̵̶̹̭̥͎̲̺̭̺͖̂͊̑̈́̑̈̌̔̈̃͌̍͊̏͝͠aĶ̸̸̛͉͚̱͕̮̱̮̭̗̩͈͕̘͗͒̃̎̌͗̎̒͝͝ë̸̜̥̂̌()Ljava/lang/String;

    move-result-object v81

    invoke-static/range {v81 .. v81}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v81

    xor-int v83, v83, v81

    const v84, 0xdbf5

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̸̷̶̢͕̤̝͉̦͓̹̥̭͈͉̠̤̦͚̰̫̜͇͉̯͓̙̅͋̂͗̈́̌̑̂̋͋̈́̑̌̾̂͑̌͘̚͝a̫͎K̠̎t̸̪͕͇͎̊̅K̘̪͚̫̎̒̏c͒aä̴̸̶̫̭͎̗́̂̃͘K̪a̶̢̯̭̗̟̼̗̙͓̺͚͚͚̋̏͗̈́͌͂͝͝h͈͇̞̺͕͕̫̙̲̱̘̬̱̾̋͂̾͌̋͑͝͝t̶̎k̙̽́̑̾͘a̴̬̦͌͂a̶̸̴̸̶̸̸̡̧̢̨̡̧̧̢̼̺͙͚̭͙͙͚͕̹͓̖̬̝̗̹̩̮̦͓̜̠͈̗͈͉̔̏͌̈́̎̂̾̅̌̂͗̔́̾͌̏́͗̈̃͗̈̎̒̎͌̂͝B̨̨͚̗͚͗B̸̵̭̮͚̮͐̍͋́͑͘͠B͚̤̲̂̔a̗͒aė͙B̷̜̫͈͎̊͋͝͝͠o̸̺ā̶̶̶̷̵̧̛̙̯͚̹̥̗̹̯̹̐̆̎͂̀̂̃͑̂͋̊̚͘͜()Ljava/lang/String;

    move-result-object v81

    invoke-static/range {v81 .. v81}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v81

    xor-int v84, v84, v81

    invoke-static/range {v82 .. v85}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ų̶̸̴̶̸̸̛̛̭̯̭̮̻̲̫͈͓̥̹̦̱̫̱̪̘͚̿̌̑̐̌̂͂̃̀̾̀͗͠o̶̸̧̯̰̦̠̘̭̫͉͕̙̩̹̙͗̅̋̀̃͐͌̀̋̍͌̚͜K̸͋ơ̸͕͚̝̗̾̇͒̋͌̂̋ţ̸̶̯̪̪̎̅̋̈́͝u̴̸͚̮̤̦͉̪͉͎͑̂͊̋a̷̸̯͈̖͊͗̌͑̿̂͠k̞̰͋͘ą̛̪͇̪̫̥̱̌̋̾͐̀͑͐͘͜͝ͅhK̼̦̰̥͎̪̤̍̀̅̌͋k̈ǫ̹͗͜uo̷B̆u̷̖̤̼̲̮͎̥͒͌̂̑l̸̥̹̭̹̯͎̎̎̄̂͌̐̄̄̿̀̄̃̂̂́͝a̹̒̀͜ͅo̵̫̦̱̲̮̾́̽͑̃̅č̛̟̙̮̆̈̂́̚͘͜n̸̢̙̲̹̹̼̆̂̑͌̍̋͊̂̇a̸̴̷̧͙̱͓̺͎̖̾͋̑̂͗͋͗̃̈́͗̄̃̂̚̚͝͝n̶̬͝͝͝͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v82

    move-object/from16 v4, v82

    new-instance v6, Ljava/lang/StringBuilder;

    invoke-direct {v6}, Ljava/lang/StringBuilder;-><init>()V

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v88

    const v91, 0x1aae6e

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ľ͚͘K̶̸̢̮͙̤̙̥̤͉̥̭̱͈̃͊͌̄̋͘ͅö̷̧̜͙̻͗͒̉̅͊̅͘̚͜ë̸̶̶̷̵̴̸̡̛̘̬̼̞̘̗̝̯̙̫̼̤͙̭͎̭̱̥͇̥̲͎̔̌́͌̄̈́̋̍̈͑̐̋͋̋͗̈̔̂̈́̈̑̈́̎̚͘͠͝͝͝͠͝ͅp̭͌͑̌̑̊o̸̷̡̫̩̝͉͚̒͗̈́̈̅̕͝Ķ̷͓͕̦̗̺͓̺̪͕͓̃̃̊̿̂̿̿͗̏̈́̌̍̂̚͘͠á̮̿͘̚͝c̘̗͉̤̙̯͇̋̀̋͠c̵̴̺͇̹͓̰͈̫͉̮̾͌̑̚̚͘͝͝a̛̭͎̗̲̫a̛K̸̶̢̩̦̞͈͙̗͚̫̏̓̂̾͊̚K̷̨̪͕͇̝̹̈́͌B̵̸̢̫̫̗̠̖͉̘̻̪̭̱̌̅̿͂͐̎͜͝͠k̨͇̫͕̭̍̂͋ā̶̦̈̈́̂̂͋͌̃̂͝n͕̗̏B̢͈̩̃̾̌͐̈̅͌͗̌͝()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v91, v91, v87

    const v89, 0x1aab06

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->e̷̛͉̻̭̯̗̫̩̮̰̔̉͒̾͗̎̀̎͘͘̕͜͝P̻̞̱̼̺̮̋̌̈͘͜ͅK̸̢̛̹̾͋͑̿͝ả̴̛̰̭̗͙͇͈̩̻̆̎͌͒̋͒͗̚͝͝͝ú̗̮͈͉̘̍̈̃̂̋ǫ̷̴̶̸̷̛̛̯̖̺̮͓̰̦̺͕͕̗̥̯͓͚̭̫̗̭̗͙̫͗̎͂͒̽͌̔͊̂̆̋́̋̎̂̾̑̔͌̾͑̇̓̈̈͋͊̃̃̔̂̍̈̚̚͜͜͝͝ͅo̴̢͓̺̗̮̯̹͈̘̅͗̑̅̐͐͂͊͠͝h͓̱̿͌c̑͝ą̷̸̶̧̩̺̺͕̱͓̦̘͉̱̼̋͋̍̀̌B̨̮͚̮̺̹̃͐̾̌͗̃́̑̾̚̚h̹P̸̸̧̢̟̺͓͉̌̅̄̅̅͋̀̀̋͘̚͜͝ķ̶̗̯̪͐̎̈̔͌č̴̸̸̴̨̨̨̰̩̟̩̯͎̘̫̘̤̱̱̗̻̼͐̾̌͑̎͌͗̃̈͗̋̑̈̃́͌͜͝()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v89, v89, v87

    const v90, 0x1aaaeb

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ḩ̸̸̢̘͓̫̯̮̺͈͉̋̅̅̑͗̅͜K̷̢̘̘͕͉̅̋̅̐̈͑͊̂̌͝B̶̫̲͉̅̏̑̈́̕cô͎̠̻̱͌́̃͌̐͜l̫̑̌̈́ä͓͎͉̗̗̘́̌̿̾̋͠ḵ̷̩͓̅̑̌̆͝ķ̸̴̻̫̤̔̂ͅa̶̸̡̧͎̦̫͓̗̘̜͆̌͌̂̒̔̆̈̌̎̔̈́͠K̸̴̸̸̨̨̫̮̥͕̝̠͎̲͖̫͓̯͉͎̫͚̩̺̗̫̭̀̋̉̀̋̂̑̓̂̈́̌̅̉̈́͌̌̎̾̀͘͜͝͠͝͠t̵̆͜k̵̸̸͉̖̹̪̰̙̯͒͊̈̅̋̔̈́̑͘e̛̫̫͌̃̈́̂͌̍̃̄͜p̷̸̴̶̷̧̨̛̛̯͎̫͉̯̭̻̮͉̫̙͓̺͉̭̠̋̿͊̂̿͋̍̋̎͗͌̏̉̊̈̃̎̂͗̚͜͜͝ļ̷̴̛͎̗̦̟͚͉̻͚̘̀͊́̀̄͋͒̈́͌̈̆̑̕͘̚͘B͊h̨́̒͊͝()Ljava/lang/String;

    move-result-object v87

    invoke-static/range {v87 .. v87}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v87

    xor-int v90, v90, v87

    invoke-static/range {v88 .. v91}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v88

    move-object/from16 v7, v88

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    sub-long v7, v18, v38

    invoke-static {v7, v8}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->K̷̨͙̭̯̝͕̥̅̑̂̌͝t̃̑͜t̷̴̸̨̻̗̝͕̼͖̫͐́̃̑̉̈́̀a̹̘̮̾͌c̻̫̲̉̄̂͝͝k̛͚͕̏̾̍͐ea̴̻̱̬̻̱̗̾̑t̬͗̎̈́̚͝͝t̵̥̎h̵͙͒̚͜h̯̆͘̚͝ć͜͠oc̸̛͈̫̮͉̼͆̈̎̍̀͘K̢̨̠̹͚̥͈͂̓͌͗̀̌̽͗͑͘͠ͅk̸̨͖̺̈͌̅̌́͘͝kk̢͈̞̋͘B̷̗͑̃o̺͈̹͊l̴͉̖͚͠h̸̸̴̡̧̢̰̫̠̭͚̘͕̻̗̼̯̩̤̟̲͋̎̈̑̎͌̍̂̇͌̑̽̌͗͆̂̕̕͜͝͠͝P̸̤̈̒̔͗͂͌nḩa̷̧̪̲̪̺͓̭͌̈́̆͜k̵̸̢̨̧̛̝̩̮̱̪͈̯͉̙̻̲̦̺̦͕͎̯̹̩̈͒͗̐̇̍̿̌͋͑̈́̑̌̊͗͌͗͒̌͘͜n̥͚B̷̨̩̠͆̿̐̐̐̀ͅ(J)Ljava/lang/String;

    move-result-object v7

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v78

    const v81, 0x1aa0a4

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ȩ̶̷̸̸̢̛̺̹̰͕͈͖̱͓̼̗͖̝͙̞̥̺̗͚̍͑͑̾̍̋̆̊̂͗͗̈̋̌͋͋̋̌̋͆̌͋̎̆̑͌͋̕̚͘͝͝͝t̸̢̨̗̘̘͐͋̄̎̈́̌̅ų̛̙̥̰̼͋̄̌͗̊̑̂̍̎k̷̯̘͚̥̪̍̈͌̐͘ķ̷̡͈̠̪̗̙͈͖̤̃̈́̀̃̂͌͌̈́̃̑̕͘͠͠c̝̰̑̈́̈̚ǩ̷̟̱̊a̸̸̧̟͙̦͙̖̯̙̜͓̺̽̾͌̀͜͝͠u̧̲̘̹̎̀̌k̭̖̮̼̱̮͐̔ą̵̷̛̝͇͖̠̗̹̥̪̱̦̯̬̭̤͕̥͓̝͓͚̓͊͊̎͊̔̍̉̂͘̚͘͘̚͜͜͝͝ͅu̵̥͙͚͕̮͌̊͒͗͌͊̾͜͠P̸̶̺̹̩̐̑̈̎kB̵̶̸̧̦͉̤͕̙͚̗̀̅̀̈́̈͋̐͜͝͝a͓̗̘̪̠̭͂̐̂̀̄͜͜͝͝u̷̫͉̯̺̮̿̋̀̈́͋͜()Ljava/lang/String;

    move-result-object v77

    invoke-static/range {v77 .. v77}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v77

    xor-int v81, v81, v77

    const v79, 0xdc9b

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->hB̸̷̸̶̨̧̢̛̛̛̹͕̩͙̭͉̫̺̖̗̘͎̼̜̻͕̠̺̫̥̟̭̺̲̠̗̙͊͒̔̃͋̂̀͋͌̃̈́̂̄̑̂̂̌̈́͋̍̇̋͌͜͝u͉K̸̢̧̛̭̲̝̮̱̦̾̎͐̊̆̌̊̈́͒̿͗̎̚͝ū̷̸̶̢̢̲̮̮̹͙͙͈͓̖̯̙̪̗̑̾̎̈́̾̃́͂̌͗͐̆̄͗͗͜͝P̫a̸͜n̷̯̗̖͉̭͓͈͎͑̂̄̅̈̈̓͌͝k͕̫̺̈́̿̆P̶̷̶̶̢̧͕̞̺̘̖̺͉͈͖̪͋̅̂͗̃̿̐̒̾̈̌͒͂̂̈̈́̚͝͝͝n̷̨̡̼̮̗̫̫͎̒̈́͌̌͌̾̊̋̃̿͜͜u͈͎̎̐a͎̤͎͗̃̋̋a̴̴̷̸̸̸̢̨̢̛̛̖̼̱̺̺̭͓̼͕̻͚̗̤̺̹͉͙̩̠̿̂̅͗̋̅̋̂̄͒̐̃͐̃͌̑̅̄͂͂̎̌̿̅̅̀̀̿͋̂̚͘͜͜͝a̅͌()Ljava/lang/String;

    move-result-object v77

    invoke-static/range {v77 .. v77}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v77

    xor-int v79, v79, v77

    const v80, 0x1aabd1

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ą̵̴̵̶̴̵̨̧̥̥̘̯̙̖̘͙͙͉̙̯̦̙͉̭̥͓̦̺̲͈̰̫̺̬̯͙̮̄̍̑͌̃̍̏̍̅̔̍̑͋̈͑̀͗̈́̄̋͐̎͑̈́̋͌̂͒̉̈͌̒͊͌̏͒̋͘͜͠͠͝͝͝͝e̵̯̹͉̜͗̏͌̋͗̌͝t̿͑̏̌̚ǎ̴̡͎̮͎̬͓̭̹̤̱̘̋̈̒̈́̓͜͝͝a̶̛͎̠̘̯̼̗̫̜̍̚͠͝͝B͉̒̇͂ç̶̶͓͈̫̫̮͕̺̭͉̦͉͙̗̮͓̂̌̅͑̌̑̑̋̃̿͆̍̃̌͋̌͘͜͜͜͝͠ṷ̗̱̫́̍͌P̧̲̦͇̱̘̟̘̹͎̱̻̟͂̌̂͂́̿̃̄͑̆̂͋͘͜eă̤̌Ṕ̶̨̹̥̠͚̝̝͚̋̌̄̾̈̚ȧ̷̷̧̦̱̠̮̱̾̕͜͜͝B̃̌̈͜ţ̧̖̘̘̲̯́̈́e̶̺̻̤̦͓͚̝̅̃̍̏̋͗͌́͑͘͜͜ë̥͕()Ljava/lang/String;

    move-result-object v77

    invoke-static/range {v77 .. v77}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v77

    xor-int v80, v80, v77

    invoke-static/range {v78 .. v81}, Lcom/kashi/settings/view/BlurBackgroundImageView;->K̙̈́Ķ̷̸̫̺̘̩͗͌͆͑̎͋̌̂̚k̸̢̗͕̫̹̃̈̃̋̿̔̊͝K̷̨͚̖͈̋̑͆̃͘ų̸̝̫͉̎̌̋̔̌͒̋̃̎̉͘͜a̫̯̲o̸̸̸̱̥̻͌͆̎͋̋̕͘͝k̫B̧͎͝ḧ̴̶̢͉̯͓̮̫͎̯̥́̿̍͌͌̈̔̔̎̾̋͌̋̚͠͠͠e̸͇͚̮̮̟͎͋̎͗̏͘̚o̴̱͕̗̔͠ā̴̶̧̧͉̹̗͗͐̅̃̎̿̚͝ǎ̴̶̴̧̭̩̗̭̤̥̫̹̖̲͈̯̬͉̤̬̤̫̌̋̐̑͗̌̌̈̏͂͋͌̌͂̌͑͘͘̚͜͜͠͝͝͝k̶̸̸͇͓̮̹͚̩̫͈͊̄̄̃̓͑͂̿̋̌̋̾͂͘͝͝͝͝t̷͈̫̠̝̻̬͕̱̗͊̅̎̆̚͜͜k̸̸̡̞̘͚̘̯̮̺̐̋̂͋̒̇͗̂͘͜͝o̺͎͋à̩̇͑o̸̧̡̖̺̭̘̫͌̍̿̀̇͑̂(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v78

    move-object/from16 v7, v78

    invoke-static {v6, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v6

    invoke-static {v6}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ae̮͚͚̭̰͐̔̋ņ̮̝̱̲̫͈̈́͗̅K̮̗̭͒͌̎̋ȃ̧̛̺͚̩̮͓͙͇͚̦̇̀͒͆͜͝K̸̸̸̨̹̗̯̭͎̫̞̗̼̅̏͌̇̈́͋͗͆͗̈́͑̇̒̈͘̕͝͝͠p̷̷̵̸̢̢̠̹̘͉̈̈́̏̿̃̎̀̿̆͘ẗ̸̛̫́͋͑̑p̧̢̖̮͗̆ãPk̵̸̞͉̗̗͉͚̥͕̲͚̼͕̪̗͈̃̿̋̾̂͂̎̈̿̾̃́͐̑̿̀̀̋̂̅̐̂̂̈́̎̂̑͗̊̋́̚͜͜͝͝͝͠k̿͜ṯ̪̫̄̈́̚l̯̆́͠l̸̲̂͑̄͗́o̧B̫͚͌̂̑͋̚ä̹B̗͚̤̘̂͊̂̿͋̋͝K͚̋a̸̷̵͚̞̺̘͙̭̤̺͒̈͆̋̾͑͠a̸̧̛̘̹͈̱̠̍͌̌BK̶͋e̱ę̸̛̛̫̘̥͚̫͗̒̓̌͗̂̈́͝͝ḩ̵̸̧͎͚͎͇̯̌͐̑̔̌͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v6

    goto/16 :goto_2e
.end method

.method public renderScriptBlur(Landroid/graphics/Bitmap;IFI)Landroid/graphics/Bitmap;
    .registers 79

    move/from16 v27, p4

    move/from16 v26, p3

    move/from16 v25, p2

    move-object/from16 v24, p1

    move-object/from16 v23, p0

    new-instance v15, Landroid/graphics/Rect;

    invoke-direct {v15}, Landroid/graphics/Rect;-><init>()V

    new-instance v5, Landroid/graphics/Rect;

    invoke-direct {v5}, Landroid/graphics/Rect;-><init>()V

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->č̸̵̗̻̗̠̫̯̾̏̂̊̌̋̋͂̃l̨͓͚̪̿̈́̋͐͗̂̄͜ō̸̸̸̢̧̰̥̘̎͐͋̕͠͝͝͠KK̍e̴͉̫͂͐̿̅̈͌͂͜͠t̵̜̺̯͚̙͊̂̋̚͘B̷͈̥̫͊k̝̭̥̪̞̽͋͌̈́̅K̨̭͌̋̈́̄c̸̴̶̛̘͕̖̩̹̺̰̼͉͉̭̱̖̮̦͙̎̂̈͋͗̿̾̅̑̈͌̑̎͌̂͜͝a̛͇͋a̵̸̸̬̺͕̹̿̂͗͗͗̑̂͘n̷̢̫̩͕̩̔̄͑B̩a̧̢̠̱̔̈͌̅̍͐ͅh̡̩̮͗̌͌̂̌P̥͎̝͎̫̞̹̾̍̈̐̂͑͠͝͝ǘ͇̲͈͓̗̄̋̃̈̂͊͝Ḱ̪P̶̧͓̯̫̩̖̫͋͋̃̃̎̋̊͗͘l̷̵͎͚̠̗͚̭̂̂͊̔̚ͅơ͙̈́a̡̛͚̗̫͙͓̾̽̔̈̈́̈́o̵̶͕̭͌̾̉͗ţ̋o̺͚̲̱̫͊͘̚̚()J

    move-result-wide v16

    invoke-static/range {v24 .. v24}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->c̫͎̤̩̋́̾c̸̮̞̲̭̹̏̐̋͗̉̂c̗np̧̹͕̯̼̪͊ëą̶̴̛̖̘̬̩̙͈̹̝̩̪̥͉̝̋̈́̄̋͗̂̕͝p̪̭͗a̸̫̠̲͖͜͜o͗a̷̵̷̛̫̫͎͈͎̤͓̹̘̩̫͕̝̞̗͎̋̄̋̈̅̌̃̉͒̎͗͝p̑̚n̨̧͉͉̠̎́̈́̈́͐̂̋͘͠l͉̞͙̝̼̫͎̍͊͜B̶̴̸̵̸̶̶̨̢̡̛̭͓͎̭͎̗̰̤̤͓̹͚̫̯̤̦͓̗͕̦͇̭͚͓͈̗̗̄̂̎̎͗͐̀̂̾͗̈͌̎̔̋̑̃̿̽̉̾̇̾͐̌̈̆͑͋̑̏͐̌̆͗̆̓͘͘͜͜͝͝͝͝͝͝͠͠ͅl̸̸̸̛̥̲̥̺͇̦͚̗̈́̇͌͗̎̿͌̅̃̇̏̾͒̋͝ͅc̷̢̧̧̛̲̘̹̬̯͚̫̪͚͓̯̖̼͈̈̈̓̄̀̑̊̌̂̈́͋͜͝͝͝K̖̪̤̤̈̏ḽ̋̂(Ljava/lang/Object;)Landroid/graphics/Bitmap$Config;

    move-result-object v19

    const/16 v20, 0x1

    move-object/from16 v0, v24

    move-object/from16 v1, v19

    move/from16 v2, v20

    invoke-static {v0, v1, v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ȯ̵̡̢̼̲̃͗̾̈á̓̒̈͊̈́̌̌̚͝u͈c̸̨̧̡̛̦͓̱̝͉̺͕͚̃̇́̌̂̂̿͌͝͝͠ă̫͈̥͓͎̰̺͈̫̈́̚̚͜͝͝l̷̶̶̷͇̗͇̗̗̦̗̲͎̈́̽͂͗͊̐̉͊͑̄̈̅̈́̂̈͜͜͜͝͝͠ą̸̷̷̛͚̘̺̗͚̹͉̘͕̖̮̙͚̫̤̖̠͗̒̐̎̀͂̑̔̎͗̈́̒͗̋̑̃͜͜͜͝͝͝ͅa̴͉̤̦͈̥̭̠͆͂̌͘͘ǎ̡̋̈a̗o̶̵̶̧̧̡̪͈̬̮̜̫̜͖̺̱̟͋̾̃̑̌̃̂̋͋͂̋͐̌̋͜͠ǔ̸̧͎͓̈́͜K̝̠͇͕̺̆͗͘p̴̸̸̸̶̸̨̧̧̧̢̧̖̺̺̫͕̫̭̫̗̹̻̭̮̦͉̯̱̥͙̲͈̯̖͓̞͌̾͋̎̽̑̈̈̾̂̎͌̅̀͂͌̑̔̈́̿̑̾̐́̄̂̂͌̎̋͘̚̕͘͜͜͜͝͠͝͝͝(Ljava/lang/Object;Ljava/lang/Object;Z)Landroid/graphics/Bitmap;

    move-result-object v9

    const/16 v19, 0x60

    invoke-static {v9}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v20

    invoke-static {v9}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v21

    div-int/lit8 v21, v21, 0x60

    div-int v20, v20, v21

    const/16 v21, 0x1

    move/from16 v0, v19

    move/from16 v1, v20

    move/from16 v2, v21

    invoke-static {v9, v0, v1, v2}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->P̷̸̶̴̛̛͖̬̪̗̘̯͎͖͕͙͉͎͚̭̺̥͚̠̝̫͎͗̈̅̃̈́̔͑͌͒̂̌̎͘͜͝c͋͗û̵̶̧̫̖̄̍̎̉̂͠a̸̖̗̿͂͝áę̧̟̯̺̮̻̟̖̹͓͒͗̑͑͌͗̇͠͝ḁ̃P̍͑K̗͌̑͘Ķ̛͌̈̐̆ă̶̶̘͓̱̥̙̘̗̭̎̾̑͌̊̍́͑͝K̂͜l͚B̟̮̽͋͗̅͋̕͘ä̸̧̛̛̫̗̱̫̙̖͈͙̈̈́͑͆̋̌͌͌͗͗̃̅̃͋̑͘̚͜͝ä̶̈͌̑l̸̤̮̖̹̃̇͊̄̚͝k͙ó̠̯̖͕͓̲̬̘̾̑̃͜͠o̴̴̮̅͒̂l̷̹̱͖̦̈́̌̿͝͝͝l̄͋̓ḻ̸̛̫̘̹̌̋̎̚P̻̲u̸̼̩͙̩͎͚̎̌̔̋̾̚̕͜͜͜B̶̧͚̗̭͕̥̓̔̄̃͌̚P̶̧̭̥͚̠̈̕ç̷͎͈͕̰̭̀͋͗(Ljava/lang/Object;IIZ)Landroid/graphics/Bitmap;

    move-result-object v14

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v19

    mul-int/lit8 v20, v25, 0x2

    add-int v19, v19, v20

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v20

    mul-int/lit8 v21, v25, 0x2

    add-int v20, v20, v21

    invoke-static {v14}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->c̫͎̤̩̋́̾c̸̮̞̲̭̹̏̐̋͗̉̂c̗np̧̹͕̯̼̪͊ëą̶̴̛̖̘̬̩̙͈̹̝̩̪̥͉̝̋̈́̄̋͗̂̕͝p̪̭͗a̸̫̠̲͖͜͜o͗a̷̵̷̛̫̫͎͈͎̤͓̹̘̩̫͕̝̞̗͎̋̄̋̈̅̌̃̉͒̎͗͝p̑̚n̨̧͉͉̠̎́̈́̈́͐̂̋͘͠l͉̞͙̝̼̫͎̍͊͜B̶̴̸̵̸̶̶̨̢̡̛̭͓͎̭͎̗̰̤̤͓̹͚̫̯̤̦͓̗͕̦͇̭͚͓͈̗̗̄̂̎̎͗͐̀̂̾͗̈͌̎̔̋̑̃̿̽̉̾̇̾͐̌̈̆͑͋̑̏͐̌̆͗̆̓͘͘͜͜͝͝͝͝͝͝͠͠ͅl̸̸̸̛̥̲̥̺͇̦͚̗̈́̇͌͗̎̿͌̅̃̇̏̾͒̋͝ͅc̷̢̧̧̛̲̘̹̬̯͚̫̪͚͓̯̖̼͈̈̈̓̄̀̑̊̌̂̈́͋͜͝͝͝K̖̪̤̤̈̏ḽ̋̂(Ljava/lang/Object;)Landroid/graphics/Bitmap$Config;

    move-result-object v21

    invoke-static/range {v19 .. v21}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->p̵̴̢̞̫̠̺̖̝͈̩͎̊̈́̂͌͗̔̑͘͘͜Kņ̸̢̻̺̤̭̭̹͎̯͈͌̄̌͂̚͜͝a̸͈̰̫͌̎̆͌̚͝ả̯̃̀ͅP̸̐̌͘a̵̸̴̧̫̭͈͊̂̉̎̈͒͗̿̚͘͝pK̡̫͓͎̲̱̥̘̇͆͌̽̐̃͗̐̎͘̕͜Kć̸̤̭̼̮̦̥̈͗̇̚͝p̙͙̱̼̋̀͠o͗́̋̑̑͗a̡̛̗̦̫̓̄͘t̗͚̻̅K̸̛̟͎̤̮̯͈̺͌̔͗͒̌͌̎͜͜͝tļ̷̷̡̲̪̦̱̖̫̫͕̥̅̌͌̋͊̈́̉̂̅̋͐̚͜͜͝͝͠P̷̛͎͚͚̲̈́͗̑̋̂́̂n̶̶̴̴̸̵̷̨͉̭̠̮̮͉̘̙͖̫̯̑̏͋̋̃̈́͒͋̂̈́͂̈́̽͂̂͘͠t̯Ke̋u͘a̰̫̗̗̋͌͗̐̚͜͜͝p̶̨̢̯̱͖͕̱̰̂́͗̂̅͝ñ̷͙͈͓̐̂̄̑(IILjava/lang/Object;)Landroid/graphics/Bitmap;

    move-result-object v18

    const/16 v19, 0x0

    move/from16 v0, v19

    iput v0, v15, Landroid/graphics/Rect;->top:I

    const/16 v19, 0x0

    move/from16 v0, v19

    iput v0, v15, Landroid/graphics/Rect;->left:I

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v19

    move/from16 v0, v19

    iput v0, v15, Landroid/graphics/Rect;->right:I

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v19

    move/from16 v0, v19

    iput v0, v15, Landroid/graphics/Rect;->bottom:I

    move/from16 v0, v25

    iput v0, v5, Landroid/graphics/Rect;->top:I

    move/from16 v0, v25

    iput v0, v5, Landroid/graphics/Rect;->left:I

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;)I

    move-result v19

    move/from16 v0, v19

    iput v0, v5, Landroid/graphics/Rect;->right:I

    invoke-static {v14}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḁ̶̺̘̾K̃̋h̸̿̃n̴͒̑͐́̃͜͝ṷ̵̷̢̧̌̌̾̂̈́̈́͝a̹͈̥a̶̧̱̗̹͒ŭ̮̻͗̒̋̆̿͑͝͝K̷͉̙̎͗̾͗͆̎ţ̸͈͎̼̩̹̫̫̩̺̪̊̌̋͌̈̊͘̚͘͜͝ͅe̡̞̎̋͆̍c͙͙͕̗̈̎̋͒̾͋͠ų̸̸̸̸̹͓̖̠̯̙͕͓͎̱̠͎͎͋̌̍͌̈́̑̋̾̐͌̎̈́̅̌̒̆͝à̛̺̹̈̒̍͝B̷̧̡͕̗̫̗̫̟͚̹̰̹̗̤̬̤̺̭̭̗͖̆̌̌͆̈̎̿͑͋́͋̎̑̋́̈́̃̑̎̂͘̕͜͠a̸͈̯̹͚̩̮͌̆͊͗̿̿͗̆͋̋͂̅͑͌̀͌͘͜͜͜B̡̛̛̠͚͈͉̮͓͈͉̫͌̌̌̈̐̋͑̋̎̐̄̑̈́̋̌͘͘̚͝͠͝͝c͓̘̗͗a̜͙̍̃͠Ķ̶̛̺͉̥̈́̇̌̈́͊̃Pk̩̪͈̂͋̈́͝(Ljava/lang/Object;)I

    move-result v19

    move/from16 v0, v19

    iput v0, v5, Landroid/graphics/Rect;->bottom:I

    new-instance v4, Landroid/graphics/Canvas;

    move-object/from16 v0, v18

    invoke-direct {v4, v0}, Landroid/graphics/Canvas;-><init>(Landroid/graphics/Bitmap;)V

    new-instance v11, Landroid/graphics/Paint;

    invoke-direct {v11}, Landroid/graphics/Paint;-><init>()V

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->k̷̨̛̥̮̰͕̲͙͙̠͎͆̌͒̌͌̏̂̂̂o̸̸̸̧̮̰̦͚̘͚͓̭͎̙̤͙͈͎̺̦͋̅͑͐̅̽͗͋̈͑͜K̷̛̛̗̹̫̠͈̼̮̹̘̼͆̆̒͆̂̒̒͘͜͝ṕ̷͜͠t̸͓̬̗̽̿͌̇̒̃ä̸͓̌àö̭́̄n̖̗̺̐ȏ̿ç̺̫͚͌̿̊k͉̗̑ķ̸͕̯̘̻̯̘͚̗̫͉͈͖̺̾̋̂͋͋͑̿̃̔͋̎͌̕͜͝͠͝ͅŏ̴̗͙̂͗͊ö̸̺͈̌̑͝c̋B̷̷̷̶̢̢̫̦͎̩̜̤̼̫͑̾́̂͝ͅu̥̐̃ļ̶̸͙͖̮͎̐̿͗n̪͓̞̻͕̖͒͝k̴͎̭̗͉̻͗̈͌̈͘͜͝͝ȁ̷̛̯̯̭̦̘͚͌̿ǎ̛̗̫̻̻̋͝cõ̶̠͎̐̂̔̂̏̍̅͒͜c̸̵̷̸̛̘͓̩̻̯̯̥͈͚̿̈͊͌͗́̊͌̑̚͝p()Landroid/graphics/Paint$Style;

    move-result-object v19

    move-object/from16 v0, v19

    invoke-static {v11, v0}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->u̍â̢̛̹̺̦̘̪̑͜͜͝͠o̷̷̸̦̪̙̦̯̫̻̪͓̱̅̔͌͗͗̆̂̃̾̄͘͠ṕ̸̸͚͚̪͎͂͗̔̎̂͗̃̄͋̄̀̑̚͜͠Kâ̛̛̝̥͉̯̝͈̱̦̲͚̮̙͚͌̂̏̈̽͂͐̾͗͋͗͌͑̂̂͌̈́͘͘͜͜͠á̧c̸̠̺͈̫͖͌̐̐̄̂͜l̵̜̋ͅâ̧̧̩̈́BP͚̯̩̈́͋̂̇̈́̈o͇̿̈o̡̤̯̎̂̈́̔͆͒̅k̗̼̃̋́̅͗́͠P̷̶̶̴̢̨̢̛̛̛͈̫̭̥͚̫͚̭͚̮̗̬̗͈̥̮̗͚̗͉̪͎͉̤̫̝̦̦̫͚̈̑̏͆̔̿̋̐̂͋̋̎̂͒̃̅̈́̌̊̎̌́͗̈̃͋͑̅̈́͗̌̔̄̔͋̀͂̈́͗̀̂̚͘͘̚͘͜͜͜͠͝͝ẗ̴̫̟̱̭̫̪̝̫̃̈͋́͌͊̋͜a̶̷̠̺̫̫̙̿̈͑͊PK̛͈̍̈́̌͝(Ljava/lang/Object;Ljava/lang/Object;)V

    const/16 v19, 0x1

    move/from16 v0, v19

    invoke-static {v11, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̭̋ö̷̢̨̗̹̫͈̈͑͗̂̚͝Ką̴̫̅̑̈́̌̎ḁ̷̸̶̧̛̖̯͌̿̀͘̚͝Ṕ̷̶̷̡̛̯͚̱̗͇̩̥̥͕̮͙̫͎̘͎̫͓̺̎̐̌̌̌̂̎̾͜K̶̩̯̺̱̫̈́̆̋̆́͜ţ̵̢̯̱̺̭̮̯̗̺̼̍̿̈̔̎̈̂̆̎̎̂͐ǘ̴̴̶̴͙̟͎̫͌̽̇͒̅̉̃̂͝o̸͉͆́a̺̫͑̂͋͝ą̸͈̟̼͚̫͙̬͊̎̒̾͝Ķ̵̢͕̙͓͒̌̚͝͝a̸̧̧̝̥̾̒̋̋̎̅ȧ̾̍B̮ù̷̵̴̮͈̯̫̂̃̑̔̇̌̅͂͂͝a̴̶̸̷̢̛̗̺̯̪̱̤͖̰̘͑̃̑̂̓̿̌͂̓̂͝͝ȩ̸̶̴̼̼̤̯͉̹̹͓̘͎̺͉̗͎͉͖̙̖̤̃͋̄͂̈́̅͌̆̋̅͑̕͘̚͜͜͝͝t̨̖̞̄͜͝K̴͕̆͜ą͈̟̥̋͒̑(Ljava/lang/Object;Z)V

    const/16 v19, 0xff

    const/16 v20, 0xff

    const/16 v21, 0xff

    const/16 v22, 0xff

    move/from16 v0, v19

    move/from16 v1, v20

    move/from16 v2, v21

    move/from16 v3, v22

    invoke-static {v4, v0, v1, v2, v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->kt̖̗̔ț͈̥͘͠P̕n͓̄͝a͜P̸̴̧̮͉͌̃̃͝h̸̫͕̐̂͗t͕ā̙̱̫͗̿͠a͓͜ȯ͠P̧a̵̭̐̐͗̇̊͑a̦̯̗̗̤̫̺͆̏͗̚͜͠P̷̷̸̷̵̷̧̛͕͉̗̤͈̫̫̺͚̭̘͈̺̦͈̅̋̎̅̈̌̃̋̃̆̔̈́̏͌̌̈́̈̿̈̏͑̔̅͋̿͌̚̚͠͝͝a̵a̷̧̛̙͇͈͖̺̦̪̗̘̠̤̞̬̭̩͓̟̖͈̗͌̂͌͌́͌̽̓̀͋̋̉̅̈́̃͐̈̈́̾K̵̶̸̵̢̢̢̡̧̧̛͉̺̭̠̱͎͎̦̥͓̰̫͎̯̪̖͎͊̍̂̂͋̌̂͌͘̚͜͝͝p̭̙͝ò͈͉̹͓̠̄͐͜ä̪́̐̚u̗̯ah̸̛̛͉̬̤̭͉͉̬͉̯̱͌͗͆̿̃̐͆̎̔͂͘͝͝o̝͙̎͋͜P̧̛̠̫͓̗̺̠̥̪̯̞̀̄́͒̚͜͜͠͝tt̋(Ljava/lang/Object;IIII)V

    invoke-static {v4, v14, v15, v5, v11}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static/range {v23 .. v23}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->a̶͎̰̗͈̼̤͒͝p̸̴̴̢̢̢̛̺͙͎̝̼̻̪̫̩̭̫͗̈́͑̌̐̾̀͐͌̀̄̈͗̑̾̾̚͝͠al̖̖̤̘̗̎̐̿͗p̢̫̦̆̈͠͝ǩ̷p̉o̶̵̴̧̭͕͉̯̘͓̮̹͓̞̯̰͚̭͋̌̋̓̃̌́̂͐̎͜͜͝͝h̢̭͓̀̿̂͋B̸̯͕̙̋̐̋̊̆͊͝e̠k̷̶̸̷̸̵̢̛͉̹̮͕̗̫̭̼̫̫͈̥̤̈́̃̋̾́̋́͂̃̈́͗̚͜͜͜͜͝͝t̅̋͗̑̂̆P̛̙̮̗̰̦̞͙̎̿̀̃̋͒͑̈̀͜͝c̴̢̧̛̼̹͖͈͎̦͎̫̞̭̪͙̋͋̀̇́̄̋̃̒͜͜͠͝͝͠ͅç̛̯̫͇̬̥̙͉͙̭͓͉̭̄̈́͐͑͊̏̾̃̈̄̂͊̄̈͜͜͜p̜ö̴̸̴̘͎̼̤̹̺̺̙͕̺͉́̌̎̾͗̂̉̑̋͌̚̚̚͘h̸͒̆̑͋á̻̎(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v19

    invoke-static/range {v19 .. v19}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->k̸̴̢͎̯͉͙̗̔̋͊͗͋a̸̸̸͚̯͚͎̙̱̋͗̌́̅̄̂̌̂̚͠a̹ȃ̵͚̺͚͉̇̆͗͌̚Kỡ̶̶̶̧̨͙͓̻̗̫͚̯̋͐̔̈͠͠ä̛̭̝̰̪̠̋̂͘͜͜l̢̝̠̮̋̈́̐́̍̌̈́͗͝c̱̬̖͗͐̕ờ̸̸̡̛̛̩͈͕͉̩̼̺̺̖̗͎̫̹̫̘̲̋͂̆̋͜o̴͙̬̥͓̹̮͋̍aa̝̠̬̦͗̍̃̏͗̌͂̐͒h̶̼̪̋̎̎̾k͈͜͝P̴̢͎͓̗̫̦̭̖͉̫̗̖̻͋͑̿͑̄̅̅͗͗͒̕͜͜͜͠K̫B̸̸̧̺̲̠̫͎̫̭͙̥̂̌̋̇̅̚̚͘au̶̧̺̦̮̘͚̬̲̾̋̋̉̋͋͒̑̏͐̐́̌̋̚͘̚͝h̸̦̻̰̯͊̽͋͑͑̈͊͝͠h̶̸̢̧̪͕̫̠̙͉̭̊̍̅̆͌͗͌̋̋͌̽͘͠ő̧̻̯͉͘(Ljava/lang/Object;)Landroid/renderscript/RenderScript;

    move-result-object v12

    move-object/from16 v0, v18

    invoke-static {v12, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḣ̸̎K̃̚a̠̭̫̘̰̥͈̓͊͂̽B̶̷̵̵̢̢̛̯̫͓͈̻͈͙̙̫̟̘͕͚̯͙̺͗̾͒̒͋̈̌̔̊̌̏̅͌͑̈́̀͗͋̔͌̎̑͌͘̚͜ͅB̶̰̥̯̮̘̑͗̉̃â̷̧̦͉͚̎̓͌P̸̴̨̛̭͙͎͌̅͘a̷̸̧̻͗a̢̦͎̦͆͌̂̑c͈̈́a̵͎̎͝l̢̥͓͓̮̀͝o͈o̶̸̶̻̝̩̙̲̠̱̖̭̐̾̌̉͋̆̂û̢̞̮̫͈̱̘̼̤̥͕͎̰̊͊̈̎̕ͅto̸̴̧̹͕̙͚͖̺͕͕̼̹͌́̋͌͋̊̈́̋̌̿͆̚͝n̹ǫ̸̨̛̫̭̜̪̭̹̬͓̗̅̌́̐̂͌̇͑̂̈́̂̎͝͠l̵̸̸̶̬̖̠̭̲͓̲̃͗̌͗͂̂̄͗͑͑͌̏͗̕͜͝B̸̩̙̺͕̙̹̋̌̑̂̔̑͌̆͝p̛̺̜̟̫̂͌̊̈́t̸̴̘̗̑͂͗̿̈͑(Ljava/lang/Object;Ljava/lang/Object;)Landroid/renderscript/Allocation;

    move-result-object v8

    move-object/from16 v0, v18

    invoke-static {v12, v0}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ḣ̸̎K̃̚a̠̭̫̘̰̥͈̓͊͂̽B̶̷̵̵̢̢̛̯̫͓͈̻͈͙̙̫̟̘͕͚̯͙̺͗̾͒̒͋̈̌̔̊̌̏̅͌͑̈́̀͗͋̔͌̎̑͌͘̚͜ͅB̶̰̥̯̮̘̑͗̉̃â̷̧̦͉͚̎̓͌P̸̴̨̛̭͙͎͌̅͘a̷̸̧̻͗a̢̦͎̦͆͌̂̑c͈̈́a̵͎̎͝l̢̥͓͓̮̀͝o͈o̶̸̶̻̝̩̙̲̠̱̖̭̐̾̌̉͋̆̂û̢̞̮̫͈̱̘̼̤̥͕͎̰̊͊̈̎̕ͅto̸̴̧̹͕̙͚͖̺͕͕̼̹͌́̋͌͋̊̈́̋̌̿͆̚͝n̹ǫ̸̨̛̫̭̜̪̭̹̬͓̗̅̌́̐̂͌̇͑̂̈́̂̎͝͠l̵̸̸̶̬̖̠̭̲͓̲̃͗̌͗͂̂̄͗͑͑͌̏͗̕͜͝B̸̩̙̺͕̙̹̋̌̑̂̔̑͌̆͝p̛̺̜̟̫̂͌̊̈́t̸̴̘̗̑͂͗̿̈͑(Ljava/lang/Object;Ljava/lang/Object;)Landroid/renderscript/Allocation;

    move-result-object v10

    invoke-static {v12}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̛̤͙̥̐͘k͚̱̦͌͗̂̀͋p̸̺̤̈̿c̸̛̦͎̪̙̫̀͊͐t̷̤̃P̹͈̔̍͠n̷̗̗͈̹̭͜B̴͚̫̋ơ̶̸̸̶̢̫̫̯̖̟̱̻͙͉̗̼̮̙̯̪̭̪͖̲̬̗̩̹̌̾̃͊̇̎̀͌̑̿̎̈́̈́̀̈͑̋̅̈́̋̈́̉̈̽̂̈́̌̈͘͜͝ę̷̺̺̬̦̫̙͎̏̈̇̓͌͌͐͝a̢̧̯̟̻̋o͒̌̾n̦̙̎̔ȟ̴͓̭̱͚͓̖̂͐̌̈́̄͘͝a̧̗̫̙̫͎͗̌̌̍̕K̨̛̙̺̎̎̆͌ac̸̵̦̠͆̋̀̂́ã̸̶̶̢̩͈̦̻̋̑͌̆ͅl̖̄o̤͖̼̻͜͜eţ̴̮̩͉̺͉̫̙̻̱̗̱͕͈̅͌̊̅̈̌̈̀̈́̂͘͘̕͝͝͝hn̶̢͈̠̭͌͜B̧̢̞͓̟͈̥̆̂̃͋̉͌̃͐͂́̚͝n̘a̧͓͐̃͋̃̈́̾̾̅͝(Ljava/lang/Object;)Landroid/renderscript/Element;

    move-result-object v19

    move-object/from16 v0, v19

    invoke-static {v12, v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->P̦̆p̷̶̧̗̠̩̮̫̹̉̏̃̄̎͐͘͘͘͝͝c̸̫̱̭͚̦͕̫̪͈̹̹͋̌̍̂͌͝͝ä̶̴̧̛̭̾̆ơ̱̙̼̰̈͌͐̇̈͠ā̸̛͕̰͕̮̜̘͘a̢͚̹͙̯̐̂̏͒̑ņ̶̱͎̭͎̫͖̭̱̞͑̂͋̑̆̿̎̅͋͋̌͑̈́͜͝͝P̧̝͉̅̏̀̚ę̶̩̇̈́́̀̾ͅö̵̷̶̶̧̧͙̗̦͕̫̼͇̭̗̖̦̠̤̼͉̰̗͇́͐̂̋̀̌̃̌̌̉̑͠͠n͎͉̦̉â̧̲̫̈͝o̸͚̺̎͠o̦ń̷͕̠̥̙̈̐̇͑̈́̓Ko̼͠K̢͓ü̼̈͌͌̕͝͝l̨͕a̴̶̧̛̫̫̐̄̀B̫l͕͋́K̴͓̯̮̫̺̮͎̯͕͚͈͓͎̀̑́̾͌̀̂̈́̎ͅB̶̸̸̨̧̧̖̞̥̮̥̫͖̠͓̱̦̋̋̿͑̋̋͐̃̚͝͝͝͝ͅṱ̙(Ljava/lang/Object;Ljava/lang/Object;)Landroid/renderscript/ScriptIntrinsicBlur;

    move-result-object v13

    move/from16 v0, v25

    int-to-float v0, v0

    move/from16 v19, v0

    move/from16 v0, v19

    invoke-static {v13, v0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ç̵̙̫̠̥̮̎co̷̶̴̴̷̸̸̡̫͕̲͎͚̫͕̰̼̘̰̱͎̭̫̾̔͗͌̀̃̏͌̎̋̈̆̚͜͜͝͝oö̢̫̩̱̌͑̆̚p̶̢̛̙͕̤̈̃̋́̑̀͝a̴̝͐h̶̸̵̸̸̷̨̧̧̢̛̯̮̲̮̗͎̱͇̺̺̫̘̱̫͎̋̑̿̈́͊̉͊̍̾̎͊̔̂̾̈̀͋̾̅̈̌̚͠͝͝ͅͅâ̸̸̷͎͓̫̯͕̻̱̫̦̂̄̄͘̕ͅc͑̂̀Ḃ̸̧̙̺͉̭̹͉͉̯̋͊̂̂̄͝͝n͉͎̮̩̽h̪͑̋͗͌c̸̵̸̢̧̙͙̹͉͓͚̭̘̗̦̹̀͐̌̈͐aç̶̮̩̰͚̗̱̐̐͊̋̌̈́͌͘͜͠o̵̶̦͚̥̭͈̺̻͈̹̾̂̔̈́̑̍̆͗̃̌̽̈́͝ỏ͝͝Ǩ̷̶̷̢̛͓̫̝̼̼̼̗͎̹̲̫̤͈̬̫̱͚̭̈̎͋͋̋̄̐̌͘͘͝͝͠ͅa(Ljava/lang/Object;F)V

    invoke-static {v13, v8}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->k̭̀͋ó̠̪͚̀̆K̵͝Ķ̸̸̴̸̧̧̛̥͚̪͈̗̜͈͚̟̭̠̻̺̻̯́͂̃̊͐͑̀̀̈̄̎̌͌̿̐̀͒͌̌̑́͊̍̚̚͝a͈̥͈̠͓̺̭̋̈͂͆̾͒͗̌̋̚͝a̴̠̠͉̐̔̽̌͗̅̚Ķ̴̢͎̭͚̋̋͑̂̊̋̂̚͘͝ǎ͇̯̭͚̞͗̔͌̓t̶̴̴͖͓̙̟̭͈͇̟̝͆̾̀͠ǎ̶̵̝̖̻̮̹̖́̋̑̿͌͋̋̏̍̃͝͝ờ̯̩͚̃͌a̷̢n̵̶̸̷̖̺͖̫̭̫͎̘̩̦̹͉̹͉̮̩̲͕̞̈͐̉͌͗̾̂͌͗̇̇͒͊̑͐͘͘̕͜͜͝͝͠ń̷̸̵̸̛̪̟̮̼̰̏̋͝ő̸̧̧̹̫̘̗̞͚̘͋͂͌͌̾͌͋͜ͅn͓͌͝ă̷͖̺̦͓͚͖̮̑̄̂̄̈́̅̏͋̚͜ȅpk̶̸͚̺̫͎͗̋́͌̄̌̃̄̊͝(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {v13, v10}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ļ̶̼̗͓̌̑aṵ̢̠̫̥̅̋̌̋̍̍̑͜ö͉͌ǘ̚ơ̧̢̺̹͉̺͚̗̦̯͕̂̄͋͒̀̂̅̋̏̂̾͠͠a̴̡̦̫͎̩̫͚̯͗͗̈́͠B̶̶̰̫̞̫͎̿͌͌̒ủ̶̻̰̂͑͠p͎̻̜͒͐̄̚͜͝͝k̨̥͓̼̿̎̕K̝̪̪̖̫̿͆̓K͋l̞̺̑p̶̴̸̧̡̨͈̝͈̖̞̺̥͕̙͙̎͒̋̎̎͌͗̂̾͗͐̅͂͌̿́̑͠͝͠͝ķ̤̺͉̦̋̈́͜͝a̶̵̢̢̫̯͎͈̫̜̗̘̗̻̰̗͈̥͖̹͈̖͉̗̦̗̘͚̼̘̤͒̓̎͆̾̃̃̔̋̊͑͌͑͑̿̑̍̈͋̚̚͜͜͝B̸̶̶͚͎̫̫̘͈̮̝̌̎̓͗̂̈́͌̌́ḩ̷̵̶̷̸̧̛̛̭̪̭̫̭̥̻̺̭̤̋͌̎̿͗̑͒̂̌͌͗͋͜ô̬̖̅B̷̧̤̘̄͊̾̋͒̈̾͝(Ljava/lang/Object;Ljava/lang/Object;)V

    move-object/from16 v0, v18

    invoke-static {v10, v0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->p̸͖̘̼̮̻̎̀͐̍͒͂̈́͗̚͜ą̴̸̧̛̛̭͙͈̺̫͐̀̈̉̌͗̇̃̂͋̎͝͠nñ̸̻̹̯͖̑͘u̷̶̢̯̱̫̗̮͓͓̭̖̺̮͌͗͊͗͒͆̂̽̚͘͜o͌Ķ̡̘̻̺̜͖̪̗̻̖͚̖̦̦̘̬͕̖̃͒́͐̌̋͒͆͂̐̽͊̌͝͝ṱ̴̵̸̺̗͎̞̐͌͌̎̈̔t͎̺̯̅̓͋P̴̷̮͚̗̗̫͈̭̬̆͗̒̃̚͜͠͝e͈͑̕a̸͈̰̩̬̾͌̊͋̿̀̾͑̕͝͝a͘l̖̉̈́̑̈́̂̈a̧̘̩̘͚̮͉͆̈́̂̋P͌̈t͖ȩ̴̵̧̧̧̰̭̼̪̺̲̻̹̠̮̹͈̫̝͕͎͕̲̰̠̥̺̘̈͌͊̈͋̎̓̈͗͂̈͋̍̀͗̌̅̚̚̚K̤̯̗͗̃͊͘ō̶̻̪̥͋͌̃̂̈̏͜tp̭̲̌c̸̷̸̱̭̫̗̺̄̋͐̈́̋̋̌̂̚̚͜(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {v12}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->h̫̯͚̋̌̃̄ͅa̘̎͜ţ̸͕̘͈͗̃̔͜ȍ̫͘͜c̶͎̼͕̈̑͝ử̶̛̰̙̭̫̱̜̪̒̄͠l̵̢̧̗̥̻͑̎͑̌̚͜͝͠B̢̘͈͉̩͉̈̑̋̍̌̏͗̅͝p͚̦a̹̜̬͈̮̦̯͋̾͗͒͌͗͝n̷̸̢̧̻̈́̾͒̋̌̎́̿͝͠͠o͕̭͜l̋P̱̺̥͌͗͠B̧̢̄͑́͋̚a̧̧͙̪̲̍̉̌̔̾̚͝ő̸̷̡̢̗̹̪̤̙̫̠̬̟̩͗Pk̸̷̵̭͎̜̺̘͓̪̠͌̂̌͐̍͝ț̷̶̗͌ņ̶̢̛̦̺̪͚̤̄̎̀̈́̏̈̋̄̅ť̸̮͉̬̔͌Ḵ̯̻̈́̈͘̕aķ̸̛̛͉̻̹͉̈͗̋͗͑͐̾͝k̶̥̫͉̯̥̒̃͗́̅̿̋̅͗̋̈͋̿͗̊ä̤̯̹̹̦͚́͐͗̂û̍͋ć̥eK̸̛̛̟̫̥̫̭͐̾̈́͋(Ljava/lang/Object;)V

    invoke-static {v4, v14}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->P̶̫̼̮̹̮̏̎̆̈́̃͜K̑l̾k͌k̸͑c͎͋̎͜͝a̗̹̖̝̹̠̹̺̎͗͒̂̋̾̀K̯͌̉͂̈aK̮n̶̶̸̶̸̸̢̧̧̧͖̞̯̠̻̻̮̫͎̖̫͈̹͚͉̲̯̠̥̲͉̰̼̫̂̅̈́͌̈͑̿̾̉̃͌̀͒̆͋̔̃̿̌̍̕͘͜͜͠͠͝h͈͚̩̹̻̥͓́̂̈́͘͜͠͠͝p̶̷̛̥͎̠͕̫̫̻̗̹̼̔͒̂̈́̌͒̏̍̑̽͑͝͝ͅḴ̨̹̻̰̞͐̒̏̋̄̀̈́͋͐͋͘͘k̡͕̗̯̈́̐͝Ķ̭̫̭͉̑̂̚͘ä̶̼̗͈̤̠̦͓̞́̑̿͊̆̌̌͒͝͝ͅP̷̢̭̰̹͉̰͈̭̌͋̈̌͝a̧͌̆ǫ̶̢̛̛̛̭̘̯͚̠͎̱̮̭̥̑̔̉͋͌̈́͐̐̈́̕͠͠͝è̙͈͌K̲̞͝Ǩ̦̂̏͜͝ĉ̛̯͎͕͉̲̦̎͒̃̆̾̋͒̀̋(Ljava/lang/Object;Ljava/lang/Object;)V

    move-object/from16 v0, v18

    invoke-static {v4, v0, v5, v15, v11}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->Ķ̷̶̷͇̺̺̘̯̭̭̗̹̥̭̦̬͎̮̦̤̻̱͈̦̋͌̈́͌̎͋̈̇͌̿̆̚͜͜͝͝͝ț̸͎̺̟̱̬̥̂͑̋͗͑̐͒͑͝͝͝o̴̱̙̫͒̋̿̑͐a̷̵̧̼̙̗̘̼̦̰̙̙͗͋͒̀K̺͇̺͓̪̭̈̈́̓̀̉̏ȅ̶̡̡̨̟̻̠̹͎͎̱͚̋͒͑̓̚͜͜͝ͅK̵̶̸̷̶̡̫̗͉̯͓͇̃̔̒̈͂͘P̷̶̴̧͎̥̰͉̏̊̈́̿̈́̂̅͘͝ͅe̴̬͕͓̰̗̭̼͋͌̂̍̌̚K̸̅h̦͕͜a̢͈̯͚͗͊̂̈͗͠͝l̶̸̡̢̧̫̬͎̘̦̠̦̜̱̱̹̱͓͕̱̯̭̈̿̈̃͋̅͋̾̃́̈̓͗̃̕͘͘̕͜ͅã̸̸̸̢̧̯͚͉̭͈̫̺͖̱̟̺̭͉͎̰̰͙̭̜͕̺͉̯͉͈͈͚̫̆͋͑̑̑͊̋́͋̀̈́̔͂͌̈̆̋̌̿͘͜͝͠͝(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)V

    const/16 v19, 0x0

    const/16 v20, 0x0

    const/16 v21, 0x0

    move/from16 v0, v27

    move/from16 v1, v19

    move/from16 v2, v20

    move/from16 v3, v21

    invoke-static {v4, v0, v1, v2, v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->kt̖̗̔ț͈̥͘͠P̕n͓̄͝a͜P̸̴̧̮͉͌̃̃͝h̸̫͕̐̂͗t͕ā̙̱̫͗̿͠a͓͜ȯ͠P̧a̵̭̐̐͗̇̊͑a̦̯̗̗̤̫̺͆̏͗̚͜͠P̷̷̸̷̵̷̧̛͕͉̗̤͈̫̫̺͚̭̘͈̺̦͈̅̋̎̅̈̌̃̋̃̆̔̈́̏͌̌̈́̈̿̈̏͑̔̅͋̿͌̚̚͠͝͝a̵a̷̧̛̙͇͈͖̺̦̪̗̘̠̤̞̬̭̩͓̟̖͈̗͌̂͌͌́͌̽̓̀͋̋̉̅̈́̃͐̈̈́̾K̵̶̸̵̢̢̢̡̧̧̛͉̺̭̠̱͎͎̦̥͓̰̫͎̯̪̖͎͊̍̂̂͋̌̂͌͘̚͜͝͝p̭̙͝ò͈͉̹͓̠̄͐͜ä̪́̐̚u̗̯ah̸̛̛͉̬̤̭͉͉̬͉̯̱͌͗͆̿̃̐͆̎̔͂͘͝͝o̝͙̎͋͜P̧̛̠̫͓̗̺̠̥̪̯̞̀̄́͒̚͜͜͠͝tt̋(Ljava/lang/Object;IIII)V

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->č̸̵̗̻̗̠̫̯̾̏̂̊̌̋̋͂̃l̨͓͚̪̿̈́̋͐͗̂̄͜ō̸̸̸̢̧̰̥̘̎͐͋̕͠͝͝͠KK̍e̴͉̫͂͐̿̅̈͌͂͜͠t̵̜̺̯͚̙͊̂̋̚͘B̷͈̥̫͊k̝̭̥̪̞̽͋͌̈́̅K̨̭͌̋̈́̄c̸̴̶̛̘͕̖̩̹̺̰̼͉͉̭̱̖̮̦͙̎̂̈͋͗̿̾̅̑̈͌̑̎͌̂͜͝a̛͇͋a̵̸̸̬̺͕̹̿̂͗͗͗̑̂͘n̷̢̫̩͕̩̔̄͑B̩a̧̢̠̱̔̈͌̅̍͐ͅh̡̩̮͗̌͌̂̌P̥͎̝͎̫̞̹̾̍̈̐̂͑͠͝͝ǘ͇̲͈͓̗̄̋̃̈̂͊͝Ḱ̪P̶̧͓̯̫̩̖̫͋͋̃̃̎̋̊͗͘l̷̵͎͚̠̗͚̭̂̂͊̔̚ͅơ͙̈́a̡̛͚̗̫͙͓̾̽̔̈̈́̈́o̵̶͕̭͌̾̉͗ţ̋o̺͚̲̱̫͊͘̚̚()J

    move-result-wide v6

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v35

    const v38, 0x1aae0f

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->n̛̗͊̚͜͜ō̮̪̫̺͗̂ķ̸̸̮̞̮͎̬̜̹͓̉̂̓̑͐͑̂̋̕̚͝k̷̞͘ǫ̶̷̷̧̧̹̙̫̭̞̰͕͙͎͙̙͌̿͗́̈́͌͊̆̋͜͝͝͠͝ͅp̦̱̤͋̓l͎̙͚̋̉͌͘͜p̸͕̫͉̼̫̏̈̚̚to̶̸͐͜t̷͓̩̭̋͒͜͠ȟ̢͙̗̫̺̭͖̝̂̌͂̃́͒̐͝K̶̫͎͕̫̯̥͗́̈̋̌͐͗͜ư̧̧̛̜͎̫͓͓̺̘̫̈̈̑̑̌͆̌̏̈́̎̚͘ȗ͜͝ç̶̶̶̨̙̭̖͒̃̈́̔͐̚͝a̡̺͓̹̐̌Kop̵̨͓̺̘͇̽̎̔̚ao̧̺̰͗̀̔͝Ķ̞̭̯̖̯͆̌̒̈́̇̉̌̂͠u͝o̺̭eĶ͚̯͗̋͝͝K̷̈͝B̸̶̛̫̙̝̱̹̱̼̘̱̻͊̍̍̃͝e̢͗͒̀͌̾͗͜Ķ̛͚̼̀̽̃nà̭͓̄()Ljava/lang/String;

    move-result-object v34

    invoke-static/range {v34 .. v34}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v34

    xor-int v38, v38, v34

    const v36, 0x1ac954

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̶̺͈̘͌͌̑͠K̴̸̸̷̮̗͕̱̤͚̺̀̈̅̋̎͂̿͋̈́̚K͜ą̶̸̛͉͖̪̮͚̺̰̫̭͓̫͎͈͚̹̈̋̀̌̿͐̂̚͘̚͠͝͠a̸̴̸̷̸̡̛̛͉͙͙̻̤̻̫̦̻̋́̀̈́͐̅̀́̀̅̈́͐̌̿̊̈́̎͋͋͘͘͜͜͝͠͝a̷̶̶̧̧̧̧̛̬̘̱̫͈̘̗͉̺̹̯̯̰̪̘͑̌̋̌͊̂̀̌̄̂̈́͌̋͌͑̈́̎͂̎͌͘͝͝͝͝ͅB͎̩̺͉̌͒̋̌̾̌͋͜͜n͕̦͗̈͗̎͑̌͝t̛͚͓̪̼̫̫͓͎͉̐̍̈̽̈́̅̍̈́̃͊̍͘̚ę̸̫̭̦̈̾c̰͎̅̐̇͘͠ą̸̮͕̠̻͑̓̌̑͂͌͗͌̈́̚ḧ̞́͋h̶̸̯̦͈̃̐̈̈́̌̀͜K̴̨̛̛̥̤͙̱͉̭̄̇̂̓́͊̅͠K̛̪͈͕͜p̶̛̮̄͌h̛̛̦̘̼͉͂̃̋͑()Ljava/lang/String;

    move-result-object v34

    invoke-static/range {v34 .. v34}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v34

    xor-int v36, v36, v34

    const v37, 0xdc14

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ĥ̶̠̰̌̈́̒̃́a̷̭̦̲̯͎̭͚̫̩̬̙͉̦͌̎̔͗̋̋̌͗̈̅̌̈͘͘͜͝ţ̭͐̑̋͌́͠K̨̢͚͓̯̿̔͗͊̃̑̾̚͝͝͝P͎̎B̯͋͂̑e̗ä̸̧͕͙́͝ȃ̹̫̾̑̄͌͘h̢̧̨̛͚̤̭͚͉̠̱͌͒́̈́̋̾͑̍̏͠͝a̴̢̽̔p̸̘̬o̎an̵̢̧̛̖̮̭̯͎̭̫͙̤̦͇̻̈́̀̅͂̔́͌͗̌͌̔͂̈̋͘ͅc̴̸̸̩̯̮̖̤̀̋̚K̷̙͌͘k̢̨̖͉̠̝͓̲͂̌̋̈̌͌̑͠͝ḧ̴̟̲͓̯̪́̑̆͊̀͘ṱ̭̖͚̼̄̈̈̌̂̈́̀̒͌͂̾̋͒c̹͉̰͊͑̋õ̶̞͗͐͜Ḱ͈̻̠̯̩͑̎̎̈́P̩̺̦͕͌̈͗ȏ̫ë̶̅ḩ̶̦̥̝̓ẗ̸̙̙͎̿̌̃̏͊̑̚l͜u̠͙̪P̧͙͓̌̀()Ljava/lang/String;

    move-result-object v34

    invoke-static/range {v34 .. v34}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v34

    xor-int v37, v37, v34

    invoke-static/range {v35 .. v38}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v35

    move-object/from16 v19, v35

    new-instance v20, Ljava/lang/StringBuilder;

    invoke-direct/range {v20 .. v20}, Ljava/lang/StringBuilder;-><init>()V

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v59

    const v62, 0x1acea2

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ȏ͒̾̔͜͜͝ļ̶̴̧̧̧̫͉̤͉̫̪͂̃̈͌̐͌͑̄͆͗̋͐̇͌͋͘n̫̹͓̤̦̭̬̥͚̫̗̫͌̋̈́́̃̍̍ẗ̶͎́̌̋͝K͂̒ą̻̮̻̤̦͊̄̒̑̈́̂̏̃a͘aỏ̭̏p̷̴̸̶̨̡̧̛͙͙͈̦̠͂̈̈́͋̿́̿̂̒̾͜͜͜͝͝p̂̚a̛̪̎̈B̸̵̷̴̧̧̛͓͙̲̫͈͓͎̖̞̟̯̯̙̗̰̦͎̀́̆͗͂̏͊̐̌̄̽͑̃̽̽̀͋̿͌͊͒̌͂̚͘͜ͅĺ̹k̸͎̖̥͚̰̽n̸͉̮̭̭̻͚͂̈͐̌̅̋̂͗̚B̭K̶̜k̶̺̺͓̤̗͙̼̘̻̙̱̗͗͌̈̂̽͂͌̋̏ͅã̸̷̙̱̙͓͈̱͓̃̈̓̆͒̈̍͋̚t͗a̴͌P̃ȃ̢̼͕́̑̉l̾ǩ̗̏u̷̸̴̷̧̯̞̯̯̽͆̈́́̈́̂̈̄͜͜B͚̯̌()Ljava/lang/String;

    move-result-object v58

    invoke-static/range {v58 .. v58}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v58

    xor-int v62, v62, v58

    const v60, 0x1ab629

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->K͝h̶͗ḁ̸̶̷̸̝̭̪͈͕̠̹̭̗͚̃̂̈́͐̈́̈́̈́͂͑̌͌͜ư̝̹̜̖̫̪̿͗̈́Ķ̷̸͚̦̮͚͓͚̼̘̮͗̌̂͆͐̾̂̀̓͜͝͝oK̸͓̹̰͓̮̝͓͚̗͈̭̺̞̹͎͈̲̯̙̦̈́̏́̈̄̄̋̎̒̅͌͌̔̉̽͒̃͝K͂n̢̗͗̑k̶̭̺Kn̶̡̲͋̅̐̿̌̔̇̿c̵̘̺̔a̸̸̤̘͙̪̪͎͗̍̽̂̐̋̈́̚ã̭̙̭̲̱̒͑̌̿͋̇͌̂͆̌̑͜͠ã̷̵̗̥̟͇̖̫͖̪̮̠̯̬͚̼̐̄̈́̂͌͊̎̔̃̋̂͜͝P̧͚͈͖̭̘̞̪̙̦̈́͗̂̂̎͒̂͑͆͋̅͝e̴̢̫å̼̌͐͘P̸̴t̵̵̸̷̢̛͈̜͎͖̙̫̭͉̭̭̞̂̅̅́͗̈͑͂̀̅̋̌̈́͐̃̾͌̂̋̚͜͜͠͝Kp̸̢̧͕̘̮̫̝͋̈̅p̮()Ljava/lang/String;

    move-result-object v58

    invoke-static/range {v58 .. v58}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v58

    xor-int v60, v60, v58

    const v61, 0xdc47

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->a̶K̫͊̐̈́̈̋k̫̱͎͓͚̟̝̇̐͊͝P̷̴̵̸̡̢͇̤̫͈̯̮͕̻̥̯͓͕̗͈͓͌̾̋̑̂̎̾̂̂̑̃̆̈́̐̚̚͘͜͝͝͝ͅl̛͌̄̋ḩ̶̸̶̧̛͙̞̞̗̺̬̹̱̎̈́̾̑̑̋̂͜͝͝o͐̋â̶͈͈̞͓̥̝͙̙̻̬̥̹̈̽͌̾̂͘͜͜͝ã̴p͈̈́a̵̡̨͈͓̭̠̯̟͕̲̪̬͐͐̀̅͌̎͒̀͊̄̌̏͑̈̚ṗ͙̯͎̫aĶ͚̌̋̌͌̍͝Ḵ̡̝͚̅n̷̢̲͚̮̾̽̃̌͑ä̵̢̛̙͈̹̪̺̱́́̀̾͝K̸̷̵̸̷̷̡̛̛̛̛̺̻̱͈͎̦̺͓̗̪̘͈̺̖͚͓̮̪͈̠̯̬͗̋̾̎̑̌́̏̔͊͌̔̎͋̇̓̌͂̃̓͗̂̎͘̚͘͜͠͝k̨̛̮͕̖̯̂̌̈́̈͋͌̌͒͗̎̃͝ač̢̖̰̋͘c̹̪̆̚()Ljava/lang/String;

    move-result-object v58

    invoke-static/range {v58 .. v58}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v58

    xor-int v61, v61, v58

    invoke-static/range {v59 .. v62}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v59

    move-object/from16 v21, v59

    invoke-static/range {v20 .. v21}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v20

    sub-long v21, v6, v16

    invoke-static/range {v21 .. v22}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->K̷̨͙̭̯̝͕̥̅̑̂̌͝t̃̑͜t̷̴̸̨̻̗̝͕̼͖̫͐́̃̑̉̈́̀a̹̘̮̾͌c̻̫̲̉̄̂͝͝k̛͚͕̏̾̍͐ea̴̻̱̬̻̱̗̾̑t̬͗̎̈́̚͝͝t̵̥̎h̵͙͒̚͜h̯̆͘̚͝ć͜͠oc̸̛͈̫̮͉̼͆̈̎̍̀͘K̢̨̠̹͚̥͈͂̓͌͗̀̌̽͗͑͘͠ͅk̸̨͖̺̈͌̅̌́͘͝kk̢͈̞̋͘B̷̗͑̃o̺͈̹͊l̴͉̖͚͠h̸̸̴̡̧̢̰̫̠̭͚̘͕̻̗̼̯̩̤̟̲͋̎̈̑̎͌̍̂̇͌̑̽̌͗͆̂̕̕͜͝͠͝P̸̤̈̒̔͗͂͌nḩa̷̧̪̲̪̺͓̭͌̈́̆͜k̵̸̢̨̧̛̝̩̮̱̪͈̯͉̙̻̲̦̺̦͕͎̯̹̩̈͒͗̐̇̍̿̌͋͑̈́̑̌̊͗͌͗͒̌͘͜n̥͚B̷̨̩̠͆̿̐̐̐̀ͅ(J)Ljava/lang/String;

    move-result-object v21

    invoke-static/range {v20 .. v21}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v20

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v52

    const v55, 0x1aaece

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->hB̸̷̸̶̨̧̢̛̛̛̹͕̩͙̭͉̫̺̖̗̘͎̼̜̻͕̠̺̫̥̟̭̺̲̠̗̙͊͒̔̃͋̂̀͋͌̃̈́̂̄̑̂̂̌̈́͋̍̇̋͌͜͝u͉K̸̢̧̛̭̲̝̮̱̦̾̎͐̊̆̌̊̈́͒̿͗̎̚͝ū̷̸̶̢̢̲̮̮̹͙͙͈͓̖̯̙̪̗̑̾̎̈́̾̃́͂̌͗͐̆̄͗͗͜͝P̫a̸͜n̷̯̗̖͉̭͓͈͎͑̂̄̅̈̈̓͌͝k͕̫̺̈́̿̆P̶̷̶̶̢̧͕̞̺̘̖̺͉͈͖̪͋̅̂͗̃̿̐̒̾̈̌͒͂̂̈̈́̚͝͝͝n̷̨̡̼̮̗̫̫͎̒̈́͌̌͌̾̊̋̃̿͜͜u͈͎̎̐a͎̤͎͗̃̋̋a̴̴̷̸̸̸̢̨̢̛̛̖̼̱̺̺̭͓̼͕̻͚̗̤̺̹͉͙̩̠̿̂̅͗̋̅̋̂̄͒̐̃͐̃͌̑̅̄͂͂̎̌̿̅̅̀̀̿͋̂̚͘͜͜͝a̅͌()Ljava/lang/String;

    move-result-object v51

    invoke-static/range {v51 .. v51}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v51

    xor-int v55, v55, v51

    const v53, 0xdc19

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ẗ̶̸̷̴̶̸̸̸̴̨̧̛̛̗̦͙̦͎̱̤̯̝͚̫͓̮̟̫̺̯̜̦̗́̌̅͗̑̽͋͌̌̿̄̒̐̌̋̋̾̌͊̈̏͋̚̕̚͜͜͝͝͝͝ͅe̡͉̘̺̱̻͂̌̈̈͌̅͜͝a͋ņ̥͙̺̏a̸̶̷̧̨̡̛̻̞̥͉͉̝͖̹̫̯̤̯̟͗͌͗͆̋̈̿͗͐͌͋̈̍̈̎̈́͌̌̉̓̈̚͘͜͜͝͝ȧ̸̷̸̧̛͓̞͓͎̰̻͖͕̈́͗͊̑͌̉͝͝ñ̷̸̶̸̷̷̨̧̡͉͓͎͈̫̺̖̘̫̘̯͈͎̗̯͈̯̦͚̭̙̞͈̉͐́̇͐̎͊̿̀̔͌͌̍́͗͑͑́̈̋̆͌̈́̎͌̌͘͘̕͜͝͝͝͝͝ơ̶̧̧̛͎̭̼̱̭̮̞̘̏͒͌̅͗̆̿̅̌͑̑u̶̢̧͈̹͈͈͎̅͝ţ̷̷̛͖̥̫͉̟͗̄͋̾̏͗à̬̮͙oȃ̮̗͌̀̂ḁ̫̉̿̃()Ljava/lang/String;

    move-result-object v51

    invoke-static/range {v51 .. v51}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v51

    xor-int v53, v53, v51

    const v54, 0x1abdeb

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->nB̷ǎ̷̵̷̧̲̼̰̮̹̹͉͇͎̻̮̞̗̻̎̄́́̈̽̏̉̾̔ô̵͕͌̑͜l̦̭̆̑̌á̷̞̮͙̮̱̭̯͕̟̎̀͗̂̒̋͜͝͠͠ā͉͈̱̫̖̑͂̓̋͗hh̷̢̘̪͈̘͈̫͐̈́̌̽̌̈́͜͝Kh͎̋̈͝ca̶͉̙͙̭̠̥͕̭͕͈̔̏̋̌̚͜͠ĉ̵͚͘ǒ̷̶̙̙͓ȩ̶̫͉̺̭͓̰̞̭̝̗̀̈͗̍̎̋̂̕͜͠k̥̱̽̌̈́̂B̧̺̫̻͈̋̌͗̓̒̂̏̈́͜o̲̫̱̔́̄̂̏̈́̈ą̴̴̴̸̛͉̯̖̪̫̼͚̩̫̗̙̫͙̦̰̘̙͎̘͓̫̫̻̎̑͗̏̋̈́̈̌̌͌͐͆͂͐̔͑̈́̐̐͘͘͘͜͜͠͝tṱ̷̷̫̮̏p̦̗̖̭̑̆̏̃͗K̶̛̰̮̲̩̭̭̯͈̝͈͌̂̽̄̈͜͠B̶̶̭̋p̴̴̔͒͗͌̽͝()Ljava/lang/String;

    move-result-object v51

    invoke-static/range {v51 .. v51}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v51

    xor-int v54, v54, v51

    invoke-static/range {v52 .. v55}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v52

    move-object/from16 v21, v52

    invoke-static/range {v20 .. v21}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;

    move-result-object v20

    invoke-static/range {v20 .. v20}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ae̮͚͚̭̰͐̔̋ņ̮̝̱̲̫͈̈́͗̅K̮̗̭͒͌̎̋ȃ̧̛̺͚̩̮͓͙͇͚̦̇̀͒͆͜͝K̸̸̸̨̹̗̯̭͎̫̞̗̼̅̏͌̇̈́͋͗͆͗̈́͑̇̒̈͘̕͝͝͠p̷̷̵̸̢̢̠̹̘͉̈̈́̏̿̃̎̀̿̆͘ẗ̸̛̫́͋͑̑p̧̢̖̮͗̆ãPk̵̸̞͉̗̗͉͚̥͕̲͚̼͕̪̗͈̃̿̋̾̂͂̎̈̿̾̃́͐̑̿̀̀̋̂̅̐̂̂̈́̎̂̑͗̊̋́̚͜͜͝͝͝͠k̿͜ṯ̪̫̄̈́̚l̯̆́͠l̸̲̂͑̄͗́o̧B̫͚͌̂̑͋̚ä̹B̗͚̤̘̂͊̂̿͋̋͝K͚̋a̸̷̵͚̞̺̘͙̭̤̺͒̈͆̋̾͑͠a̸̧̛̘̹͈̱̠̍͌̌BK̶͋e̱ę̸̛̛̫̘̥͚̫͗̒̓̌͗̂̈́͝͝ḩ̵̸̧͎͚͎͇̯̌͐̑̔̌͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v20

    return-object v14
.end method

.method public setAlpha(I)V
    .registers 53

    move/from16 v1, p1

    move-object/from16 v0, p0

    sput v1, Lcom/kashi/settings/view/BlurBackgroundImageView;->ALPHA:I

    return-void
.end method

.method public setBlurImageBitmap(Landroid/graphics/Bitmap;)V
    .registers 56

    move-object/from16 v4, p1

    move-object/from16 v3, p0

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ǔ͕̆̋c̢̰̅̂̒̈́ḙ̴̢̰̮̺̥̰̞̠͕̾̑͜ͅa̺͙̖̋̆̋̒̏͝ȏ̸̪̩͗́̂̏B̷̧̫̹̅̎h̀̌̄ơ̡̞̱̹̺̬̋̅͘͝ͅo̗̓̃̌̎͘͜h͉ņ̷̸̛͓̪̗̯̤̎͆̂͌̎̌̂̃̒̚͘͜͜B̢̾̂k͕̹̫̈́̌̃͜B̋h̸̶̸̢̧͈͇̗̫̘̥͌̆̌͆́̑́̉̀͌̈̍͘͘͜͝p͉͇̩̕͝a̫̚ç̱͉͗̈Ḵ̷̵̶̷͎͉̟̯͉̥̮̼͚̭̎̑̑͗̐̏̊͌̿̈̍̌͝e̯̮̠ầ̶̸̷̴̢̡̫̖̠̖̗̱̻̯͇͑͗̉̏͗̐͝K͝a̧̻̼̗̥͝K͕̘͙͘ͅp̵̶̶̴̶̧̨̭̦̩̫͎̦̼̰̺̤̮̆̃̀̅̀̎̾͐̈́́̾̇͂̑̎̆̑̃̃͘͜͜͜͝ṵ̷̙̻͈̫͓̅͋͗͜a̢̢̫̿̂̄̿̀̋͝()I

    move-result v0

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->a̎a̞̜̠̿̋̾ơ̵̧̧̪̞͉̦͚̩̮̫͉̤̾̃͌̅̌̉̈͆̈́̂͝ͅĶ̷̴̷̮͈̱̫̥̯̙̤̯̮͕͉̺̈́̌̿̑̈́̉̂͋̍̆̔̚͘͝͝t̺̀p̗e̸̷̶̢̡̫̦̤̦̖̘̫͋̋̿́̄͊̀͋̾͠h̷̴̯͈̫̖́̎̂̌͑̋̍͘ṏ̗Ķ̸̸̸͚̱̻͑̄͝a̧̮̲̰̎͌͐͑cć̢̪̹Ķ̸̸̸̛͙͓͓̫̗͎̘̫̭̅͋͐͌̄̍̌̏̓̽̌͜͝͠͝ļ̵̸̨̧̫͈͈̼͖̰̭̯̘͈̺̫̝̺̥͓̘̯̈̑͌͋͌̈́́̂̈̈́̽͂̑́̐̌̈̾͐͒͒͘͘͜͜͜͠ĉ̴̴̸̢̨͚̫̭͉̱̥͙̱̫̙͎̪́̀̾͌̂̂̔̃͜͜á̴̗͕ķ̶̸̴͚̦̥̯̰̖̫̅̎̒̌͑͊͊͝h͗͝K̗̲͋́͗p͎̹͌͑͗̂̈́̑̀̈́ṱ̴()F

    move-result v1

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->B̲ļ̢̨̧̱̘͙͉̗͉̈̏̆͝B̸̶̨̧̲̭͚͈̺̔͠ḩ̸̶̨͉̭̥͚͉̂͒̎̈̈à͠h̴̛͉̲̖͚͉̑̅̄̐͌͗̋̏̋͜͜Pč̞̺̤̯̱̘͚͋̔̈̂̌n̪̦͈͝ȃ̸͙̰̭̤̖̤̲̂̃ĥ̗p̴̢̨̛̛̤̼̯͕̼̫͙̯̱̘̹̥̗̆̄̐̑͌̅̎̈́̈́͐͌̋͊̏̇̾̚͘͜͜͜͝lü̧̈́̾ţ̷̸̶̷͙̜̹̟̺̍̄̾̒o̷̹̕Ḇ̸̴̧̛̮͎̯͓̦̙̩̲͚̼̑̋̆̄̌̎̌̆̿̆͘͝͝á̶̴̵̧̧̡̫̮̻̤̭̭͎̠̋̃̒̏͗̎̌͝e̶̸̷̵̶͉̦̯͈͉͕͓̰̰͚̋̎̑̅̄͑̌͂͑̃̊͂̌̅̋̃͘͜͠ͅa̷̶̧̨̯͓̘̲̙̜̫̻͕̭̫̰̥̘͎̖͐̅͌̈͆̔͌̋͗̐͆͗̉̑̌͜͜͜͝͠͝P̾()I

    move-result v2

    invoke-static {v3, v4, v0, v1, v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->P̶̞̖̏K̫̗̑̆̋ä̴̸̧̫̪̗̭̹̺̫͓̔̎̆͊̄͂̅̂̄̃͝ẵ̶̘͈̖̙͋̃͘͠ç̵̴̴̧̧̧͎͓͚̰̗͉͕̘̭̼̦̞̹͎͓͈̗̈́̀́̀́̔̌͋̄̑͐͌̌͐͑͜͜͝K̇̐͌͝ç̵̷̸̧̛̩͓͚̭͂͑̀̌̾̌̏̿̄P̷̵̶̸̶̢̛̛̫̪̯̥̦̪̭̺̠̞̖̰͎̜͚̫̏̾̌͋͋̿̿̐͗͋̌͗́̌̔̂͋͌͗̕͜͜͠͝K̺̦̦̕ͅh̨̧̪͊͆͋ḁ̵̸̡̛̛̙̦̻͗͌̎̌̿͒B̧̧͈͚̺͖̄̊̃͊̔͜K̸̟͙̂̾̌̅ḛ̶̈́̔͊̚̚a̋ṕ̴̵̢̜̯̺̿̑̃̚͘͜͝ot̷͕͚̰̲͓̠̹͐̈́̅͗̋͋͝ǔ̵̷̢̫̼̥͚̎̈ka̧̘̰̫̫̩̻̥̮̰̫̋̈̌͐̈̃̈́͌̎͌͋͝c̰̥̈́K̨̃(Ljava/lang/Object;Ljava/lang/Object;IFI)V

    return-void
.end method

.method public setBlurImageBitmap(Landroid/graphics/Bitmap;IFI)V
    .registers 62

    move/from16 v10, p4

    move/from16 v9, p3

    move/from16 v8, p2

    move-object/from16 v7, p1

    move-object/from16 v6, p0

    invoke-static {v6}, Lcom/kashi/settings/view/BlurBackgroundImageView;->t̴̢̛̛̲̤̰̖͉̂̔̾̋͋̋̆͑͘c̨̜͑la̶̷̦͎͋̌̿k̟̪͙͒̆̅̄̑͠͝h̵͚͊̀͑̍͝a̲̭o̶͉̩͎͜P̷͂̑͜l͉̭h̸̸̶̷̸̸̶̸̵̨̢̛̫̦̜̖̫̤̗̹͚̹̞̲̯̯͚͎̠͚̯̰͎͈͚̭̘̩̻̻͇̯̥͚̖̗̯̝̜̱̺̘̯̖̑̓͗̎̎̃̍̇̈́̋̀̃̏̉̑̈͂̃̃̂͑̋̎̒̌͆̈́̏̍̈̂̆̑́́͌̌́̿̏̈̈̈́͋̎̈́̏̉̈̂̀̈́̀͑̔̃̈́̏͌͜͜͜͜͜͝͝͠͝aţ̸͕̭̫̫͚̬̃̿̽̑u̺͚͖͋̂̑̋o̷̍͐͗͋ť̴̷̸̰̻̬̺̫̜͇̺͌̚͠ķ̧̧̫̟̭̤͈̺͇̺͚̈́̀̌̃̍̓̎̑͌̋̅͂̌͘̕K̛̿̂̿ae̵͎͕̎̍͋B͓̭̮̊͗͒͝u̘̭k̫̼P̶̢̗̮̜̆̈́̈́͝(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v1

    move-object v0, v6

    move-object v2, v7

    move v3, v8

    move v4, v9

    move v5, v10

    invoke-static/range {v0 .. v5}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̴̵̵̧̢̺̹̮͎͋̏̾͑̈́͌͐̔̔̂͒̈̋͠͝P̫u͜B̠̊͗͜K̸̸̛̮̞̱͚͚̱̇̈́̋͌̎̾͌̊̋͘͘̚͜͠͝â̧̼̱̪̒̉͝ǒ̶͈̗͖͘͝ȧ͝t̫ą̧̧̺̦̫͓̭̮̱̦̰͎̦̋̆̎̋̎̃̈̈̈̏͒͜͜͝ͅͅaķ̸̶̶͉̥͓̫̘́͒̉̐̏̍̋͝͝a̸͕̫͉̺̎̍̂͐͌͝K̯͉̑͗͌̃̌h̶̯̹͕p̮͙͈̗̂̍̀͘a̤̫͐͗o̸̷̧͈̹͉̱̗̱̱͕͚̎̈̂̈́̋͗̐̚͘̚͜͝ą̵̵̫͉͉̞͓̩̻̦̫͗̄͌̌̿̂̆̾̈́͐̚͝ͅͅKaḩ̴̴̶̢͉̠̂̿̄͌͘͜h̖̗̿̈ną̸̺̰͈̔͌̐ḁ̸̸͗̃͐ç̷̧̛̺̭̬̱̹̜̑̋͗̿͑̚͠a̴͒a̭̓̈́̐ǎ̴̵̫̯̻̤̂̔̀͜͝(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;IFI)Landroid/graphics/Bitmap;

    move-result-object v0

    invoke-static {v6, v0}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ãph̻͉̯̎̾t̸̸̯̫̋a̦̺͑̈̽̂Ǩ̤̫̈́̎h͎n̴̨͉̦̗̪͈̖͚̻͈̅̈̈̄͂̀̄̀̑̌̋̔̚̕͝͝nờ̧͚̫̪̗̄͋̃̌̾B̧̘̹̌͂͊̽͘͝͝h̴̲͓͝o̵̱͒̑̃a̷̷̧͓̫͈̫͖͚͐̾̌̑̃B̸̸̴̡̦̝̰̤͓̮̪͕̼̞̻̖̘̲͚̩̺͙̗͈̮̘̻̑̓̃̋̌͐͐̈̃̉̌̄̌̋̌̅̽̈́̓̌̈́͗̉̓̚̚͝p̸̧̧̠͚̥̺̑̾͑͝ǘ̷̵̵̴̺̫̪̜͚̫̥͆̎̎̿̆͌̽̑̍͌̚͜͜ḩ̷̸̺̭̩̘͒̅̂̋̓̂̍͜͝o̠̘̦̦͓͌̈͆̿́͐͐̋̎̂͝a̸̧̧̢̺͚̺͋̿̋̀̎͒͋̂͠ͅp̛̙̈̌t̸̴̶̷̴̶̺̰̱̱͖̙̦̃̈́̈̑̎e͗P̸̶̵̢͇̦̼͎͓̯̤͙̗̌͗̑͑̅̅(Ljava/lang/Object;Ljava/lang/Object;)V

    return-void
.end method

.method public setBlurImageDrawable(Landroid/graphics/drawable/Drawable;)V
    .registers 57

    move-object/from16 v5, p1

    move-object/from16 v4, p0

    check-cast v5, Landroid/graphics/drawable/BitmapDrawable;

    invoke-static {v5}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->l̯͌ơ̩̫͎̌͌̂̈́̊̄̈́á̶̖̱̤̩͚͉͈̦̫̈́̂͗̂̆́̍̐͑̂̕͝k̵̶̭̹̎̽ņ̃͝K̯͕͘ầ̶̵̶̯̥̮̫͙̭͙̝̻̘̥̫̯̩̔̔̐́͌̉̆͊̋̚l͓̈́ç̷̙̪̙̙̻̼̮͕̈́̿͗̔̿͐̄p̷̴̸̢̹̯̪̦͈̘͓͕̫̏͂̂̄̆͘͝͝n̐̚Ķ̢̰͈͓̦̤̃̂̈̂̉͆̏̏ǒ̴̸̸̧̢̢̻̻͕̙̘̺̭͓̦̖̠̱̯͌̈́̑̂͗͗͆̏̈̐̂̈̐̄̂̑̾̂͝l͓͊h͎͓̑̂͋͜K̷̸̸̸̸͖̖̯͓̺͈̥̰͈̻̀̇͋̑̎́̈̂͒̏̆̂͌͘͝͝P̴p̱͙͗͌K͚̰ţ̵̏͗ĺ̸ő̶̧̖̻̙̘̆́̈́͌͌̿́͝k̨̍a̶̧̧̧̘̤͎̬̥͒͌̏̋̌̔̍c̫̺̋͘͜u̷̟͈͊oa̧̭̜͜u(Ljava/lang/Object;)Landroid/graphics/Bitmap;

    move-result-object v0

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ǔ͕̆̋c̢̰̅̂̒̈́ḙ̴̢̰̮̺̥̰̞̠͕̾̑͜ͅa̺͙̖̋̆̋̒̏͝ȏ̸̪̩͗́̂̏B̷̧̫̹̅̎h̀̌̄ơ̡̞̱̹̺̬̋̅͘͝ͅo̗̓̃̌̎͘͜h͉ņ̷̸̛͓̪̗̯̤̎͆̂͌̎̌̂̃̒̚͘͜͜B̢̾̂k͕̹̫̈́̌̃͜B̋h̸̶̸̢̧͈͇̗̫̘̥͌̆̌͆́̑́̉̀͌̈̍͘͘͜͝p͉͇̩̕͝a̫̚ç̱͉͗̈Ḵ̷̵̶̷͎͉̟̯͉̥̮̼͚̭̎̑̑͗̐̏̊͌̿̈̍̌͝e̯̮̠ầ̶̸̷̴̢̡̫̖̠̖̗̱̻̯͇͑͗̉̏͗̐͝K͝a̧̻̼̗̥͝K͕̘͙͘ͅp̵̶̶̴̶̧̨̭̦̩̫͎̦̼̰̺̤̮̆̃̀̅̀̎̾͐̈́́̾̇͂̑̎̆̑̃̃͘͜͜͜͝ṵ̷̙̻͈̫͓̅͋͗͜a̢̢̫̿̂̄̿̀̋͝()I

    move-result v1

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->a̎a̞̜̠̿̋̾ơ̵̧̧̪̞͉̦͚̩̮̫͉̤̾̃͌̅̌̉̈͆̈́̂͝ͅĶ̷̴̷̮͈̱̫̥̯̙̤̯̮͕͉̺̈́̌̿̑̈́̉̂͋̍̆̔̚͘͝͝t̺̀p̗e̸̷̶̢̡̫̦̤̦̖̘̫͋̋̿́̄͊̀͋̾͠h̷̴̯͈̫̖́̎̂̌͑̋̍͘ṏ̗Ķ̸̸̸͚̱̻͑̄͝a̧̮̲̰̎͌͐͑cć̢̪̹Ķ̸̸̸̛͙͓͓̫̗͎̘̫̭̅͋͐͌̄̍̌̏̓̽̌͜͝͠͝ļ̵̸̨̧̫͈͈̼͖̰̭̯̘͈̺̫̝̺̥͓̘̯̈̑͌͋͌̈́́̂̈̈́̽͂̑́̐̌̈̾͐͒͒͘͘͜͜͜͠ĉ̴̴̸̢̨͚̫̭͉̱̥͙̱̫̙͎̪́̀̾͌̂̂̔̃͜͜á̴̗͕ķ̶̸̴͚̦̥̯̰̖̫̅̎̒̌͑͊͊͝h͗͝K̗̲͋́͗p͎̹͌͑͗̂̈́̑̀̈́ṱ̴()F

    move-result v2

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->B̲ļ̢̨̧̱̘͙͉̗͉̈̏̆͝B̸̶̨̧̲̭͚͈̺̔͠ḩ̸̶̨͉̭̥͚͉̂͒̎̈̈à͠h̴̛͉̲̖͚͉̑̅̄̐͌͗̋̏̋͜͜Pč̞̺̤̯̱̘͚͋̔̈̂̌n̪̦͈͝ȃ̸͙̰̭̤̖̤̲̂̃ĥ̗p̴̢̨̛̛̤̼̯͕̼̫͙̯̱̘̹̥̗̆̄̐̑͌̅̎̈́̈́͐͌̋͊̏̇̾̚͘͜͜͜͝lü̧̈́̾ţ̷̸̶̷͙̜̹̟̺̍̄̾̒o̷̹̕Ḇ̸̴̧̛̮͎̯͓̦̙̩̲͚̼̑̋̆̄̌̎̌̆̿̆͘͝͝á̶̴̵̧̧̡̫̮̻̤̭̭͎̠̋̃̒̏͗̎̌͝e̶̸̷̵̶͉̦̯͈͉͕͓̰̰͚̋̎̑̅̄͑̌͂͑̃̊͂̌̅̋̃͘͜͠ͅa̷̶̧̨̯͓̘̲̙̜̫̻͕̭̫̰̥̘͎̖͐̅͌̈͆̔͌̋͗̐͆͗̉̑̌͜͜͜͝͠͝P̾()I

    move-result v3

    invoke-static {v4, v0, v1, v2, v3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->P̶̞̖̏K̫̗̑̆̋ä̴̸̧̫̪̗̭̹̺̫͓̔̎̆͊̄͂̅̂̄̃͝ẵ̶̘͈̖̙͋̃͘͠ç̵̴̴̧̧̧͎͓͚̰̗͉͕̘̭̼̦̞̹͎͓͈̗̈́̀́̀́̔̌͋̄̑͐͌̌͐͑͜͜͝K̇̐͌͝ç̵̷̸̧̛̩͓͚̭͂͑̀̌̾̌̏̿̄P̷̵̶̸̶̢̛̛̫̪̯̥̦̪̭̺̠̞̖̰͎̜͚̫̏̾̌͋͋̿̿̐͗͋̌͗́̌̔̂͋͌͗̕͜͜͠͝K̺̦̦̕ͅh̨̧̪͊͆͋ḁ̵̸̡̛̛̙̦̻͗͌̎̌̿͒B̧̧͈͚̺͖̄̊̃͊̔͜K̸̟͙̂̾̌̅ḛ̶̈́̔͊̚̚a̋ṕ̴̵̢̜̯̺̿̑̃̚͘͜͝ot̷͕͚̰̲͓̠̹͐̈́̅͗̋͋͝ǔ̵̷̢̫̼̥͚̎̈ka̧̘̰̫̫̩̻̥̮̰̫̋̈̌͐̈̃̈́͌̎͌͋͝c̰̥̈́K̨̃(Ljava/lang/Object;Ljava/lang/Object;IFI)V

    return-void
.end method

.method public setBlurImageDrawable(Landroid/graphics/drawable/Drawable;IFI)V
    .registers 58

    move/from16 v6, p4

    move/from16 v5, p3

    move/from16 v4, p2

    move-object/from16 v3, p1

    move-object/from16 v2, p0

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v20

    const v23, 0x1aaa29

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->B̶̧̨̧̗͈̥̺̒̔̈͘͝l̷̤̻̙̞͚̦̃̽̔̋̂̈͜͜͝͠o̢B̢̢̹̬̺͕̱̌͋̏́͠eļ̸̧̟͈̯̗̥̺̾̅̋͐͋̇͗͋͐̚͝͠ȟ̸̷̴̷̡͙͎̯̦͕̭̯̩͕̿̃̈͜ǫ̶̸̶̧͚̺̫̲͈̫̹̭̮̯̙̼͓̌̔̅̌̔̑̎͊̌̈̋͊͆̑͒̆̎̍̄͌͑͗͘̕͠͠ě̶̢̢̗͉̰̦̤̐͋̍͂͌̌̌͑͘͠͝a̰͈̲̹͉͐̈́̔́̅̾̂͝ͅK̷̷̵̴̨̢͎͚͎͕͖͇̺̗̜͎̼͙̘̜̫͖̫̀͌̏̈́̋̈͆͆͂̑̉̌͂̈͗̐͗̈͊̌͑̃͑̎͘̚͘͜͜͝e͎̤̫͌̃̌͐͜ȩ̴̴̧͚̭̭̫͚͕̫̼͈͇̐̌̈̓̄̅̾͑͆̏͋̅͂̽͘͝͝͠͝K̻̰̯̺͕̖̯͋̃͑͌̏̐̾̌̋͌̋͘͜͠͝k̾B̭̀̂P̙̌()Ljava/lang/String;

    move-result-object v19

    invoke-static/range {v19 .. v19}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v19

    xor-int v23, v23, v19

    const v21, 0x1aaa4a

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->B͓̗͊͝o̻̜̎̈́P̷̭̂͠p͌̃̌B̡̗̏̚͜o̵̴̧̙̘̥̤̮͚͚͙̹̦̥͕̗͗̿̎̂̽̐̀̂̋̿͑͘̚͜͝͝K̸̘̾l̸̥̫̹̟͓͎̊̃̎̔̀̋͜͝ȩ̛̛̫̯̈́̃͝͝P̡̨͙̤̖͎̺̩͎͋̋̎̚͝͝B̷̧̫̼̖̊h̰͚͓̋͑̓̋̈̂͌͌͋͋̅o̧͌aB̵̶̶̶̅͊́̄̊̎̎͘ų̶̸̷̧̡̛̛͚͉͚͇̱͓͚̗̭̯̻̺̺͎̩̂͗̿̾̑͑̈́̿̋̐̈̂͌͋̈́̽̋́̑̂͋̚͘̚͘͝͝ͅaa̫ą̴̵̧̧̹̥̦̫̖̪̆͆̄͗̋̄̋̈̌̂͝͠ļ̛̥͈͇̔̄͗̏̃̓͜ͅòa̸̧̺͌̏̋͒̿̂̐̌̂̽͘͘K̭ą̷̸̸̮̹̹̰̦͉͕͕͓͉͚̼̬͇͎̿̀͗̔̈̌̋̂̕͠h̹̿͜a̸̷̶̫͎̹̎̈́͝()Ljava/lang/String;

    move-result-object v19

    invoke-static/range {v19 .. v19}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v19

    xor-int v21, v21, v19

    const v22, 0x1ab2ca

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ä̴̢̺̜́̄̋̚͜ͅḻ̴̫̟̈͆͆̄̄̋̚͜P̧̖͓̩̙͎̭̻̱͗̃̄͗̄̌͋͝͝͝p͚̬͋̃͘͠t̶͖͕̯̝̻̰̭̱́͂̎̋͑̊̃̍͋͋̋̒̚͜͝͝K̸̸̸̩͈̮̎̾͋͐̀̏Kuą̸̶̟̱̭͚̲̱̦͈̺̺̎̿̂͗̎͋̂̚͜͠p̛͉͎̄͋̈̃̾̾̈́͘͜͝e̶̸̸̵̴̸̢̛̛͚̯̝̹̭͚͓̫̯̻͇̬͚͙̮̰͚͓̰͓̦̠̹̬̫̲̪̻̜͓͋̃͗́͒̅̉̂͗͊̂̀̏̇̋̂̔̋̋͗̾̂̂͘̚͜͜͜͝͝͝͝k̺͂u̸̶̧͙͆̑̕oe͝p̸̨̪͕̼̙̝̂̄̎͌̌͂̊̂̈̚͝͠Ķ͈͚͓̺̯̅͋̌k̛̥̹̱͙̔͒̔̚č̷̭̫͎͈͕̝͚̺̐̌͑̑͂̈́̈́̀͜a̸̢̡̗̯̼͗̌̎͗̾͒̾͒t̺̮̂̋̂͜͝()Ljava/lang/String;

    move-result-object v19

    invoke-static/range {v19 .. v19}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v19

    xor-int v22, v22, v19

    invoke-static/range {v20 .. v23}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v20

    move-object/from16 v0, v20

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v27

    const v30, 0x1ab892

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̸̷̵̴̷̛͎͎̙͓̯̤̝͓̱̲͒͂̿̋̂̀͗͜͜P̀̿h̷͕͚͂̄a̸͎̼̯͓̍͂͆̿̕͝͝a̷̸͎̯̩͓͈̘̯͗̇uä̵̵̢̩̫̤̭͓̺̮̝͖̐̈̊̋͋͗͒̎̾͜͝o̵̵̥̭̭̲̪͓̲͗̄̾̿͒͗͌̇̎̇͌̌̅͂̂̕͜͝͝B̧͉͕̌͒̿̍̂̂̑̌͊ḧ̪̯̫̭̩́̂̚P̂͂̅c͘n̴͉̂̂k̦͈̂̌̈ţ̛̫̄̾̍K̸̙̈́͌́̃͜ţ̴̧̗̯̗͈̺̫̮̈́̂̈̿̋͌̾̋͊̚͜͝ö͈́̂a̸̵̚͝B̼͕͈̀ȇ̺͐͝t̸̸̢̛̰̗̰͓͚̫̯̦̠̙͓̖̭͓̬̎̂̈́̈͌͌̑́͂̈́́̐͋̋̂́̃̐̈̄̈̚͜͜͝p̶̸̛̺̦̫͌̆̎̔̔̇̌̈͑̾̈́͂͌̿̕͝͝c̷̛̛̗͙͋̓́̌̀P̢̱͈̰̾͂̎()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v26

    xor-int v30, v30, v26

    const v28, 0x1aab80

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̮͂̈́̚ä́̿B̢̭̗̋p͌͌t̂B̌̃a̟͋́̅̈̓͜͝u̢͕͚̾̆͌̈́͗â̩̩̩̫̌͜ǩ̴̢̲͉͝â̧̆̌̏̅̋̂̚͝a̍͝n͚̿͠Ķ̶̨̭̘̫͈̩̬̺̥̭͚̯͇̖̱̭́͌͋̋̈́͑̇̄̐̎͋ǫ̢̺̮͎̦̱̺̦̦̭́̋̎̌͆p̴̴̶̢̼͖̦̭̖̱͑͌̋̋̐ǎ̴̡̛̛͚̫̲̓͋̎̂͌̈̈͋̈́̈́̋̋͌͐̔͝a̸̵̯̙̭̲̼̱͋̽̑̄̈́̄͘ͅe̸̸̗͗͌͌̃̌̋͘l̶̛̫̲̫̆̒̔̔ḁ̷͚̠̌̈́̌́̋ô̩̤̺͜ķ̗̗͚̩̌̆̎͑͂̅͝ņ̶̷̸̶̸̡̗̯̩͚͓͈̘͎̦̖̼̘̦̱͉̼͚͚͌͗͗͊̅̋͒͌́̈́̂̔̃̐͑̃̌̈́̄͗͌̌̾̋͗̉̄͘͜͜͝͝͝͝ep̴o̧̝̫͈̦̎̿̚͜()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v26

    xor-int v28, v28, v26

    const v29, 0x1ac15b

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǎ̸͎̫͗͌͘k̖p̶̞̤͋́̎̐͊̚B̛͇̯̗̌̌ͅa̶̧̨̛̛̦̩̮̭͎̠͚̺̪̼̤͇͉͗͑̈̓͗͑͗̌͗̌̈̄̆̕ą̥̬̺̫̖͕̈́̆̎̓̂̌̏͒̿̎̋̂̌͜Ķ̨̛͖̝̩̫̫̎͘e̛͚͚̯̫̭̺̫͑̈͌̾͌͘͜k̵̸̢̧̧̹̖̯̫͐̈̀͑̋̈̈̾̿͌͜͝k̵̸̻͕͗̏̔͝͝a̶̤̲͚̯̯͓͑͑̑͗̚o̸͙̮͋a̶̷̭͕͋̕Ķ̴̸̶̛̛̤̘̫̙͉͓̯̝̥̮̯̫̻͕̋̊̋̂̎̃̈́͌͌͐̾̾̂̏́͑̑̎̄͜͝͠͝a̐ḙ̈́̌͜e̛̯̥̋̾̿͝P̲̜̃̈́ḁ̭͈͜͝k͎̝̱̩̫̖̄̿͑͗͘͜͝ę̴̸̷̸̴̪̖̪͈͈͎̱̤̰͚̮̘͎̯̭̫̗͌͋̌̔̋̆̿̂̀̓̍͐̋̂̄̋̋̌̈́͘͜͜͝͝͝()Ljava/lang/String;

    move-result-object v26

    invoke-static/range {v26 .. v26}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v26

    xor-int v29, v29, v26

    invoke-static/range {v27 .. v30}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v27

    move-object/from16 v1, v27

    check-cast v3, Landroid/graphics/drawable/BitmapDrawable;

    invoke-static {v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->l̯͌ơ̩̫͎̌͌̂̈́̊̄̈́á̶̖̱̤̩͚͉͈̦̫̈́̂͗̂̆́̍̐͑̂̕͝k̵̶̭̹̎̽ņ̃͝K̯͕͘ầ̶̵̶̯̥̮̫͙̭͙̝̻̘̥̫̯̩̔̔̐́͌̉̆͊̋̚l͓̈́ç̷̙̪̙̙̻̼̮͕̈́̿͗̔̿͐̄p̷̴̸̢̹̯̪̦͈̘͓͕̫̏͂̂̄̆͘͝͝n̐̚Ķ̢̰͈͓̦̤̃̂̈̂̉͆̏̏ǒ̴̸̸̧̢̢̻̻͕̙̘̺̭͓̦̖̠̱̯͌̈́̑̂͗͗͆̏̈̐̂̈̐̄̂̑̾̂͝l͓͊h͎͓̑̂͋͜K̷̸̸̸̸͖̖̯͓̺͈̥̰͈̻̀̇͋̑̎́̈̂͒̏̆̂͌͘͝͝P̴p̱͙͗͌K͚̰ţ̵̏͗ĺ̸ő̶̧̖̻̙̘̆́̈́͌͌̿́͝k̨̍a̶̧̧̧̘̤͎̬̥͒͌̏̋̌̔̍c̫̺̋͘͜u̷̟͈͊oa̧̭̜͜u(Ljava/lang/Object;)Landroid/graphics/Bitmap;

    move-result-object v0

    invoke-static {v2, v0, v4, v5, v6}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->P̶̞̖̏K̫̗̑̆̋ä̴̸̧̫̪̗̭̹̺̫͓̔̎̆͊̄͂̅̂̄̃͝ẵ̶̘͈̖̙͋̃͘͠ç̵̴̴̧̧̧͎͓͚̰̗͉͕̘̭̼̦̞̹͎͓͈̗̈́̀́̀́̔̌͋̄̑͐͌̌͐͑͜͜͝K̇̐͌͝ç̵̷̸̧̛̩͓͚̭͂͑̀̌̾̌̏̿̄P̷̵̶̸̶̢̛̛̫̪̯̥̦̪̭̺̠̞̖̰͎̜͚̫̏̾̌͋͋̿̿̐͗͋̌͗́̌̔̂͋͌͗̕͜͜͠͝K̺̦̦̕ͅh̨̧̪͊͆͋ḁ̵̸̡̛̛̙̦̻͗͌̎̌̿͒B̧̧͈͚̺͖̄̊̃͊̔͜K̸̟͙̂̾̌̅ḛ̶̈́̔͊̚̚a̋ṕ̴̵̢̜̯̺̿̑̃̚͘͜͝ot̷͕͚̰̲͓̠̹͐̈́̅͗̋͋͝ǔ̵̷̢̫̼̥͚̎̈ka̧̘̰̫̫̩̻̥̮̰̫̋̈̌͐̈̃̈́͌̎͌͋͝c̰̥̈́K̨̃(Ljava/lang/Object;Ljava/lang/Object;IFI)V

    return-void
.end method

.method public setWallpaperAsImage()V
    .registers 56

    move-object/from16 v4, p0

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v32

    const v35, 0xd950

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ą̸̶̴̡̧̫̺̝͎͓͎̮̫͙͎͖̗̀́͋̊̀̍̔̊̈́̒͂̂̋̿͌̌͜o̷̸̴̧̘͚̪̮̫͎͒̂̑͋̅̅͑̏̾̈̿͘͜͜͠t̵̸͈̯͎̻͋̋̅͑ơ̥͌͠ḁ̸̵̷̵̸̢̧̧̨̲͎̺͚̱̮̘̺͇͉̝͎̦̗͉̲̺͉̆̂͌̈͐̈́͗͋̆͐͂́̈̌͐̈́̌̓͆̅̅͘̚͜͝͝͝͝͠ͅp̛̛̙̭̮͙̿̑̐̔̚e̙̗̝̝̻̥̺͓̋̂̋͗̀̈́̃͝c̸̸̨͎̻̬̥̻̠̭̯̩̮̥̭̫͌̎̔̂͌͋̎̋̎͗̐̈̌̾̋̕͝k̷̷̢̛̪̫͕̮̻̫͈̹̲̹̤̯͈͕͈͎̗̭̘̫̿͌̑͋́̈̑̀̋̎̎̓̌̂̂̀͑̋̅͆̅͋̂̅̾͋̚͘͘͜͝͠͠P̢͓͎̥̭̯̯͋̌̉̾̅̾͘͘͘á͉̗̺̯̈́̋̌̊͝â̸ą̸͈͚͉͚͚̓̚͜()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v31

    xor-int v35, v35, v31

    const v33, 0xdcc2

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->Ķ͚͕p̡͚̤̏̂̃̈́̅́͑ͅḣa̵͉̋̏̑p̴̨̦̲̘̫͚͗̂͆͘o̷̘̱͋̈̈͘e̷̸̵̪͕͖̹͚̗͑͗̌̌̚͜n̸̸̷͚̩̦̭̹̩̫̋̈̅̌͌͗͘͜͝ͅc̸͚̮̻̮̎͋̏͆̈̌͜ç̴̸̸̻͙̦̘͎̱͈̪̫̯͉͎̈́̿̈́̂͐͂̌͑̿c̷̸̨̧̛̗͖̞̝͎̘͂̔͐̈́͝͝ç̶̗̹͚͂͂̿͂́̂̚a̶̷̸̧̨̛̙͈͙̮̥̠̙̙̾̈́̈́̿͒͋̋́͗̎̚̚͜͝ä͓̗̜͎̝̤́̃̌̎͌͐͐̌̓͂̚͜͠͝t͈̽l̯͎͈̦͙̋̈́͗̃͜͜t̸̡͎̪o̢̥̥͗̑̍͝ȗ̦͉̈͐̚tpoa̭ü̫̘̖̈́K͆̈P̨͉̤̑̂̀̆a̸̶̡̲̯̘͙̼͙̙̯͐̽͗̑̏̚͜å̋p̧̡̝̦̌K̴̛͙̖̂́͑̃͗͜͝͠()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v31

    xor-int v33, v33, v31

    const v34, 0x1abd99

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ë͇͕̞B̴̧̧̨̛̮͈̻̭̱͓̫̾̎̈̂̈̈́̈́͗̾̚͘k̴̮͂̕̚o͝a̷̵̗̋͝ĉ̶̷͎̠̤͝͝Ķ̧̛͖̪͚̺̭̫̞̫̠̗̻̺͗͋͌̀̋͂͗̀̌̅͂̀̌̚͠p̢̢͕̮͈̺̻̺̌̆̅̿̎͂̈́̎̾̏͘͘͜͜͜͝ä̝̭̫͎p̴̶̷̸̛͓̼͓̤̼̬̫̫̭͈̑̚͜ṉ̶̴̷͕̼̯͙͗̃̌͊̎̏͘͘l͕̺̹̪̭̫̥̎̈͂̃ļ͉̈́a̢͌B͚͚̭̮͓͈̘̅̀͗̋̾͗̋͗̄̈́͗̀̚͜͝K̸̺̺̭̗̩͕̹̺̎̄͋͋̏̾͌̚â̧̠̰̫̦̦͈͕̖̭̘̤̦̼͋̈̋̀̍͑̾̌͜͠u̱͘K̶͖͉̗͊̃̅̎͝͝a̸̷̢̢͎͉̎̌͘͝e̴̵̢̡̧̛͚̮͕̭̬̱̹̹͙͈̖͙̯̼̹̯̹̗̠͂͒̎̃̈͐̈͒͗̂̎͜͠()Ljava/lang/String;

    move-result-object v31

    invoke-static/range {v31 .. v31}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v31

    xor-int v34, v34, v31

    invoke-static/range {v32 .. v35}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ṕ̴̢̛͕̫̗̫̯̅́̚͘hĶ͇̫͌̋͋̅̂h̸̛̹͙̹͙̺͉̓̈́̂͘͜͝t̝͌̀ã̶͎̙͜͝͝͝Ķ̴̷̛̘̗̥̹̤͕̮͋̄̌̌̇̉́̍̈́̈̐̽̈́̚͘͝͝ͅt̶̷̷͓̜̯̐̿́̆̚͜͝c̷̵̸̜̺͓̀͗̋̑͐͝l͕͕̩̤͚̑̋̓ṋ̪̯̈́͋̽̔̈a̶̴͓̖̹͐̂̔͌̂̃̚͝͝e̴̢̛̛̯̫̱͎͈̱̬̻͙̲̾͋̒̈̀̅̔̃̎͒͐̑͒̿͗̕͝a̫o̫̼̺͊K̸͕̤̟̩̰̘͎̖͒̎̋̅̃̇͝pǎ̸̺̙͈͕̎̾͐̚t̨͌̊kP̆ȗ̙̪͓͈̥̫̮̌̋̂̿͘u̴̯̖̝͉̞̥͚̲͇͌̂͆̊̔͑͑̈͘͜͝͠a̧̦̥̺̘̦̺̺͌̋͌̉͆̚k̢̺͓̗̏k̢̲̲̂͗̓̂̾̿K̛͚̰̲̿̃a̸̷̧̪̰̭͌(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v32

    move-object/from16 v0, v32

    invoke-static/range {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ą̵̵͖̥͚̫̦̺͎͕͈͚̈͋̂̂̎̑̚̚͜͝͠͝͝ͅŏ̧̧̝͙̋̌̆͜͜͝ḙ̢̛̛̛͕̠̠̦̫͈͋̋̓̚̚ę̸̸̵̗̺́̿͜ͅȩ̸̶̡̛͚̥͚̖̻̗͕̾̾̋̋̌̽̈̎̋̂t̤͉͎̘̀̿a̧̨̨̧̢̛͇̲̫̱̹͎̥͕͎̯̩͕̺̺͙̗͚̥̺̙̟̗̰̯̩͂̊͂̎̌͊̃̃̌̇̃̌͐́̃̀̈́̀͆̚͘̚͜͝͠͝ǎ̙̭̺̅͑͘a̫͕̥̫̯̦͋͌K͉͎ķ̶̷̡͓̙̹͉̹̠̖͕̹͉̹̗̭͎̦̯͉̥͖͓͖̿̍̐̌̔̆̌̕͘͘ǎ̹͆̔̉̈́h̷̕͝a̲̋a̴̵͝p̴̻͊̈ḩ͚̤͈̹̪̉̔̄̅P͉̗̞̩̮̂̌̆͝ŏ̸̸̧̧̡̧̦̯͈͙̗͖͉̹͕̩̹̎͊͗̿͌͌̈̄́̒̃̍̈͋̈́̑̌̀̔̚̚͜͠͝ͅ()[S

    move-result-object v39

    const v42, 0x1acb43

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->nK͝B̸̫̖́h̸̸̨̨͙̻͓͎̘͈̥̗̺͌̈̈́̅̋́͋͜͝n̸̟̺̤̹̺̫͈͗̈́̎̀͂̚͜͠͝n͗͋͗̚͘h̗̿P̂̔́à̩̰͈̾͝K̹͓̱̮̗̈̈́͐̈́͝o̸̸̧̢̢̧̡̡̧̫̺̪̭̭̫͆̌̌̐̽̃͌̈́͌̋͌̆̾͊̿͜͠͝͠͠c̯͚̠̅̍͜e̵̺̗̋͋̍͋̾̚ť̶̥̮̘͖̂̃̄͝l͘p̥͎̫͗̑͋l̢͕̺̘͋a̸͖̤̱̙̋K̃͝a̛̗n̮͉̈́̈́ą̴̴̦̫̘̹͈̦̱͎̎̈̂̅͌͗̎̈́̎̑̌̏͘̚͜͠͝l̶̛̫̼̫̯͉̍̊͗͋͜ͅB̶̟̭̥͕̟͋͐̀̂̅̚͠h̸̢̡̛̛͓̥̼̻͉͚̫̅͂̌͌̔̑͗͒̋̈́̾͜h̷̢̧̧̛̛̛̟̻̺̭̦̤͎̤͕̺̤̫̩̖̿͑͌̏͋̐͌̅̋͊̂̌͗̈̈̌̄͝͝()Ljava/lang/String;

    move-result-object v38

    invoke-static/range {v38 .. v38}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v38

    xor-int v42, v42, v38

    const v40, 0x1ab60f

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->u̫o̸̧̢̫͓͎̫̯̤̗̪͚̬̞̫̤̫͈̮͚̪̥̘̾̋̀́͒͂̾̍͋̿̌̂͐̋̉̓̎͗̔́͒̚͜͝͝͝ä̢̛͎̦́̄̄̀̈́͌͜͜c̶̴̹̱̮̲͓̲̤̼̗̜͓͈̑̎̈́̾͗̃̃̽̃̿͌͋̈̿̚͘͝͝͠͝͝h̸̭̝eK̛̠̦̯͌̉a̧͉͖̦̐̎̾͗͘ô̵̖͎͉͚̌l̸̤̱̘̪̭̯̯͌͌̂̿͐͘͝B̶̸̵̷̨̛̯͙̯̪̦͚͎͈̙̝̖̯̼̗̥̐̌̋͌̔̋̿̄̈̋̍̀̈́͝͝͝a̸̧̧̝͙̻̲͚͉̘̖̘̹̼̫̯̠̫̍͐͌͗̾̔͆͋̌́͗̑̊̅̏̄̍͘͘͜͝ͅK̵̫͒̈́̉̈̚͝Ǩ̴̡̢̥̯̗͓͖͈̼̫̥̦̎̽̊̐̎͊̅̋̚̚ç̸̸̷̧̙͚̥͉͙̺̱̑̂̂̓̍͌́͗̑̎͂̂̈́͘B̧̛̯̯̦͈̮̤͐̿̂͠()Ljava/lang/String;

    move-result-object v38

    invoke-static/range {v38 .. v38}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v38

    xor-int v40, v40, v38

    const v41, 0x1ab32d

    invoke-static/range {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->K̛̘͉̥͚̘̮̄̋̌̀͒̋̕c̯c̶̷̨͓̫̱͈̲͌̈́̑̀̇̏̂̿̎̌̿͘͜͠͠K̸̶̶̢͖̩̘̩̲̲̺̈́͌͋̎͌̋̈̚͝p̸̴̶̢̺̩̭̤͚̠̰̩̯͚̫͚̮̙͉̯̻̯̭̥͚͚͌͑͌̾̀͋̑̈́̃͌̏́̓͌̚͠a̠͓̠͑̌p̷̡̱͖͎͚̄̔̎̌̀̍͜͠oK̸̢̙͎̹͓̯̥̞̖̗͎̗͎̮̖͚͙̔͗͌̂͗̿́̔̚͘̚͝͠ǎ̵̂̎͝͝ȧ̜͗̑p̷̶̷̸̧̧̧̢̛̛̯̻̭͙̩͕͎̫̝̯̫͕̞͚͎̫̙̼̱̺͕͇̏͊̑̈́̄̌̾̂͌̃̎̀͋̍͌̑͐̒̃̀͌̓͜͝͝͝͠k͈͚̂͋̕͝o̷̶̧̩̫͎̺̺̭̼̠̫͚̱̤̺̘̹͎̠̥̫̘̎̂͊̌̌͌̄̐̌̐̋̿̑̋̄͒͊͐̈̌̈́̂̌͑͘͘͜͝͠ot̸͗̋̚e͚()Ljava/lang/String;

    move-result-object v38

    invoke-static/range {v38 .. v38}, Lcom/kashi/settings/view/BlurBackgroundImageView;->P̴̧̲͎̹̰̫͓̝͉̿̂̋͂̀̾̔̿̕͜͝͝K̶̵̶̢̧̥͖̫̤̙̈̿̈́͂́e̴̶̯̫͇̺͂́̈́͌̌̊̃̌͝k̰̬̹̺͋̍̈̌̚͠k̻͝͝a̶͌͗cK̷̶̷̗̾͌ata̸̶̛̹̫͙͕̤̜̩̫͚̯̗̾̆͌͂͋͑̿̑̀̀̅̂̑͒̿̕͘̚͜͜͠͝ͅc̷̮̱̼̃̊̈̑o̺̔̎̓̈p͕͌̎̌͝͠ň̸̢̢̡̝̠̹̈́̔͗̈́̅͌͗́̓̇̆͘̚͝à̞̱̥̯̠̪̍K̦̹͉̋̾͒͊͝͝l͕͌̑p̸̸̶̸̧̢̛̛̗̗̦̯̘̥̟͙͈̹͎̤̫͓͎͌͐͋͂̀̎͌̋̿̋̏͌̃̔͌̃̈́̂͌̌̂̚̕͜͠͠aǨ̙̩̻͒͊͌͗͘͝nò̧̭͈̗́̎̓̃͗̎͐̄̌͑͜ͅa̰͗k̶̸̴̫̥͈̺̟͕͌̂̊̔̌̋́͋̌̋̍̏͜͝͝͝(Ljava/lang/Object;)I

    move-result v38

    xor-int v41, v41, v38

    invoke-static/range {v39 .. v42}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̸̶̢̧̡̞̖̘̫̗̩̹̺̫͇͎̺̗͕̼̘͗͌̌̎̈́͑̈̋́́͜͠͝ͅͅë̶̸̢̫̠̦̫́̎̎̎̾̉͂̃͜B̶̸̸͕͎͎͓͉͉̅̿̌̂͒̃ha̶̛̰͓̮̦͈͂́͊͊̑͘B̶̧̫̭͋͌̈͂̊ą̡̢͎͉̫͎͇̹̽̃̈́̌͒́́̂̄̎̈̉͘ǫ̶̷̵͇̲̱̲̭̫̦̈̂̐͐̽͒̏̅̀̆͘̚͜͠͝K̸̨̧̨̤͓̯̫̫̮̱̯̱̻͉͎̫̃̈́̋̂̂̍͊̇̌̄͌̂̄͑͋̚͜͜͜͝͝ȧ̶̵̢͉̗͕̹̈͑̐̈́̈́̌͝l͉̜̥K̶͎͕̹̥͉̥̂̾̈́̌͜͜͜͝ac̡͕͉̈́̑̍̀͝͝o̸̷̢͚̟̹͉͉̮̺̦̬̩̹̺͌̏̑̂̇̐͌̓̐͊̚͝c̸̵̢̧͖͈̞̭̲͉̈̋̈͐̌̅̌͊̕K̈Ķ̶̭̰̌̐͘n̻̭̥͊́̂̾͑(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v39

    move-object/from16 v1, v39

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->o̙̫Ḇ̸̴̵̧̘̩̖̼͓̀̇̎̑͐͋͠k̺̰̮̺̈̈́̂̌͠P̶̢̢̱͓͓̺͖̘͓̯̪̜̟̱̥̗̗̹̬̹͉̖̮͕̿̌̏̅̌͑̈͌̈́̄̂̈͐̋͘͜͠K̷̺̘̻̎̐̿͒̍̂͜ͅča̰ṱ̨̢̛̱̬̦͎̂͋͌͌̈͌̂͝͠͝K̺̲͌̚ḧ̴̵̸̸̸̶̢̛̛̖͈͚̱̰̝͇̫͉̩̺͕̬̥̻̘̺́͆́̋̿̏̍̑͑̌̐̑̈͋̋̾͋̑̐́̌̀͘͜͜ͅp̷̢̥͎͚͕̫̯̫̗̟̱̙̤̮̩͎̺̞̹̭̩̗̃̈́̾̀̃̃͑̅̿͂̌̌͜͝ü̸̯̼̯̭̤̋͋̌̉̋̿͠ol̸̛̲̩̫̭̪̖̬͕̥̫͎̥͂̽͌͌̉̿̔́̇͋͐̒̋̔͂͌͜͝K̴̴̥̫͎̦̮̦̘͕͗̏̿̿̎͗͘͘͘͝a̛̫͑̀̚o̷̸̻̬͚̺̺̟͙̙͒̑̒̊͌̏͜()Landroid/app/WallpaperManager;

    move-result-object v0

    invoke-static {v0}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->k͎̐ơ̵̧̜̔̑̆̈K̸̸̢̨͉̯̫͎̫̭̮̘̠̞̋̾͂̑̎̈̌͌K̷̠̗̗͎͉̫̔͌̆̆̂̾͌̋̈́̈́̚͜ö̸̵̲̯̺͙̗͈̝̼͕͎̼͈́̔̾̃̌͂̎̑̚͘͝͝a̲ù͒ȩ̢̧̫̼̑̌̍̾K̑ü̶̙͈̮̫̃̇͗̾̈́͘͜P̷̴̷̴̡̧̛̛̛̬̥͉͌͌̑̈́̆͒͗̎̀ņ̸̶̸̻͈̩̥̻̩̻̃̂̀͌̈̋͋̅̆̚̚͜͜͜͝P̸̸̸̸̨̛̯͎͈̱̫̟̘̩̯̟̋̂͒̎͐̈̌͋͂͆̌̏͒̿̂͋̋̂̈́̿̑̾̚ͅć̵͙͙̙̫͓̯̙̦͒͂̏̎͌͝͠͝͝Ķ̫̝̗̅̎̂̚͝c̷̖̤̈́ą̵͗͐eư̛͓̲̼̮̯̗͙̭̘̱̯͖̖̞̟̩̯̫̭̈́͌͒̌̌̾́͘͜h̼̿̂ō̴͕͎̼̤͈̗͓̹̑̇͐̒͘n̯̾̑͝(Ljava/lang/Object;)Landroid/graphics/drawable/Drawable;

    move-result-object v0

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->ǔ͕̆̋c̢̰̅̂̒̈́ḙ̴̢̰̮̺̥̰̞̠͕̾̑͜ͅa̺͙̖̋̆̋̒̏͝ȏ̸̪̩͗́̂̏B̷̧̫̹̅̎h̀̌̄ơ̡̞̱̹̺̬̋̅͘͝ͅo̗̓̃̌̎͘͜h͉ņ̷̸̛͓̪̗̯̤̎͆̂͌̎̌̂̃̒̚͘͜͜B̢̾̂k͕̹̫̈́̌̃͜B̋h̸̶̸̢̧͈͇̗̫̘̥͌̆̌͆́̑́̉̀͌̈̍͘͘͜͝p͉͇̩̕͝a̫̚ç̱͉͗̈Ḵ̷̵̶̷͎͉̟̯͉̥̮̼͚̭̎̑̑͗̐̏̊͌̿̈̍̌͝e̯̮̠ầ̶̸̷̴̢̡̫̖̠̖̗̱̻̯͇͑͗̉̏͗̐͝K͝a̧̻̼̗̥͝K͕̘͙͘ͅp̵̶̶̴̶̧̨̭̦̩̫͎̦̼̰̺̤̮̆̃̀̅̀̎̾͐̈́́̾̇͂̑̎̆̑̃̃͘͜͜͜͝ṵ̷̙̻͈̫͓̅͋͗͜a̢̢̫̿̂̄̿̀̋͝()I

    move-result v1

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->a̎a̞̜̠̿̋̾ơ̵̧̧̪̞͉̦͚̩̮̫͉̤̾̃͌̅̌̉̈͆̈́̂͝ͅĶ̷̴̷̮͈̱̫̥̯̙̤̯̮͕͉̺̈́̌̿̑̈́̉̂͋̍̆̔̚͘͝͝t̺̀p̗e̸̷̶̢̡̫̦̤̦̖̘̫͋̋̿́̄͊̀͋̾͠h̷̴̯͈̫̖́̎̂̌͑̋̍͘ṏ̗Ķ̸̸̸͚̱̻͑̄͝a̧̮̲̰̎͌͐͑cć̢̪̹Ķ̸̸̸̛͙͓͓̫̗͎̘̫̭̅͋͐͌̄̍̌̏̓̽̌͜͝͠͝ļ̵̸̨̧̫͈͈̼͖̰̭̯̘͈̺̫̝̺̥͓̘̯̈̑͌͋͌̈́́̂̈̈́̽͂̑́̐̌̈̾͐͒͒͘͘͜͜͜͠ĉ̴̴̸̢̨͚̫̭͉̱̥͙̱̫̙͎̪́̀̾͌̂̂̔̃͜͜á̴̗͕ķ̶̸̴͚̦̥̯̰̖̫̅̎̒̌͑͊͊͝h͗͝K̗̲͋́͗p͎̹͌͑͗̂̈́̑̀̈́ṱ̴()F

    move-result v2

    invoke-static {}, Lcom/kashi/settings/view/BlurBackgroundImageView;->B̲ļ̢̨̧̱̘͙͉̗͉̈̏̆͝B̸̶̨̧̲̭͚͈̺̔͠ḩ̸̶̨͉̭̥͚͉̂͒̎̈̈à͠h̴̛͉̲̖͚͉̑̅̄̐͌͗̋̏̋͜͜Pč̞̺̤̯̱̘͚͋̔̈̂̌n̪̦͈͝ȃ̸͙̰̭̤̖̤̲̂̃ĥ̗p̴̢̨̛̛̤̼̯͕̼̫͙̯̱̘̹̥̗̆̄̐̑͌̅̎̈́̈́͐͌̋͊̏̇̾̚͘͜͜͜͝lü̧̈́̾ţ̷̸̶̷͙̜̹̟̺̍̄̾̒o̷̹̕Ḇ̸̴̧̛̮͎̯͓̦̙̩̲͚̼̑̋̆̄̌̎̌̆̿̆͘͝͝á̶̴̵̧̧̡̫̮̻̤̭̭͎̠̋̃̒̏͗̎̌͝e̶̸̷̵̶͉̦̯͈͉͕͓̰̰͚̋̎̑̅̄͑̌͂͑̃̊͂̌̅̋̃͘͜͠ͅa̷̶̧̨̯͓̘̲̙̜̫̻͕̭̫̰̥̘͎̖͐̅͌̈͆̔͌̋͗̐͆͗̉̑̌͜͜͜͝͠͝P̾()I

    move-result v3

    invoke-static {v4, v0, v1, v2, v3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->an̷̸̛̤̯̫͙͉̩̯̫͚̪̎͌̄̈́͋̾͌̌̃̚͜ḧ̛̫̙́̄̈́͜a̸̧̯̺̎͗K̛̰͇̙̯̼̐̋͂͐͌͝B̶̻̲͚̤̺̯͗͋͠ö̫͉́n̸͉̐͌̄͌̆͂̏͝ǫ̷̶̸͉̦͙͚̹̀̈̈́̌͂̆̎̍͝ơ̶̶̷̢̺̙̹̭̘̹̫͈̭̭̿͐̌̌͋́͝͠ơ̴̶̸̷̸̸̸̧̢̧̢̢̧̰̞͚̠̮̥͉̯̖͈̯͕̗͕͚̺̪͈̮͚͓͚̯͎͉͚̭̞̝̯̗̹͈̤̭͙̺̹̭̥̫̫̰̎̈́͋̋̆̈̂̓̏̐̄̈̈̎̈̎̂̓̀͗̋͌̈̏̔͌̌̔͌̈́̂̈́̐͑̾́̌̾͑̾̃̔͗̾̐͘͘̚͜͜͝͠P̵͕͓̖̻͈̍͌͗̿͝u̡̢̺̱̫̱̻͚͕̘͉̗̙̠̯͐̅͒͗̈́͋̐̎̈́̌͘̕̚͜͝͝ơ̸̋̾͗̃̈͘͝͝ṍ̝͖͈̃͌͘͝K(Ljava/lang/Object;Ljava/lang/Object;IFI)V

    return-void
.end method
