.class public Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;
.super Ljava/lang/Object;


# static fields
.field public static ȁ̛̤͕̗͚̌̇ȩ̲̯̎͘͝ǫ̵̶̛̻̹͈͂͐̎͗̋͗͌̋̃͋̽e̵̛̺͓̘̮̾n̤̍̄̐̐̾ȇ̵̷̸̢̛̮̫͎̥̗̲̩̞̙̫̖͚̫̪̥͑̑̓̾̎̋̈́̊̈́̋̈͑̈́͌̈̈̾́̈͘͜͝͝͝ͅuķ̶͉̆͜n̲̜͎̑͆͑͌͌ą̵̛̦̩͕͉̯̈̂̕ķ͈̅͗́͋̚Ķ̸̴͕͙̖̙̊͊̌͊oP̛̂ő̩̦t̵̷̥a̛̩̝̺̘̙̿͋̌̀͗̑͌̈́͒̒͘͠ȏ̫͕̄̂p̵̵̸̴̢̤̲͚͉̺̫̭͚̹̮̥̌̆͊̎͌̐̈̂͋̔̈́̚͠͝c̦̗͉̅̈̋̅͋͝c̛o̸̩͋̑̾͋a͗͋̾e̴̢̧̢̛͎̫͈̱̰̽̍͌̈̔͂̀̂̆͗̄̂͘͝e̸̶̛͉̩̭͆̂͋̾͑͋̈͋̔͘å̶̸̧̛͖͎̫̹̰͙̗͎͕̾̌̾̒́̿͠:Z = true


# direct methods
.method static constructor <clinit>()V
    .registers 52

    return-void
.end method

.method public static B̮̫̺̅̐͌͆̾́̈́ţ̷͚͎̫̋̆̍̂ê̸̷̴̬̱̮͓̱͎͖̘̙̯̎̌͋̔͋̈̈̒͋̆̎̎͂̂̋́̈̚͜ͅa̴̛͓̹͈̦̱̿̈́͒͑̑̑̄͌̌͐͘n̯̥̻̈́̑̈́̄̀ṱ̑Pe̢̢̋̂͐͌ǎ̴̬͈̭̦͓̮̦̈̀͒͝ḁ̶̷̷̷̢̡͎̫̮̯͈̤̯̜̦̥̮̩̘̤̙̪̯́̾͌̂̾̋̑͗̑̇̍̾̀̐̂̚͠͝B̸̷̵̛̭̤̈͒́͌̋B̸̧̗͓͋͌̍͌̉̅̚͘K̸̺̥̥̆̀̈́͒̀͝͝P̷̴̧̫̦̅̂͋̊̃̚k̸̢̘̪̑͒͘̚͜P̡͇͑̋͆̋̈́͊̂͊̋P̧̛̩͎̫̰̮̼̺̄͑͊͋̐͑̔̈̎̋o̧̧̱͕̭̫̗̩̫̗̭͌̆̃̌̋͘͜͝͝͠ͅư̷̧̫͈̫͈̪̯̜̥̈́̌̋̑͘õ̸̹͕̂K̢̰͝͝a̷̢̯̐̾()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۣۦۧ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static B̷̶̸̸̧̧̛̪͕͚͓̰̫͈̠̠̋͗̌̾̃̾̌̂͌̅́̾̈́̚̚͜͝͝͝͝ļ̫̋͋͘B͈̺̦̝͉̜̬̍̈́̄ͅP̷̷̭̞̫̱̄̈̈͘͜ã̺p̵̸̶̛̛̛̺̱͓̺̩̗̗͉̞̫̫̠͙̏͆͋̽͋͒̏̂͆͌͗͌͗̃̿̌̚̚K̶̴̷̴̭̲̱̭̺̫̹̲͉̥̯̖̲̹̱̱̻͕̭̦̹̹̺͈͗̃̀͋͗͒̌͌̎̀̒̑͗̄̋͑̅̂̈́͐̐̚͜͠͝͝͝͝͝ͅǨ̮͉̱͈̥̫̺̬͈̾͜͝͝c̬̙͑̄͋̈́́͘͝͠K̥͉̪͎̘͋͐a̶̶̢̹̮͌a̸͓ť̴̶̶̢̢̨̡̛̤̫͎̜͉̥̈́̓͋̅̎̋́͊̂̕͜͜aṯ̗͌̉͐̚͝l̵̛̛̛̮̜̗̙̗͚̲̘͋͑̈̋͂͋͊́̌͊̈́̃̆̎͗̕͝͝͝e͗̈́̈̃K̸̴̥̺̹̅́̆͋̔͝u͎͑(Ljava/lang/Object;J)V
    .registers 4

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_c

    check-cast p0, Landroid/animation/AnimatorSet;

    invoke-virtual {p0, p1, p2}, Landroid/animation/AnimatorSet;->setStartDelay(J)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static B̷̶̫̫͕͖͖̱̪̱̙̲͕̗̈́̊̃͋͂̌͑̀͗̂̃̄̔̄̅̔͜͜͠ţ̷̷̴̷̷̵̢̛̛̗̲̪͚͉̖̲̹̯͚̫̰̗̘̼̪̘͎͉̦͎͚͌͋͊̈́͊̂̋̐̎̄̂́̃̄̉̈͜͝ͅaBě̎a̷̛̯̹͚̤͂n̝̥̰a̷͈̟͗́͘ç̵̷̵̧̢̻͎̦͎͙̤͕̺̠͕͓̈́͌͗͂͜o̭̼͝ç̵̵͉͊̑̀͐̾͝k̨̹͌̆̈́̈k̻̯̮̦̫̲͈̉͌͑͝Bç̶̨̡̛̫̩̗̱̺͈̘͕̬̆̈̋͋͗́͌͘͜͝K̡͈͒̋͗̓͝l̸̰̗̼̯̘͎̘̞̭̩̅̀͆͘u͋͘B̸̸̡̦͕̭̪̗͓̤̼̥̫͉̺̮̂̈̎̐̾͐͒͗̅̑͗̌͋̌̈́̚͜u̼̭̚͜ǎ̛͎̠͗̋̈́͘͜͜ah̴̴͉̺͕̙̘̯̼͓̻̅̋̈̾̅̉͊̑͑͋͊̕͜͜͠͝͝(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuilder;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_f

    check-cast p0, Ljava/lang/StringBuilder;

    check-cast p1, Ljava/lang/String;

    invoke-virtual {p0, p1}, Ljava/lang/StringBuilder;->append(Ljava/lang/String;)Ljava/lang/StringBuilder;

    move-result-object v0

    :goto_e
    return-object v0

    :cond_f
    const v0, 0x0

    goto :goto_e
.end method

.method public static B̷͙̠̆ͅņ̴̸̷̴̢̧̛̛̟̱̥̘̖̭͈̘̻̮̭̥̥̫͈̫̥̺̫̭͚̗͓̑͐̅̈́͐̄̀̋̈́͂̑̈́̋̈̃̍͊̾͊̊̌̊̌͋̃̑̂̅̍͆̑̈̔͑͌̇͗̂̚̚͘͜͜͜͝ţ̴̶̸̢̙͎̦̖͕͈̰̫̻̔͋́̂̃̀̀̅̏̋͜͜͝ả̸͎̫̜̫̘̯͎̻̓̎̆̚͠͠a̋h̪̫͉̥̤͆̂̀̈͑́̌t̖͎̻̭̦͉̮̦̲͕̃̑͗͑͗̀͝u̵̶͕̩̫͑͒l̷̩̫̠͗̐͌̏͋͋̋̎̕͠ư̸̜̗̋͋̊͗̅͊͋pä̴̸̧̢̧͚̘͈̯̩̭̦͎̯̥͎͚̱̠̘́̌̋̑͐͑̎̉̅̄̈́͘͠͝͝͝áe̦K̪͗h̵̷̴̸̸̷̷̛͚̖̙̮̬̰̞̭̃̑͗̐͌̈́͂̈̋̈́̂̽̈́̏͝a̶̶̸̸͈̤̗̱̭̾͊̋͗̋͆̿͝͠ĉ̸̭̭̠͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۡ۠ۥ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝(Ljava/lang/Object;J)Landroid/animation/ValueAnimator;
    .registers 4

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/animation/ValueAnimator;

    invoke-virtual {p0, p1, p2}, Landroid/animation/ValueAnimator;->setDuration(J)Landroid/animation/ValueAnimator;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static K̷̢̃ṋ̸̷̈̆ç̴̢̧̧͙̦͓͉͈̫͉̹͎̟̺̱̲͑̔́̀͂͗̂̾̑̈́͂̾̍́̿̅͘͜͝͝K̹̼̔̊̈́͝o͝pȩ͚̄̉ő̸̗̃̋ţ̴̸̛̙͚̘̋̎͋́͑͒̅͜͝͝p̫̗̀͒͒̎͜K̸͓̥͇̫̥̜̱̠̉̎̎̐͑̎͌͠ǫ̵̶̛̯̯̤͕̪̦̼̓̒̄̑͗͑͜͝ó̼͚̻͗͗͗͋͜p͚̫̮̱̄̅̈̏̀̿͑͝e̸̵̦̤͗͗̋oň̂̌͝l̷̘͉̉͌́̃̽̅͜t́̈P̸̥̘̼̈̅̈̑̾͝a̴̷̸̴͕̗̻̦͎̗̺̯̟͓̯̺͑͒̂́͐̌̎̂̾͑̑͘p̛̩̈́͑͝ä̢̫̱͙̗̟̫̫́̂͜͝e̠̎͝͝c̢̖̻͓̅ṓ̴͓͜ȃ̸̸̛̜̜̯̀͒̿̂̈̄͘͜ä̫̗̥̯͙̹́̂̉͗̾́̋̅͋̂͝k͓͝P̚()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۧۢۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̵̶̶̴̢̢̺̖̈̔̏n̷̵̹̥̠̩͆͐͌͌́͜aB̷͚͚̫̱̀̋̎͗̈́̒͘͝ͅp̟͈l̷̵̛̻̗̭͓̙̖͚̈́̿̌̑͂̄͗̌́͘P̨͚͚̠̮̹̫͉͋̏͂̀̈́̂̌̌͜č̸̷͓̯̗͉̘̼̪͂̆͋͋̋͘͠͝a̸̢̨̧̢͉̭͑̀̚͜B͚̭̪͖͈̋̋͋͒̚͜c̬̼̖̫̦̘̗͕̖̥͇͂̋̈́̅̉̾̈́̓͝ͅͅp̽̌͐͜p̫̥̭̠̈̅͘͝͠͝e͜a̺͐k̢̯̪͚̍͌̈́̿Pc͓͚̟̥̗̹͌͘͜ṍ̤o̹̬̭̺̱͉͘ä̘̺̗̙͊̈́P̶̶̧͈̥̬̺͎̦̈́̂́͗̋́a̛͈͎̅͒̅͝k̷̷̨̧̛̭̱̖̱̤̂̌̉͋̈̈́̆̂̅̂͠͝ḩ̷̸̷̸̛̛͕̹̰̩̈́͋́̋̅͋͋͗͊̀͑͗̕̚͜͝B̛̮̃̌͝u͌p̫̭̰̄B̤()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۦۢۨ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K͈̋o̸̢͓̯̩̗͖̺̼̪͂̿͗̊́̚̚̕͜͝ȩ̡̛̺̰̹̱̗̙̱̃̾͌̄̋́̏͘͝ͅá̧̄̍͠k̹̯͎͉̙̫͊̋̀͝͝c̸̹̼̬̻̦̱̘̝̙͊̆̑̈́͌̂̈́̈̈́͝n̫͉̦͚͆͜n̄͒̍a̾l͈͈̜̪̂͋͐̔̚P̤t̎a̭͝͝t͎ȃ̸̢̗̰̹͋̎P̷̙͎͒K̪K̖̱͎͐͗̕aa̷̸̡̘̘͌̈̉͊̂̆̾͘͝ͅͅu̧̧̻̺͎͙͓͎̿̐̃̑̑͋̏̕p̡̛̲̥̲̭͕͉͎̑̃͗̎͑͋̂͘͠l̷͚̦̘̈̈̉͆͋a̛P͈̗͎͓͒K̛̩̺̃͠ȍ̱͌a̵̶͈̜̭̫̙̫̹͗̌͌̌̄̑͌̋͘̚ͅä̸̛̗̲̘̗̭̲̺͉̫́̃͗̀̚͠l̃̎͜á̺͚̦͈͗̌̎p̯̺͈̤͇̗̠̱̫͌̋͌̉̏̑̾̌̋̐͘͘͘͜͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_9

    const-string v0, "ۥۤۦ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static Ķ̷̢̢̛̛̛̹͉̩̜̥̩̮̯̑̑̌͊̈́̉́̋̓̄̚͜ͅâ̴̶̸̧̨̢̹͎̾̎̎̎͒̑̒a̸̡̛̗̱̯̹̟̗̫̐͜͝n̷̸̴̷̨̹̱̯̂̏̐̌̂̒̈́͌́͌̋͆͘͜͝ö͚̫̹͈̪̔̈́Ķ̶̥̝͌͒̐͂͜o̲͐á̴̫̪̤̤̗͗̋̈́̈́͊̈̈́͠͠ͅḴō̿͂k̲̮̔͘ǎ̸̷̸̢͇̫͕̫͉͎̺̘͓̘̆͑͐̑̒͒̑͗͆̀́͊͂̃̚t̸͈̺̦̗̑͋͜ņ̶̷̵̴̛̫̫̱̤̙͚͓̮̫͌̂̃͋̅̿̈̿̆̈́̆̋̋̑͘̚B͉͋B̰͕͇͎̘̿a̸̴̷̡̛̮̺̥͉̯͙̥̼͚̼͉̋̑͑̃̌̐̀̎̽͌̑̓̎͆̂̅̈́͘̚͝ͅo̸̡̧̞̫͕̱̤̥̾̌̒͘͝͠͝ỏ͘p͚̱͉̏p̗̰k̸̵̨̧͚͕̤͋̑̊̋̄̎͜͠(Ljava/lang/Object;I)Ljava/lang/StringBuffer;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Ljava/lang/StringBuffer;

    invoke-virtual {p0, p1}, Ljava/lang/StringBuffer;->append(I)Ljava/lang/StringBuffer;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static K͉̰͚̫̖̔̋͌̚a̛̙̅͌̚͜p̈́̆̑o̶͕̻̪̗ͅk̵̛̠̦̘̱͗̈̊̌͝͝n̶̵̢̻͎̫͇̭̤͇̫̗̦̾̐̓̈́̚̕͠P̛̄̾̋p̸̧̗͙͎͈̂̅̈́̽̂̆̂̑̋ĺ̸̵̰̗̫̬͓̂̎̋K̨̨̧̧͉̱̤̭̫̂̈́̌̂̍̏͋͜o̶̠̩͚̔̆͗͌̕͜͝u̸̶͚͈͜͠Ķ̫͚̮͕͗̂̽͝ơ̢͈̙̘͙̫͌̂̆̈̋̀k̸̸̷̶̢̧̧̛̛̥̭̪͎͎̬͎͉̺͚͚͖̑̑͋̆͐̇̎̈̾̂͐̋͋̈̿͜͜͜͝K̨͙̥̯̔̑̅B̭̮̂̅̽͜a̷̴̶̷̡̛̖̯̲̠̹͎̻͋͊̑̍̌̏̇̍̃̎̅͠c̷̷̢̖͎͓͇̙̥͈̿̾͒̋̍̽̈ä̮̰͈̱̯́̑͋̅̐̉͗͜P̶̨̢̛̝͚̘̗̞̯̈͋̈̌͋̆̈̄͜ͅã͈̼̉̏͘͝͝(Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;Ljava/lang/Object;)I
    .registers 5

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_13

    check-cast p0, Landroid/content/res/Resources;

    check-cast p1, Ljava/lang/String;

    check-cast p2, Ljava/lang/String;

    check-cast p3, Ljava/lang/String;

    invoke-virtual {p0, p1, p2, p3}, Landroid/content/res/Resources;->getIdentifier(Ljava/lang/String;Ljava/lang/String;Ljava/lang/String;)I

    move-result v0

    :goto_12
    return v0

    :cond_13
    const v0, 0x0

    goto :goto_12
.end method

.method public static K̶̨̫̘̞̖̲̻͚͉̂̀̄̚e̸̴̢̧͓̗̠͚̫̗̖̫̋̅̌̈̍̎̈͐̉͜͜͜͜͝ţ̧͎͓͕̠͈̈̽̾̑͒̔̈̍͆̅̈́̔͂͐̈̔̒͝õ̸̤͎͐͋a̟̪͚͎͓̼̭̖̍̄u͑͒ķ̧̹̩̥̥̥̌̌̂͋̈́̃̈́̚͜l̷̸̛̲̮̺̗̯̰̦͕̈́͋́̑̋͑̈́̽̿̀͋̕͠͝͝ą͎̘̯̂̎́͋̀͗̋̒͝eK̾͂̍̎̈́͜à̴̪̺͓͎̥͚̪̻̑̅̈́̋̒a̴̴̛̫̯̥̙͋̀̈́͗̿h̵P̸̢̛̩̼̫̱̬̹̙̫̩̱͚͙̰͋̌͌͋̏̾̈́̋̎̑͗̽̚̚͜ä̦̭̝́̎ȃ̵̵̸̸̧̧̧̧̻̩͈̩̼̮̭͓̭̲̦̦̰̹̫͎̘͎̠̲̖̦̗̖̬̦͈̪̭̝̋̃̈́̄̑̄̌̂̿̐̋̑͑͊͑͋͐́̎͋̿̅̃̍̑̌̆̚̚͘̚͘͜͝͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۡ۟ۧ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̶lP̫͗͌o͕͉̘̫͋̌̈̂͌̑̾̈͊̕eą͓͙̑̾̎͜e̹̹̤̯͋͋̈B̍̂ǎ̴̮̇ĉ̸̸̤̹̝̱͈͌͗̂̆͘͘͜͝͝a̸̘̰͓̹̫̎̔͐t̸̝͒̅͗͗̎̎͂̑̅͊͘͘B̸̷̴̸̢̫͈͚̺͈̙̯̱͚̤̻̋̂̈́͌̉͌̂̋̓͆͊̈́̌̎̔̚͜͜͠û̴͐͘͜͠ó̴̄̎Ķ̵̦͚̺͈̦̗̇͋̎͋͋͗̿̀̄͗̌͜a͑͘c̸̛͈̺̭͈̪͒̿̿͌̈̋̔͝ä̢̨̭̮̙̫̰̙͓̎̂̿͜͜͝a̸̸̸̸̷̷̵̢̧̨̨̢̛̛̞͈̟̜͈̫̘̦̩͓͕̦̮͉̜̰͎͚̾̑͒͗̈́̉̂́̅̒͗̈́̈́̂̅͐̽̋̍̌̾̑̋͗̆̀̋͂̈́̐̂̆̂̿̋͗̋͋̏̒͊̈́̚̚͘͘͜͜͝͝͠͝a̶̧̧̘̪̦͋̔͝ķ͚̏̄̈́̎̌͒͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_9

    const-string v0, "ۣۣۢ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̸̹̭̪̪̩͕͉̫̋̈́̅͜͝ȏ̯̬͌̔c̸̸̨̭̝̮̲̻̪͈̄̆̈́̑͌̾́͌̃͜͝͠l̏ȟ̢̢̫̮ņ̸̸̧̨͓̭̗̺̺͎͇̫̗͎͚̰͕͈̜̫̗͚͚͎̗̯́͂͋̓͌̿̔͋̕͝͝p̴̸̢̘̭̮̲̯̌̌̑́͌͝a͠ő̶̢͎̯̭̪͐̃̀͐̃͊ͅa̭͚̭̿̈a̞͗͘ã̛͚̭̭̦̯̅̈͗́̄̂͑̾͌͜͝e̥̼t̶̛̗͓̭̲̍̂̉̂̋͘͘͜͜͠P̷̶̸̧̞̤̖͎̰̆͑̌̈͝u̸̺̦͉͎n̮̗̎͋̅͝á̵̡̡̛̘̻̹̖͈͓̠́̑͒̑͝h̞͉̘̦̃̄̆ţ̶̷̶̵̶̸̷̴̧̛̛̛̙̮̫̞̠̘̪̦̹̻̬̮̻̗͗̋͗̈́͂͋̌̈̈́̾͐̌̋̅̈́̿̐́̆̎̀͠͝Ķ͕͋̌͠ķ̶̤̱͚͈̱̦͚͌͌͗͒͊̀͘()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۤۤ۠"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static K̷̸̭̠̩̆̐̌̎̍͗̈̐͘̕pa̩͈̺̔̌̀͆̚͜ơ̶̸̷̛̠͖̺̘̘͗̆̋̂́̆̎̽̑̌͂̅̓̉͘̚̚͝K̶̵̫͎̭͈̙̊̃͌͜ĉ̸̷̸̗̮͒̍͜o̶̴̧̨̢̫̪̙͉̦͙̦̺͉̥͕̎̾͑͑͌̎̈̑̃̋̋̐͜͜͝͝k̵̸̺̫̰̓̈́̃͜͜͝k̵̸̵̘͕̲͓͗́͑̐̏̿͝ć̛̈́͘͘p̵̡̛̠̼͕͎̺͈̺̯͈̼̾͑̌͐̎̋̿̈̃̃̚͝ḩ̸̷̢̢̨̮͉̲̲̞̪̫͚̰̯̯̘͕̙̙͈̫̫̅̔̅̎̌̿͑̌̑̀̂̿͌̅͊͑͗̚̕͜͜͜͝͠͠h͝hk̷̸̸̜̭̭̦͚͕̫̽̾̾͝c̷͑t̶̶̶̴̸̢̧̧̙̗͈̥̋̏͗͌̌̈́͒͂͗̈͘͜c̨̧̏̒͗̂a̸̵̸̶̛̘̗̯̠͓̤̯̰̤͑̈́̈́̆̈́̂̑͗̚c̤(Ljava/lang/Object;)Landroid/content/res/Resources;
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Landroid/content/Context;

    invoke-virtual {p0}, Landroid/content/Context;->getResources()Landroid/content/res/Resources;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static K͝h̶͗ḁ̸̶̷̸̝̭̪͈͕̠̹̭̗͚̃̂̈́͐̈́̈́̈́͂͑̌͌͜ư̝̹̜̖̫̪̿͗̈́Ķ̷̸͚̦̮͚͓͚̼̘̮͗̌̂͆͐̾̂̀̓͜͝͝oK̸͓̹̰͓̮̝͓͚̗͈̭̺̞̹͎͈̲̯̙̦̈́̏́̈̄̄̋̎̒̅͌͌̔̉̽͒̃͝K͂n̢̗͗̑k̶̭̺Kn̶̡̲͋̅̐̿̌̔̇̿c̵̘̺̔a̸̸̤̘͙̪̪͎͗̍̽̂̐̋̈́̚ã̭̙̭̲̱̒͑̌̿͋̇͌̂͆̌̑͜͠ã̷̵̗̥̟͇̖̫͖̪̮̠̯̬͚̼̐̄̈́̂͌͊̎̔̃̋̂͜͝P̧͚͈͖̭̘̞̪̙̦̈́͗̂̂̎͒̂͑͆͋̅͝e̴̢̫å̼̌͐͘P̸̴t̵̵̸̷̢̛͈̜͎͖̙̫̭͉̭̭̞̂̅̅́͗̈͑͂̀̅̋̌̈́͐̃̾͌̂̋̚͜͜͠͝Kp̸̢̧͕̘̮̫̝͋̈̅p̮()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۣۡۡ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static P̷̱͓͉̀ȗ̶̶̹̜̮uṋ̴̛̭͓̞̘̪̰̭̌̌̌̂̎̐̅̃͘̚͠c̶͉͙͚̎̐͒BK̺̼̠̗̂̍̽̈́ṳ̶̢͎͉̔̈́͂̋̂c̸͈̰̈̑̀̂̎B̶̲̦̎̃̏̂ͅt̨ç̸̛̘̠̺̫̄͑͂̈͑͊̂͋̈́͘B̶̸̨̛̛͓̗̝̯̙̺̋̈͌̐͗̍̍̏̈̿͂̚͜͜͜͝t̶̷̷̸̸̢̛͕̮͇͚͕̺̪̙̩̂̋͗̌̌̂̾̎͋̿̔̈̿̈͌̃̎̈́̋̃͌̈́̈́͘̚͘͜͜͝͝ͅp̂̾ţ̧̨̛̪̤͕͋̑̈̃͌̌̎̿͜͝n̶̴̶̡͓͉̩̦̋̔ǎ̷͉̥̊͘lB̊a̮̯̱̮͗̅̿́͝o̶̱h̸̺̤̭̫̏͂͌͝a̷̵̪̺͓n̷̬̫͕͌͗͌͌̏͗̒̓͋͑̀̍͗̋̕a̗̜̫͂a̶̺̰̻̭̺̥̞̱̘̗͐̑͋͗͗͋̂͐̋̆͜͝͝()I
    .registers 2

    const v0, -0xdc4e

    const-string v1, "ۣۡ"

    invoke-static {v1}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̫̤͙̦̂̃̄̍͘͜͠c̴͎̫̬̠̞̋̈̈́̀͐͜͝͠͠͝K̵̛̼͋̍̌n̵̸̻̠͕̥̂ä̘̬̥͌̏͝oa̴̶̸̧̩̯͈̋̈́͝c̵̛̩͓̗̹̺̦͉̖̼̯̋̑͌̎̿̋̔͒̿̋̌͌͘͝a̛̩̹̹͐̄̓̅͗B͖͓̫͉̔͌oa̤͚̋̂͜ẖ͙a̸̛̛̞̦̫̭̿̋̌͌͋̂̿͘͠K̴̸̷̸̛̦̯̹̺̘͇͎̦̭̉͂̎̏̾̽͗͆̅̂͑̾͗̈́̅̈́̑͘̚͘t̷̷̵̶̶̶̴̨̧̗̗̘͕̰͈̠̱̠͈̺͉͇͓̙̫̮͕̪͎͎̗̝̼͊̿̑̈̋̌͂̽͗̋̍͐̆̈́̃͗̑͗̑̈́͌̒̀̀̌̓͂̄̐̑͒̚͘͜͜͜͜͠͠K̠͈̫̻̲̫͂̎̋̂͒͠a̮̤̫̪̎̃͜o̧u͇P͉ḻ̷̺̲̫̺̦̫̗̺̫̫̫̻̎̂́̈͌͐̽͌͊͗̀̌̽͘͜(Ljava/lang/Object;)I

    move-result v1

    xor-int v0, v0, v1

    return v0
.end method

.method public static P̷̸̶̴̛̛͖̬̪̗̘̯͎͖͕͙͉͎͚̭̺̥͚̠̝̫͎͗̈̅̃̈́̔͑͌͒̂̌̎͘͜͝c͋͗û̵̶̧̫̖̄̍̎̉̂͠a̸̖̗̿͂͝áę̧̟̯̺̮̻̟̖̹͓͒͗̑͑͌͗̇͠͝ḁ̃P̍͑K̗͌̑͘Ķ̛͌̈̐̆ă̶̶̘͓̱̥̙̘̗̭̎̾̑͌̊̍́͑͝K̂͜l͚B̟̮̽͋͗̅͋̕͘ä̸̧̛̛̫̗̱̫̙̖͈͙̈̈́͑͆̋̌͌͌͗͗̃̅̃͋̑͘̚͜͝ä̶̈͌̑l̸̤̮̖̹̃̇͊̄̚͝k͙ó̠̯̖͕͓̲̬̘̾̑̃͜͠o̴̴̮̅͒̂l̷̹̱͖̦̈́̌̿͝͝͝l̄͋̓ḻ̸̛̫̘̹̌̋̎̚P̻̲u̸̼̩͙̩͎͚̎̌̔̋̾̚̕͜͜͜B̶̧͚̗̭͕̥̓̔̄̃͌̚P̶̧̭̥͚̠̈̕ç̷͎͈͕̰̭̀͋͗(Ljava/lang/Object;I)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Landroid/widget/FrameLayout;

    invoke-virtual {p0, p1}, Landroid/widget/FrameLayout;->setAccessibilityTraversalBefore(I)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static P̷̸̷̢̛͎̙̺͗̽̋̂̕͝K̴̭̺͈̺̭͚̭͚̭̙͌͗̀͌̇̒̀̃̀̃̋̍́̆́͝͠a̶̫͒͜a̡̗̲͙͈͚͌̿̑͌̚Ka͈̜͒̋ḧ̙̠́͗͐͝h̶̶̸̴̛̪͉͙̺̯̯̤͋̀̈̒̎͌͋̑͜t̴̸̡̮̻̪͉̺̞̙̘̬̯̂̃̂͘͘͝p̸̫͉͓͙̼̻̭̙̯̥̼͕̋̔͆̈̂̑̀͘͘͜͝͝l̺̼̫͌͋̋͌̈́̆͗̒P̵̟̤͆B̝̪͈̅͗͠ȁ̘̦̙̚͜ä̞́̐ţ̧͕̖̥̈́̈̋̔̂̍͘͝ã̧̭̩̪̯̂̂͗̄͌͋̈͘͠ǒ̷̸̶̶̴̧̺̗̺̺̠̼̦̭͚̙̟̘͈̩͓͉̞̤̭͉̞̥̪̺̗̯̈͌̌̃̔̋̈̈́̏͐̈́̌̑͗͒̐̂̄͗̾̄͘̚͜͠͝o̶̷̥̹̍̔â̧͒͝͝p̨̹͓̝̖̤̺̹̈́͂͗̉̐͊͘͝ü͜(Ljava/lang/Object;I)Ljava/lang/String;
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/content/res/Resources;

    invoke-virtual {p0, p1}, Landroid/content/res/Resources;->getString(I)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static aṱ̲̋̌͌͌ơ̘̥͓͓̪͙͗͌̈͒̈́̐́̊̾́͝n̨̧̢̗͎̗̥̼̗̯̙̰͓͎̂͑̑̈́̈̏̂̾̕͘p̨̼̫̗͓̫̝̔a̶̸̵̸̧̨͓̘̜̫̥̦̮̺̫̥̺͇̼͊̈́̌̃͗̒̐̅̎̃̑̆̌̈́͋͑͋̄̎̋̐̔̂̎̈͘͜͝͠ǎ̲̦̼̫̎̐̑a̸̫̭̼ḩ̶̢͎̦̫̥̭̪̱̺̗͙͕̥̭͇̟̽̈́̃́̈͑̊̂͗̈́̈̈́̍̊͒͑͌̌̍͌͘͘̕͜͜͜͝͝͝͠p͚̪̪̦̘̂̎͗̂̈ỏ̸̸̸̵̸̸͚̤͎̝͈͓̱͉͕̠̝̪̺̫͑̎͗͆̐̀̈̿̅̿͜͝͠t͈͕̮͑̂̈́̑̀̚͜a͋͑K̇e̷̛̫͎̙̼̍͠͝a̤u̸͚K̵̶̢̗͓̗̫̱̖̰̟͉͚̪̱̺͓̍̿͐̆̍̿ä̵̢̧̦̠̘͈̼̰̙͓͎͚͉́͗̃̌̌̀͋̅̈͘P()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۥ۟ۥ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ãph̻͉̯̎̾t̸̸̯̫̋a̦̺͑̈̽̂Ǩ̤̫̈́̎h͎n̴̨͉̦̗̪͈̖͚̻͈̅̈̈̄͂̀̄̀̑̌̋̔̚̕͝͝nờ̧͚̫̪̗̄͋̃̌̾B̧̘̹̌͂͊̽͘͝͝h̴̲͓͝o̵̱͒̑̃a̷̷̧͓̫͈̫͖͚͐̾̌̑̃B̸̸̴̡̦̝̰̤͓̮̪͕̼̞̻̖̘̲͚̩̺͙̗͈̮̘̻̑̓̃̋̌͐͐̈̃̉̌̄̌̋̌̅̽̈́̓̌̈́͗̉̓̚̚͝p̸̧̧̠͚̥̺̑̾͑͝ǘ̷̵̵̴̺̫̪̜͚̫̥͆̎̎̿̆͌̽̑̍͌̚͜͜ḩ̷̸̺̭̩̘͒̅̂̋̓̂̍͜͝o̠̘̦̦͓͌̈͆̿́͐͐̋̎̂͝a̸̧̧̢̺͚̺͋̿̋̀̎͒͋̂͠ͅp̛̙̈̌t̸̴̶̷̴̶̺̰̱̱͖̙̦̃̈́̈̑̎e͗P̸̶̵̢͇̦̼͎͓̯̤͙̗̌͗̑͑̅̅(Ljava/lang/Object;Ljava/lang/Object;)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_e

    check-cast p0, Lcom/kashi/settings/view/BlurBackgroundImageView;

    check-cast p1, Landroid/graphics/Bitmap;

    invoke-virtual {p0, p1}, Lcom/kashi/settings/view/BlurBackgroundImageView;->setImageBitmap(Landroid/graphics/Bitmap;)V

    :goto_d
    return-void

    :cond_e
    goto :goto_d
.end method

.method public static ą̵̴̵̶̴̵̨̧̥̥̘̯̙̖̘͙͙͉̙̯̦̙͉̭̥͓̦̺̲͈̰̫̺̬̯͙̮̄̍̑͌̃̍̏̍̅̔̍̑͋̈͑̀͗̈́̄̋͐̎͑̈́̋͌̂͒̉̈͌̒͊͌̏͒̋͘͜͠͠͝͝͝͝e̵̯̹͉̜͗̏͌̋͗̌͝t̿͑̏̌̚ǎ̴̡͎̮͎̬͓̭̹̤̱̘̋̈̒̈́̓͜͝͝a̶̛͎̠̘̯̼̗̫̜̍̚͠͝͝B͉̒̇͂ç̶̶͓͈̫̫̮͕̺̭͉̦͉͙̗̮͓̂̌̅͑̌̑̑̋̃̿͆̍̃̌͋̌͘͜͜͜͝͠ṷ̗̱̫́̍͌P̧̲̦͇̱̘̟̘̹͎̱̻̟͂̌̂͂́̿̃̄͑̆̂͋͘͜eă̤̌Ṕ̶̨̹̥̠͚̝̝͚̋̌̄̾̈̚ȧ̷̷̧̦̱̠̮̱̾̕͜͜͝B̃̌̈͜ţ̧̖̘̘̲̯́̈́e̶̺̻̤̦͓͚̝̅̃̍̏̋͗͌́͑͘͜͜ë̥͕()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "۠ۨۥ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̋ơ͑ả̺͊͝k̵̸̸̹̠͂̌͜u͇̥͊k̼̏äǘ̷̧̢̢̗̠͙͖̹͕̲̦̰͓̙̯͕͓͗̈́̌̋̋̈͌͂͗̆̂̌͘̚͝ţ̷̶̛͚̠̮̫̰͓̂̆̂̐̂̈́̋̌̑̌̌̅͗͜͠ľ̸̸̸̢̲̯̮̭̝̘̦̟̭̤̮̪͊̈̀̃̾͠͝e̛̘͌̑̾̑à̷̴̸̢͙̮̹͕͎̬̦̥̥̱͓̗̫̬͚̝͉͋̉͌͂̂̾̾͗̋̈́̾͘͜͜͝͝a̸̭͓̾͝l͕̙̋ń̵̸̢̧̩̥͙̭͉̈̒̾̂e̸̸̿̽͌͋̑̎ỏ̷͓̥̫̯̫͖̯͕͎̍̃̈̑̎̾̓̎̂͋̍͠a̸̸̴̴̸̸̸̧̧̧͕̥̯̥͎̗̥͎̯͓̲̥̜̘̠͈̪̋̏̿͑͗̍̋̋̂͜͝͝ť̸̨̖̻̺̥͈͈͘h̛̺͉͕̦̻̻͚͕̘̱̋͌̈́̆̊̈͑͋͂̋͗̓́͘͜͝P̏(Ljava/lang/Object;)Landroid/animation/ValueAnimator;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [I

    invoke-static {p0}, Landroid/animation/ValueAnimator;->ofInt([I)Landroid/animation/ValueAnimator;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ǎ̧̧̧̛̱̮̫̫̫͎͈͕̜͙͖̹͕͎͈͕̫̎̌̾̀̆̈́̎͐̑̌̌̈́̂͘̚̚͝ư̶̸͓̫̲̮͖̫̯̐̉͆̄ť̷̶̡̡̛̫̲̖̰̱̪̭̬̯̺̍̂̂͗̂͋͂̎̎̚͜͝͠͝ǒ̸̼͎̗̱̋a̺ẗ̷̰̈́͗͌̐͘͜a̫̙̫͓͊̎̋̅̾̂̚͜͠͝k̸̨̗̱̺̈́̂̔P̸̸̴̷̸̛̛̬̮̱̈̈̐̽̋a͈B̸̷̢̢̢̢̛̯̞̹̦̼̥̦̭̟̪̮̖͕̘̰͈̻͈̫̮͓͖͗̋̾̌̏̈́̌͆͌̌͒͑͑͗̈́̋̑̌͒̔̚͝͝͠͠͝ͅơ̵̷̷̸̧̺̭̼̈́̒̏̃̾͜͝à̶̠̹̫̖̏̄̄͐̑͠͝͠͝ͅâ̷̴̢̹̭̠̦̬̘̯̼̫̬̬͕̯̿͌̃̄̂̒̽̃̿̎̈͗̈́͐͘͜͜k̀l͓̈͒̏n̢̛̯̈͒̃͝u̸̶̧̨̖̺̅͋͝͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_a

    const-string/jumbo v0, "start logoBlur: "

    :goto_9
    return-object v0

    :cond_a
    const v0, 0x0

    goto :goto_9
.end method

.method public static a̛̤͙̥̐͘k͚̱̦͌͗̂̀͋p̸̺̤̈̿c̸̛̦͎̪̙̫̀͊͐t̷̤̃P̹͈̔̍͠n̷̗̗͈̹̭͜B̴͚̫̋ơ̶̸̸̶̢̫̫̯̖̟̱̻͙͉̗̼̮̙̯̪̭̪͖̲̬̗̩̹̌̾̃͊̇̎̀͌̑̿̎̈́̈́̀̈͑̋̅̈́̋̈́̉̈̽̂̈́̌̈͘͜͝ę̷̺̺̬̦̫̙͎̏̈̇̓͌͌͐͝a̢̧̯̟̻̋o͒̌̾n̦̙̎̔ȟ̴͓̭̱͚͓̖̂͐̌̈́̄͘͝a̧̗̫̙̫͎͗̌̌̍̕K̨̛̙̺̎̎̆͌ac̸̵̦̠͆̋̀̂́ã̸̶̶̢̩͈̦̻̋̑͌̆ͅl̖̄o̤͖̼̻͜͜eţ̴̮̩͉̺͉̫̙̻̱̗̱͕͈̅͌̊̅̈̌̈̀̈́̂͘͘̕͝͝͝hn̶̢͈̠̭͌͜B̧̢̞͓̟͈̥̆̂̃͋̉͌̃͐͂́̚͝n̘a̧͓͐̃͋̃̈́̾̾̅͝(Ljava/lang/Object;)Landroid/renderscript/Element;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Landroid/renderscript/RenderScript;

    invoke-static {p0}, Landroid/renderscript/Element;->U8_4(Landroid/renderscript/RenderScript;)Landroid/renderscript/Element;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static a̴̸̸̷̧̛̫̫̱̥͕̜̭̜͉̙̻͈̰̘̻̫̩̖̦̝̘̤̐͌͗͗̽͐̋͋̈͑̍͗̈͂̎̀̔̈́̌̅̈́͑̍̈̅͌̀̿̄̎̈̈́͘̚͝͝͝͝͠͝P̥h̶̷̴̗̥̼̤̄͋͑͊̾͗͗̄̈́̏͝ȁ̛͚̠̬̰̎̌ͅp̛͚͒̓̀͒ǫ̢͎̇̋͘͘P̵̷̸̶̧̧̛̘̗̫̲̫̦͋̈̈́̎̎̽͐̋̌̏̓̂͋͗͗͘̚P̗̻͉͌̃́̑͜͝a̶̸̴̵̷̸̵̧̢̞͕̤̯̺͙͚̻̺̭̱̮̯͚̫̺̥̯̖̦̯̯̻̦̫̭͚̘͑͑̌̏̊̋̄͂͒̉̓̌̈́̌͌̃̅̾̿̌͗̽̑̃͌̉̚̚̚͜͜͜͠͝͠á̴̸̧̯͎̖͓̪̽̌̿̈͝͝a͌͌͘K̨̧͕͎̹̝̙̇͗̉̄͋̌͊͑̄͐̑̚͝ȯ̶̪a̧̨̤̯͎͓̤̥͋͂p͙̝͎̾̎̌ḛ̢͈̬̀̈͑(Ljava/lang/Object;Ljava/lang/Object;)V
    .registers 3

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_e

    check-cast p0, Landroid/widget/ImageView;

    check-cast p1, Landroid/graphics/drawable/Drawable;

    invoke-virtual {p0, p1}, Landroid/widget/ImageView;->setImageDrawable(Landroid/graphics/drawable/Drawable;)V

    :goto_d
    return-void

    :cond_e
    goto :goto_d
.end method

.method public static a̧̤͈̯̭̭̫̗̤̹̾̀̈́́͂͌̐̆̄̀̂͗͜͝n̸̢̛̫̘̺͎̹͙̙͖̪̗̻̯̰̫̑̈̋̋͗̒̈́͋̄͑̅̉͒̂͋̈́͌̐̚̚̚͝Ķ̴̸̢̛̛̻̱̫̞̰̮͚̼͓͚͐̀̈̋̈́̾̈͗͌͑̑̏̆̅͊͊̅̃͐͜͝ç̵̴̫̟̘̦̯͈͕̺̼̤̹̻̟̱͚̈̀͊̀̈́̐ń̸̶̨̛͈̗̱̱̼̗̫̲̹͌͗̈͌̎̋ȇ̖͕̺a̢̤k̢̨̛̭̟̙̺̖̤̥̘̗̭̫̹͕̩̂́̇͑͊͋̋̔͆͌̍̋͜P̶̶̶̴̨̮̫͕̮̯̫̫̖̥̻̗̌̍̋͗̍̀͘͜͝pt̷̫͓͓̮̾̈́͒̆ä̴̴͉̰̫̿̽̅͌̌͌̂̈͝t̵͈͈̹͚̫̹͎̊̊͋ṷ̸̤̘̫̠̄̃̌̾̎̀̋̄͠͝K̐͗k̭̟̭̥̗͊̃̆l̛̪̗͎̭̗̭͎͋́̂͑͊͆͌͘͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "۟ۤ۟"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ą̯̭̩̥̈́̃͗́̅͜͠Ķ̶̷̧̢̙̙̗͙̘͉̹̦̈́̾̔͐̋͌̔̈̒̑̚͜͝KP̸̷̢̛͚̺͚͑͐̎͂ͅḰ͕ą̶̶̶̴̧̛̹̰̱̮̮̘̫̫͎̘͈̘̥͓͚̘͈̭͚̂̈̋́̈́́͐̈́̂̉͌͊͘̚͝ͅǎ̴͎̋͋͜ͅK̸o̭̎́a͉̹̋͌̈́̂̂͜͝͝l̴̥̯̹̥̦̎̌͘K̎͋u͎͉̗͉͙̓͗͂̈͠p̶̶͓̻̙̮̗̭̑̿̓̊̈̂̅̀͘͘͘͜͠ͅa̶̷͙͎͚̼̋̅͐̉̿͝͝ǔ̴̧̙̬̙͕͉̜͎͙̋̀͜͝c̸̛̮̹̫̆͌͂͐̋͊͠͠c̶̵̥̈̂̒ą̹̔̕͝͝k̚ā̷͊͆̀͝â̶̦̌̋̌K̸̸̡̈͆̈́̎ű̫͖̬̗̿̀͂͗͗͜͝a̶̷̢̩̺̤͓̫̐͐͗͌̌̚B̷̗̲̼̄KK̴̦̅͋̓͝ḧ̵́̑()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۧۧۧ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̫c͋p̧̟̦͘͝ā͘ņ̶̸̶̢̛̺̙̮͈̗̱͎̫̠̱̼͕̞͕̗̞̲̯̭̠͎̗͊̈́̀̾̈̃̎́̋̂͌́̇̔͋͘̚͜͝͠͠u̱̪h̶͓̗̼̗̭p̧͙̱̮͓̐͜a͉̗͎͌͋̕͝o̾o͎ā̺͎͑̂̈̐̓ǫ̪̝̱͈̾̚â̆̈̋͜ǫ̮̤͜ć̠̜̜̞̱̥̻̩̩̝̩̭̖̝͈̄̈́̏̄̔̑̾̍̋͑̚̕͝͠͠ȇö̸̸̧̧̰͎͕̘̫̹̮̮̎͑̌͒͜o̴̢͙̦̾P̵̤̖͖͕̗̋̏̋̊͐̅̌͝͠͝Ķ̷̷̧̛̹̭͕̞̮͙̗̻̭̖̑̾̆̑̑̒͗̈́̒͘͜͝a͠͠ͅK̢̨̯̝̾̔̀̂̏ä̸̷̦̎̆ǎ̋l͙͓͎̈p͐t͓̞͗͌K̵̝̪̘͒́lẗ̸͎̺͚͕̪̥̦͗̋̈̋̈͝e̸͜a̺̫B̛̗̱̺͒̔̂ͅ()Ljava/lang/Class;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    sget-object v0, Ljava/lang/Integer;->TYPE:Ljava/lang/Class;

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̭̋ö̷̢̨̗̹̫͈̈͑͗̂̚͝Ką̴̫̅̑̈́̌̎ḁ̷̸̶̧̛̖̯͌̿̀͘̚͝Ṕ̷̶̷̡̛̯͚̱̗͇̩̥̥͕̮͙̫͎̘͎̫͓̺̎̐̌̌̌̂̎̾͜K̶̩̯̺̱̫̈́̆̋̆́͜ţ̵̢̯̱̺̭̮̯̗̺̼̍̿̈̔̎̈̂̆̎̎̂͐ǘ̴̴̶̴͙̟͎̫͌̽̇͒̅̉̃̂͝o̸͉͆́a̺̫͑̂͋͝ą̸͈̟̼͚̫͙̬͊̎̒̾͝Ķ̵̢͕̙͓͒̌̚͝͝a̸̧̧̝̥̾̒̋̋̎̅ȧ̾̍B̮ù̷̵̴̮͈̯̫̂̃̑̔̇̌̅͂͂͝a̴̶̸̷̢̛̗̺̯̪̱̤͖̰̘͑̃̑̂̓̿̌͂̓̂͝͝ȩ̸̶̴̼̼̤̯͉̹̹͓̘͎̺͉̗͎͉͖̙̖̤̃͋̄͂̈́̅͌̆̋̅͑̕͘̚͜͜͝͝t̨̖̞̄͜͝K̴͕̆͜ą͈̟̥̋͒̑(Ljava/lang/Object;I)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_c

    check-cast p0, Landroid/view/View;

    invoke-virtual {p0, p1}, Landroid/view/View;->setAccessibilityTraversalBefore(I)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜(Ljava/lang/Object;I)C
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_d

    check-cast p0, Ljava/lang/String;

    invoke-virtual {p0, p1}, Ljava/lang/String;->charAt(I)C

    move-result v0

    :goto_c
    return v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static a̷P̶̢͎̪̺̯̌̾͌̽̌̀͝n͚̂͒̕K̪̬̗̍͠K͚̞̯p̵̶̢̧̛͙͎͈̦̤͉̦̋͆͗̃̎̾̆͗͋̿̌̌͝à̢̨̺̗̠̚͠é̶̸̮̖͉̮̱̲̫͎̹̈̈͋̌̀͌͜͝ȟ̸̵̶̡̖̯̙̗̱͕͈͉̲̂͆͒͂̔̈̃̾͘c̷̤̠̠͎̭͕͇̥̅̀̏͗̊̌̎̕͝o̬P̶̢̧̰̹͉̼͑̋̂͠B̵̶̢̗̭͙͚͙͈̖̱̱̩͓̺̱̯̀̇͐̃͒̂͋͑̋̄̌̔̀͆̈́͘͠͝͝t̘̫̂͝ơ̵̷̶͎̪̭͐̃́͂͋̚͜l̹͌̎͗͗̿͜͠Kp̭͓̲͋a̸͕̼̯n̷̗̘̤̞̘͓̱͙̦̩̅͌͑̌̿̂̔̕͜͜͝͝l͌̑͜͝P̵̢̧̛̯͎͕͚̥̮̃̎̌̐͒͒̈́̈̃̋̉͐͝͝͠͝ͅa̸̴͓a̋͠ǎ̸̢̧̧̩̦̥̂̃̈̈́͆͆(Ljava/lang/Object;Ljava/lang/Object;I)Z
    .registers 4

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_f

    check-cast p0, Landroid/content/ContentResolver;

    check-cast p1, Ljava/lang/String;

    invoke-static {p0, p1, p2}, Landroid/provider/Settings$System;->putInt(Landroid/content/ContentResolver;Ljava/lang/String;I)Z

    move-result v0

    :goto_e
    return v0

    :cond_f
    const v0, 0x0

    goto :goto_e
.end method

.method public static a̶̺͈̘͌͌̑͠K̴̸̸̷̮̗͕̱̤͚̺̀̈̅̋̎͂̿͋̈́̚K͜ą̶̸̛͉͖̪̮͚̺̰̫̭͓̫͎͈͚̹̈̋̀̌̿͐̂̚͘̚͠͝͠a̸̴̸̷̸̡̛̛͉͙͙̻̤̻̫̦̻̋́̀̈́͐̅̀́̀̅̈́͐̌̿̊̈́̎͋͋͘͘͜͜͝͠͝a̷̶̶̧̧̧̧̛̬̘̱̫͈̘̗͉̺̹̯̯̰̪̘͑̌̋̌͊̂̀̌̄̂̈́͌̋͌͑̈́̎͂̎͌͘͝͝͝͝ͅB͎̩̺͉̌͒̋̌̾̌͋͜͜n͕̦͗̈͗̎͑̌͝t̛͚͓̪̼̫̫͓͎͉̐̍̈̽̈́̅̍̈́̃͊̍͘̚ę̸̫̭̦̈̾c̰͎̅̐̇͘͠ą̸̮͕̠̻͑̓̌̑͂͌͗͌̈́̚ḧ̞́͋h̶̸̯̦͈̃̐̈̈́̌̀͜K̴̨̛̛̥̤͙̱͉̭̄̇̂̓́͊̅͠K̛̪͈͕͜p̶̛̮̄͌h̛̛̦̘̼͉͂̃̋͑()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۨۡ۠"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ą͖́p̸̴̢̧̛͉̖̦̺͚̙͈͚̠͈̫̬̱̫̱͕̜͉͑̄̌̂̊̈̌͑̅͗͌̄͊̅̎͗̑̋͌̑͋̚̕͘͝͝h̶̦̠̲͓͈̫̱̫̱̭̯͚̬̭̭͕̒̿̂̏̍̌̈́̎͗̾͋́̈́t͚a͆K̭̺̫̝̱͗͌̌B̴̸̴̧̻̗̀̎̉̀͜͜Ķ̵̯̩͖̥̐̈́̈̃̌͠ň̵̼̮͉̬̰͈͈̮̄̊͊̈̌̈́͜͝͠͠B̨͙̦̯̠̊͋̌͑͆̈́̃̽͜͝ċ̛̭̻̪̰̮̐̆eą̴̧̛͇̞͉̥̗̘͗͋̽̍̀͋̂̋̈́̾͗̌̑̐͌hh̵̴͕͙̹̻͌͒͑̚a̯̱̿̄͂ő̶̷̫̺̘͈̭̼̗̭̯̰̰̖͈̗̾͂̿́͌̎̈̅͗̋̃̃̕͜͝͝P̸̶̢̯͙̈͊͌͌͗̏̃͜͝͝ò̘̑̌̋͜Ķ̶̴̸̧̨͈̫̭͚̗͈̯͎̀̍̏̔̋̈́́̕͜͠o͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "۠۠"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̴̩͕͓͌̎̿̈͒͜͠k̵̷̷̷̸̵̸̨̧͕͕̠̦̯̝͎̯̘̜͎̫͉̺̗͚̐͑̎͌͋̅͆̈̈́̔̀̊͋̀̀̈̌͘̚͘͝ͅͅţ̶̷̨̖̖̰͉͈̼̤̍͋̉̌̑͌̂K͕̺p͎̌B̸̴̸͗̇͘̕al̴̥͈̙̹͙͕̄͑͋̍̚ę̗̼͉̭̥̿͑̋̋͘ͅn̷͈̫͖̾͐͠ą̶̴̴̴͎͚͕̖͇̯̼̹̀͐͋̂̃̎̈́̍͌̃̋̚͠͝a̧̮̗̭̍̌e̶̛̟̹̫͚̼̠͋͑̔́̈́͌̇̃̔̿̋̕͝ah̡̥̻̦̹̲̖̲͙̫͓̀̃͐̔́͑̈́̋͜͝͠h̸̸̵̛̩̩̙͎͉͓͎̯̖̋̎̎̋̈́͌̌͝͠͝ư̶̡̢̛͚̌̾̂̿̂̀̄̋͌̋̈́͜͜͠o̸̹̾͌̅̌̈́a̸̸̻͈̮̹͚̗͈̲̪͑̇̌̃͋̎̎̑̌̂͘͝͝a̶̧̛͇̭̭͙̦͌͂͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۡ۟۟"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̶̧̧̫͎̹̭͓̪̻̯͚̘̦͉̘̮̹͈͌̾͗̈̀̈́̃̑̆̋̂̈͘̚͜͜͝͝͠͝a͊̏a̷̤͗ͅȟ̪̫P̌͝u̼͓̙̘̽͆̅P̮̍o̸̧̨̲̞̠̖͈̱̺̥͊̿͑̄̌͆̄̾͒͌̐̋͘͘̚̚͠ķ̸̸̵̲̭̦̬̦̹̠̫͎͕̦̖̭́͐̈͌̈́̿̑̎̚̕͜͝o̧ê̷̴̶̸̢̧̢̫̗͈̻̤̺̫̿͑̌͑̌͌̀͘͘͜ṵ̴̴̫͕̫͚̆̋̈͊͘͘͜a̶̴̧̧̨̛̲̭̯͉̙̘̠̫̫̫̠͚͖͕̗̯̓̂͌̈́̂̈́̂̅̃̂̇̒̍̎͌͑̀̏̿̂̂͂̂̈̉̾͗̚͝͠͝͝a̷è̫̗̠͎̠̋͜B̵̡̠͎̹̫͙̺̘̻͈͋͑͋̈̚͘͝K̫̤̹̭̎̑͊ç̴̴̢̛̯̻̗̲͈̘̋͌̾̌̈́͒̂̾̑̿̏̚͝ú̱̘͌͌̐͘a̸̧̩͌͠()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۥۦۣ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static a̢̜̝͗e̶̫͎̼̗͕͙̭̰̎̿̋̔̂̎̆͗̍̚͠͝͝P͗͌ā̘͚̰̭̫̟͗̂͝l̴̢̢̨̛̼̱̦͕̦̲͖̥̝̈́͂̿̄̿̾̑͝ḩ̧̛̭̫̬̫͈̠̥̮͎͕̺̫̔̿͌̈́̑̀͗́̕̕ä̶ą̌͗͐u̴̯̘͚̯̙͗̃̈́̂͂̊̃̈͝ͅp̴̙̹̟̼̘͈̠̹̦̫̂͒̾̂͋̿̾͘̚͝l̩͎̮͎̄̋̎a̶̴̶̵̶̷̮̱͎͉̱̗̙͎͉̮̫̞͇̐͌̄́̎̾͆̒͌̕͘͝͝ͅB̵̶̷̢̛̭̥̫̫̱̱̮̤͕̥͈̤̗̭̗̠̠̮̯̊̌̾̎̄̂̾̏̿̉̒̋͗̃̚͘͜͜͜a̺͉̖̺̯̫͈̖̦̻̼̩͒̋̋̋̉̌̀͜͝͠͠ͅB̷̙̼̰̮͐̆͌̃͌̆̌̓͊̈͝͝l͎̫̖̉͗̃͜͠n̸̷̵̨̮̹͚̯̹̗̖̆͐̔̾̌̎̈́̑͜͝͝͠(Ljava/lang/Object;)Z
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/content/res/Configuration;

    invoke-virtual {p0}, Landroid/content/res/Configuration;->isNightModeActive()Z

    move-result v0

    :goto_c
    return v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ǎ̸͎̫͗͌͘k̖p̶̞̤͋́̎̐͊̚B̛͇̯̗̌̌ͅa̶̧̨̛̛̦̩̮̭͎̠͚̺̪̼̤͇͉͗͑̈̓͗͑͗̌͗̌̈̄̆̕ą̥̬̺̫̖͕̈́̆̎̓̂̌̏͒̿̎̋̂̌͜Ķ̨̛͖̝̩̫̫̎͘e̛͚͚̯̫̭̺̫͑̈͌̾͌͘͜k̵̸̢̧̧̹̖̯̫͐̈̀͑̋̈̈̾̿͌͜͝k̵̸̻͕͗̏̔͝͝a̶̤̲͚̯̯͓͑͑̑͗̚o̸͙̮͋a̶̷̭͕͋̕Ķ̴̸̶̛̛̤̘̫̙͉͓̯̝̥̮̯̫̻͕̋̊̋̂̎̃̈́͌͌͐̾̾̂̏́͑̑̎̄͜͝͠͝a̐ḙ̈́̌͜e̛̯̥̋̾̿͝P̲̜̃̈́ḁ̭͈͜͝k͎̝̱̩̫̖̄̿͑͗͘͜͝ę̴̸̷̸̴̪̖̪͈͈͎̱̤̰͚̮̘͎̯̭̫̗͌͋̌̔̋̆̿̂̀̓̍͐̋̂̄̋̋̌̈́͘͜͜͝͝͝(Ljava/lang/Object;Ljava/lang/Object;)V
    .registers 3

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_e

    check-cast p0, Landroid/view/View;

    check-cast p1, Ljava/lang/CharSequence;

    invoke-virtual {p0, p1}, Landroid/view/View;->setContentDescription(Ljava/lang/CharSequence;)V

    :goto_d
    return-void

    :cond_e
    goto :goto_d
.end method

.method public static cḩ̫͈̐̎̑͝t̨̯͉͈̱͑̾͗͝P̰̠͕̾̈̀͌̄n̤̺̯̺͗̒̒̋̄͜͠un̸̫͉͉̲̈́̋͠k̶̶̶̨̧̨͓̻͉̠͓̤̱͚̯̭̋͗͊̏̅̀̅̋͋̋͌̚͜͝Ḱ͉̘͎͖̯̫̝͕̥̫̫͋̈̾̀̈͌̐͊̈́̚͝͠n̴̸̢͚͓̮̜̎͜͜oü̸̯͉͉̲̫̗̋̑͋͝ľ̗̬ô̼͓̕ã̪̺́̀p̵K̢͕͚̝̎̈ȏ̺̦͕̹̻̲̼͑̋̄̈́̃ō̷̴̦̗̘oĉ̢͋͌͑̾͜ń̸̨͕̯̺͖͠Ķ̷̔̋͠a̷͌P̷̨̱̪̫͈̻̩͙̤̈̎̀̂͗̋͌̚͘͜K̏͋̿̈ǎt͉̩ę̵̵̷̙̠̗̱̫͎̲̾̃́͒̾̋̃̚͠a͈̺͑̈̑̌͝K̛̫̔̀̋ţ͚̫͋̿B̵̴̸̯͕͉̎̂̔̚͝n̸͚͈̞̯͕̺͗̈̎̂̂()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۦ۠۟"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ç̵̙̫̠̥̮̎co̷̶̴̴̷̸̸̡̫͕̲͎͚̫͕̰̼̘̰̱͎̭̫̾̔͗͌̀̃̏͌̎̋̈̆̚͜͜͝͝oö̢̫̩̱̌͑̆̚p̶̢̛̙͕̤̈̃̋́̑̀͝a̴̝͐h̶̸̵̸̸̷̨̧̧̢̛̯̮̲̮̗͎̱͇̺̺̫̘̱̫͎̋̑̿̈́͊̉͊̍̾̎͊̔̂̾̈̀͋̾̅̈̌̚͠͝͝ͅͅâ̸̸̷͎͓̫̯͕̻̱̫̦̂̄̄͘̕ͅc͑̂̀Ḃ̸̧̙̺͉̭̹͉͉̯̋͊̂̂̄͝͝n͉͎̮̩̽h̪͑̋͗͌c̸̵̸̢̧̙͙̹͉͓͚̭̘̗̦̹̀͐̌̈͐aç̶̮̩̰͚̗̱̐̐͊̋̌̈́͌͘͜͠o̵̶̦͚̥̭͈̺̻͈̹̾̂̔̈́̑̍̆͗̃̌̽̈́͝ỏ͝͝Ǩ̷̶̷̢̛͓̫̝̼̼̼̗͎̹̲̫̤͈̬̫̱͚̭̈̎͋͋̋̄̐̌͘͘͝͝͠ͅa(Ljava/lang/Object;F)V
    .registers 3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Landroid/view/ViewGroup;

    invoke-virtual {p0, p1}, Landroid/view/ViewGroup;->setAlpha(F)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static e̋̚t̶̶̮̭̞̤̫͉̞̥̱̂̐̂͐̃͐̔̈́̈̃͗̍̒͐̍̿͒͘͠͝ë̴̶͉̗̻̺͐͗̃̆͜͠ä̷̶̴̧̢͚̮̲̼̤̓̀̌̑̿̉̚̚͝ȩ̷̷̰͉͕̘̠̫̼͉͓͗̍̿̅̅̈́̍́̂̈͝c̛h͈͐̆͌͠K̜̀͝ͅK̴̩̰̃̂̃͌͌̚o̾̌̚P̶͈̲̍͝ơ̸̱̻̦̫̯͎̹̈́̀̎̑̂̈́̋̆̊͘̚͜͝͝͠ͅţ̵̧̯̭̻̗͙̭̮͎̋̾̀͋̾͂̎̈́ą̸̶͕̱̱̙̩̯̥̗̗̍͋̀̌͂̋͜͝B̵̴̵̟͉̯̥̹̲̙̙̦̠͈̹̤̝̠̱̲̑̽̿̀̽̀͗̈́͌͝͝K̵̷̶̷̶̷̶̷̴̸̨̧̧̛̛̛̪̫̖̺͚̭̗̯̱̲̯͕̦̺̞̪̂̾̈́̋̉̔̌͂̿̅̉̌̋͌̿͆̈̐͊̃̎̕͝͝͝͝ñ̴̟͚̭̦̪͝l̹̇a̫()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_a

    const-string/jumbo v0, "ro.mi.os.version.incremental"

    :goto_9
    return-object v0

    :cond_a
    const v0, 0x0

    goto :goto_9
.end method

.method public static ë͇͕̞B̴̧̧̨̛̮͈̻̭̱͓̫̾̎̈̂̈̈́̈́͗̾̚͘k̴̮͂̕̚o͝a̷̵̗̋͝ĉ̶̷͎̠̤͝͝Ķ̧̛͖̪͚̺̭̫̞̫̠̗̻̺͗͋͌̀̋͂͗̀̌̅͂̀̌̚͠p̢̢͕̮͈̺̻̺̌̆̅̿̎͂̈́̎̾̏͘͘͜͜͜͝ä̝̭̫͎p̴̶̷̸̛͓̼͓̤̼̬̫̫̭͈̑̚͜ṉ̶̴̷͕̼̯͙͗̃̌͊̎̏͘͘l͕̺̹̪̭̫̥̎̈͂̃ļ͉̈́a̢͌B͚͚̭̮͓͈̘̅̀͗̋̾͗̋͗̄̈́͗̀̚͜͝K̸̺̺̭̗̩͕̹̺̎̄͋͋̏̾͌̚â̧̠̰̫̦̦͈͕̖̭̘̤̦̼͋̈̋̀̍͑̾̌͜͠u̱͘K̶͖͉̗͊̃̅̎͝͝a̸̷̢̢͎͉̎̌͘͝e̴̵̢̡̧̛͚̮͕̭̬̱̹̹͙͈̖͙̯̼̹̯̹̗̠͂͒̎̃̈͐̈͒͗̂̎͜͠()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۥ۟ۨ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static hB̸̷̸̶̨̧̢̛̛̛̹͕̩͙̭͉̫̺̖̗̘͎̼̜̻͕̠̺̫̥̟̭̺̲̠̗̙͊͒̔̃͋̂̀͋͌̃̈́̂̄̑̂̂̌̈́͋̍̇̋͌͜͝u͉K̸̢̧̛̭̲̝̮̱̦̾̎͐̊̆̌̊̈́͒̿͗̎̚͝ū̷̸̶̢̢̲̮̮̹͙͙͈͓̖̯̙̪̗̑̾̎̈́̾̃́͂̌͗͐̆̄͗͗͜͝P̫a̸͜n̷̯̗̖͉̭͓͈͎͑̂̄̅̈̈̓͌͝k͕̫̺̈́̿̆P̶̷̶̶̢̧͕̞̺̘̖̺͉͈͖̪͋̅̂͗̃̿̐̒̾̈̌͒͂̂̈̈́̚͝͝͝n̷̨̡̼̮̗̫̫͎̒̈́͌̌͌̾̊̋̃̿͜͜u͈͎̎̐a͎̤͎͗̃̋̋a̴̴̷̸̸̸̢̨̢̛̛̖̼̱̺̺̭͓̼͕̻͚̗̤̺̹͉͙̩̠̿̂̅͗̋̅̋̂̄͒̐̃͐̃͌̑̅̄͂͂̎̌̿̅̅̀̀̿͋̂̚͘͜͜͝a̅͌()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "۟ۥۣ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static h̴̴̺̤̄a̧͝K̟̽͂͌̚ḝ̷̸̨͉̻̫̱̯͎̩̐͋͌̅͜͝B̷̵̨̨̛̺̹͈̮̙͎̈̂̈́̑̐̅͆̓̈́͘̕e̶̮̜̯͎̋̌͆̐͒̃̃̌̿̑̌̋͒ḧ̸̴̶̴̶̶̢̡͎̺̝͈̩̯̬͈̯͇̰͓͕͕̖̯̘̖́͊̌͊͂̈́͌̇̒͆͗̾̐̀͌͌̎̂̾̄͗͋̏̈́̈̎̈̏̌̈́́̾͘͘̚̕̚͝͠en̸̹̼͜ͅK̶̴̸̸̢͈̺͙͓͚̦̼͈̻̗̮͚͓͚̫̅̑̈̅̈́͌̍͋͆̌̾͘͠͠͝͝a̭K̸̺̒ţ̷̫͈̑K̂̑́͝P̶̸̸̢̧̢̨̢̩̤̫̼̪̭̭̫̱͈͈̝̝̦͙̫̙̭̞̜͎̌̆̌̌̃͑̿͌̃̃͑̌͊̚̚͜͝͠ȟ͈̫͈̈̋̂͑̽̈́̇̑̔̈́͐͘͘ao̷̼͙̥̩̹̭̹̹͉͊̔̈́͋̍̂̅̂̑̆̈͂̑̅͜͝c͖̞(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/String;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_f

    check-cast p0, Ljava/lang/String;

    check-cast p1, Ljava/lang/String;

    invoke-virtual {p0, p1}, Ljava/lang/String;->concat(Ljava/lang/String;)Ljava/lang/String;

    move-result-object v0

    :goto_e
    return-object v0

    :cond_f
    const v0, 0x0

    goto :goto_e
.end method

.method public static h̸̸̵̶̢̛̛̛̛̛̖̦͇̺͎̟͙̥̗̞̼͈̥̙͕̘̾͂͌͂̈́͗̂͒̂̂̈̄̋̋̇̎͗̽͗̐̃̋͘̕͝͠͠k̫̺̔͌ȟ̯͚͎̠̠̗͈̜͂̈̈́̆̽̈͌̑͆̾̚͜lu͉̹͊tẽ̤͎̄h̴̺̦̥̦̲̃͋͒͘͝͝ó̸̶̢̧̯̦̺͎͕̙͚̖͈̺͖͐̃̃̎̐̈́͂̾̋̂̈̋͑̑̃͘͜K̻͉t̷̵̷̪̱̂̌̐̋̃̂̃͜a̹͎̱̹̱͌̍̍̓̈́̽̕h̨͋K̻͙̦t̸̷̗̯̮͙͚̝͓̭͓̼̀̈́͋͗̿̋̀̂͘̚͜͝P̸̶̵̢̘͉̗̗̘̺̗̱̓̔̊̈́͗̓̈̋͂̂̑̊̇̆͠͝Kae̹͚̫̙̋̅̃n̸̴̫͈̫̫̭̭̖̼̯̄̂͗͗̂͌̓̋͘ḁ̷̴̴̶̶̢̛̗̗̱̮̫̦̘̫̗̱͈̫͊̂̌̿̋͌̀̾̑̂̽̔̅͘͘͝͠([SIII)Ljava/lang/String;
    .registers 58

    move/from16 v6, p3

    move/from16 v5, p2

    move/from16 v4, p1

    move-object/from16 v3, p0

    new-array v1, v5, [C

    const/4 v0, 0x0

    :goto_b
    if-ge v0, v5, :cond_18

    add-int v2, v4, v0

    aget-short v2, v3, v2

    xor-int/2addr v2, v6

    int-to-char v2, v2

    aput-char v2, v1, v0

    add-int/lit8 v0, v0, 0x1

    goto :goto_b

    :cond_18
    new-instance v0, Ljava/lang/String;

    invoke-direct {v0, v1}, Ljava/lang/String;-><init>([C)V

    return-object v0
.end method

.method public static h̵̷̴̵̭̥̫͙̯̰̺̭̗̲͓͕͆̽̋̍͂͗̎͜͝͝ǎ̧̮͈̘̏̿͗̈́̈͊͜ã̛̠̪̫͓̤̺̭̫͚̞̙͌̂̚͜͜͝na̪͚͙̐̂̑̃̄͜uo̧̞̎ĉ̶̶̸̨̯̲͈̫̤̜̯̦͈̩̲͈̯̗͉̺͎̐̂͌̒̒̈̀̏̄̅̋̌͒̑̄̔̎̈́̑̅̈́̌͘̚̕͝͝ͅt̢͓̘͕͉̝̦̹̐̌c̃͗͐̿ç̷̢̧̹̫͈͈̫̭̭͂̉K̾ç̗̋̋k̡̫̎̋͝K̴͓̅̂ȯ̫̗́̿̆Ba̛̹̗͗̅͜K̅ǎ̸̴̴̶̶̧̼̦̝̱̟̺̯̥̫͖͕͓̪͌͐̋̑͑̈͋̀̎̌̑̂̑̌̃͗͗h̖̅͒̔o̲̬͘ķ̴̸̶̶̨̢̥͈̗̫̤͕̙̯̰͕͙̟̞̙̮͎̩̯͎̮̜͓̱͈̤̺̩͈̍̈́́͑̆͋̿͋͋̈́̈͆̌̅̈́͜͜͝͝͝ā͓̏́(Ljava/lang/Object;)Landroid/content/Context;
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_d

    check-cast p0, Landroid/view/View;

    invoke-virtual {p0}, Landroid/view/View;->getContext()Landroid/content/Context;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static k͎̐ơ̵̧̜̔̑̆̈K̸̸̢̨͉̯̫͎̫̭̮̘̠̞̋̾͂̑̎̈̌͌K̷̠̗̗͎͉̫̔͌̆̆̂̾͌̋̈́̈́̚͜ö̸̵̲̯̺͙̗͈̝̼͕͎̼͈́̔̾̃̌͂̎̑̚͘͝͝a̲ù͒ȩ̢̧̫̼̑̌̍̾K̑ü̶̙͈̮̫̃̇͗̾̈́͘͜P̷̴̷̴̡̧̛̛̛̬̥͉͌͌̑̈́̆͒͗̎̀ņ̸̶̸̻͈̩̥̻̩̻̃̂̀͌̈̋͋̅̆̚̚͜͜͜͝P̸̸̸̸̨̛̯͎͈̱̫̟̘̩̯̟̋̂͒̎͐̈̌͋͂͆̌̏͒̿̂͋̋̂̈́̿̑̾̚ͅć̵͙͙̙̫͓̯̙̦͒͂̏̎͌͝͠͝͝Ķ̫̝̗̅̎̂̚͝c̷̖̤̈́ą̵͗͐eư̛͓̲̼̮̯̗͙̭̘̱̯͖̖̞̟̩̯̫̭̈́͌͒̌̌̾́͘͜h̼̿̂ō̴͕͎̼̤͈̗͓̹̑̇͐̒͘n̯̾̑͝(Ljava/lang/Object;)Landroid/graphics/drawable/Drawable;
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/app/WallpaperManager;

    invoke-virtual {p0}, Landroid/app/WallpaperManager;->getDrawable()Landroid/graphics/drawable/Drawable;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static l̷̛̹͓̭͉̝̹̔̌̌͆͜B̵̻̮͙̯̂̈́́͐̕B̈̋̋͌͌͠B̷̦̮̺̺̗͗̎͗̓͒͘a̤Ǩ̨̧̗̹̭̾͌ô̷̗͗ļ̛̹͓͎͚͚̥̗̟̫̗͗̎̑̇̈̃̐͗͒́̚͘͜͝l̵̑̍͜l̲̰̙̭̗̗͒̑͝K̵̛̻̱͎̞̑e̛̚ä̴̸̴̷͎͖̥̦̫͙̥̱͙̥̬͚̖͓̻̯̝̑̏̆̑̌̀̈́͂͌̅̑͜͝u̷̡̩̺͎̦̘͋̉̐̀̃̄͑́̋̚͘͝͝â̫̱͈͎͈̭̯̺̔̀̃̑͐t̂͝c̐̂ȃ̵̛̼̠͚̪̩̗͈̐́̃͂̊̕͜͜͠o̧̱̱͈̲̫̪͌͑̊u̴̧̧̺̍̾͝t̶̢͉͈̜̎̋͜n̛̥̪̜̩͓̻͉͈͌̌̈́̂̀̎̂̾̋̈́K̫͕n̶̸̵̨̡̧̧̢͕͎̺̦̱̦̬̫̟̯͇͓͂̐͐̀̈̀̋̾͐̐̃̏̚͜͝ͅ()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۥ۟ۡ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static l̶̷̷̶̸̸̢̧̧̨̧̛̼̮̘͚̗̯͕̖͇̹̩͖̍̇̾̏́̈̈͗̈́̈́̊̃̍̎̾̎͗̆̀̑̃͌̑͆͘͜͜͝͠ͅa̷̧̘͙͇̹͆̑̒̚̕B͈̙̘̫̻̈́͗͋̾͗͠͝͝͠͝h͈̫̤̠͗̑͋͋̌p̸̢̛̭͕̯̮̗̾̐̇̏̒̑̽̆̋̈́͜͜͠͝a͌̑͗̀̄͠͝K̸̢̧̛̪̖͓͚̺͚̫̫̫̞̭̫͚͚̫͕̺̑͐͒͗̾͋͗̈́͗̑̾̌̂̀̍̄͌͋̅̚̚͜͠͝ơ͚̦̻̺̾̾̋̋͠o̴̢͉̖̫̤̖̯̾̋̈͘͝͝ͅK̶̛̥̘̮̯͎̖͎̦̂̀͋͐̄̋̋̒̍͘ő̦̮̱͚̎̂͌̂̐͝ǔ̶̸̴̟͉̫̥͎̱͋͑̂̀̄͋͘͝͝a̰̎a̧͚̻̜̭̩͗̈͐̆͜͝͝aB̗̲͈̖̪͋à̜̪͂̆ĥ̲̥̂̿̂͗̍̕͜͝ḩ̫͙͊̎̌(Ljava/lang/Object;)Landroidx/fragment/app/FragmentActivity;
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_d

    check-cast p0, Landroidx/fragment/app/Fragment;

    invoke-virtual {p0}, Landroidx/fragment/app/Fragment;->getActivity()Landroidx/fragment/app/FragmentActivity;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ļ̷̵̧̢̪̖̪̫̘͖̱̠̪͎̭͚̻͌̋͗̅̈̄͌̈́͋͑̎̑̊̈́̚n̸̸̛͕̦͉̗̗͕͙̥͚͉̻͉̄̿͊͋̌̎̔̇̈́̇͋̀̐͜͠͝k̶̛̺̝̭̑̋̿̌̚a̶̦͈͎͖̹͑̋͋͗̆K̸̴̶̹̱̫̬̄͗̌̂͋̇̄͗͜a̷̼̻͓h̸̯̉̾̓͑B̴̭̟͉̌͌̎̄̀a̭͝K͎̋̾͑̑̂̚â̢̗̭ͅṕ̨̮̠͈̗̖̋c̸̡̠̼̗̲̦̼̫̦̺̋͋̓͐̐́͘͝p̶̶̭̺͚͓͙̙̫̫̠̂̂̿͜͜͜͜͝o̢̧̧̺̙͈͎̭̠͑͂̍c̵̆cơ̸̸̴̷̴̷̡̧̹̹̬̩̜̯͚͚̪̝̫̦̠̥͈̫̱̞̝͙̞͓̫̈̆́̌͋̔̂͗͑̏́̂̃̃̏̂̏͊̄̿̋͜͝͠ą̶̥̞̖̟̼͈̑̾͐̌̎̈́kK̷̷aõ̧̲̥̫͑̽̂̃͌͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "۠۠۟"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۣ۟ۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static nB̷ǎ̷̵̷̧̲̼̰̮̹̹͉͇͎̻̮̞̗̻̎̄́́̈̽̏̉̾̔ô̵͕͌̑͜l̦̭̆̑̌á̷̞̮͙̮̱̭̯͕̟̎̀͗̂̒̋͜͝͠͠ā͉͈̱̫̖̑͂̓̋͗hh̷̢̘̪͈̘͈̫͐̈́̌̽̌̈́͜͝Kh͎̋̈͝ca̶͉̙͙̭̠̥͕̭͕͈̔̏̋̌̚͜͠ĉ̵͚͘ǒ̷̶̙̙͓ȩ̶̫͉̺̭͓̰̞̭̝̗̀̈͗̍̎̋̂̕͜͠k̥̱̽̌̈́̂B̧̺̫̻͈̋̌͗̓̒̂̏̈́͜o̲̫̱̔́̄̂̏̈́̈ą̴̴̴̸̛͉̯̖̪̫̼͚̩̫̗̙̫͙̦̰̘̙͎̘͓̫̫̻̎̑͗̏̋̈́̈̌̌͌͐͆͂͐̔͑̈́̐̐͘͘͘͜͜͠͝tṱ̷̷̫̮̏p̦̗̖̭̑̆̏̃͗K̶̛̰̮̲̩̭̭̯͈̝͈͌̂̽̄̈͜͠B̶̶̭̋p̴̴̔͒͗͌̽͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۥۢۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static n̴̵̷̴̶̷̢̧̧̧̢̧̡͚̮͙͎͙̩̭͎͎̥͉͎̜͓̥̺̱̂̍̿͊̃̏͑̎̿͐͌͐̌͆̋͂̃͗͒̈͋̅̊̑̎̅̅̾̏͗͗̈́̚͘͜͝͝P͙̆̐̌̅̌͝͝t̻͚̫͉̔̌̂̈́̕o̷̶͓̮̞̖̫̿̂c̸̷̶̯̄̒͌͐̎l̂̎̿̑̄͘a̴̷̧̡̼͈̭̖͕̫̯B̃͘Ķ̶̸̴̧͚̮̘͖̐̔́̏͘͘͜oa̹͕̮̱̱̩͓̬͌̌͒̀̎̈͌́̏̀͂̅͝h̴̢͚͈ä̸̧̫̱̼͝K͙̼̺̘͙̫̈̌́̀̋̄̚͠͠e̎P̅ā̬̬̉̍̓̐̉̚͝ć̸̸̢̛̻̭͈̦͐͂̌͑͠͠u̵͕̦̒͋̉B̠̪l̹̮̼̃ḽ̸̵̸̡̧̢̮̝̫̝̻͈͚̥̗̹͓̱͕̫͓̠̼̋͐͌̊͑̂̎͆̃͗͋̾͌͌̋͂̽̂̂͗͋̑̈̈́͘͜͜͜͠͠ͅ()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_9

    const-string v0, "ۧ۟ۧ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static n͚̗̫̱̩͕̫̄̐̃͌̾͝K͈͎͙̐͌ḩ̠͙͗̌̎͘͝p̶̧̢̭̰͎̲̱͎̟͓̤̥̙̎̆͑͗͌͗̚u̶̷̸̷̴̧̢͉̖͙͈͈͕̻̺͖̦̹͈̦͚̟̩͉̬̱̤̎̌̽̌̌͒̈̿̌̋̎̎͒̿̅̈̆̆̈̈́̌̔̄̏͋̄̚͘͜͠͝͠͝ͅpc͖̩̘̻̭̮͆̿̅͐͌́̌̑̆k̲̝̈̈́͗̉K̴̭̜̭͉̈́̈́͂̽͋̑̑͋̍̈́͘a̸̛̫̫̙͈͈̯̙͙̙͇̙͂̋̇̊̆̅̃̌̈͂̋̋̎͝e̛eh̸̷̸̶̛̺̹̫̘͎̬͚̠̩͋̐̾͗͆k̶͓̩̥̹̱̲͓̫̈́͋͋͆̒̇̇͑͒͑̈͊͗̚͜͜͝ͅc̸̴͙͉̥͕̗̦̋̂̃̂͋̐̇̄̀̈͗̾̎̈́̚͘̚͜͜͜͝͝at̟̚ú̸̘̝̺̺̹͈̮͋̔̂n̸̸̫̭̙͚̂́̃͂͐͘ä̀o̧(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/String;
    .registers 3

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_f

    check-cast p0, Ljava/lang/String;

    check-cast p1, Ljava/lang/String;

    invoke-static {p0, p1}, Landroid/os/SystemProperties;->get(Ljava/lang/String;Ljava/lang/String;)Ljava/lang/String;

    move-result-object v0

    :goto_e
    return-object v0

    :cond_f
    const v0, 0x0

    goto :goto_e
.end method

.method public static ňē̶͚̪̻͖̄̄̌͆̈̃͜͝p̶̴̸̧̡̛̤̱̫̭̰͉͖͎̯̺̤̖͓̰͌̑̈͋̈́͌̅̈̈͌̒̐̀͋̕͜͝͠͝͝K̷̸̛̤̱͓̪̫̟̟̺͉̻̤̯̑͒̾̾̋̋̏͗́̋̈́̔̎̐͋͘a̴̷̫̘̥̿͐̈͘l̫̭̫͋̉́͌̃͜ͅǨ̸̴̥̫͓͚̯̱͚̘͕̖̗̹̇̎̌̆̎̈́̋̈́̑͑̋̕̕͜͠o̸͎̲͐̃̚a̸̵̧̛̝̮̻̻͉̜̮̤̭̙͋̅̋͐͗̂̆͌̔͋̎̒̃͝ǘ̯̌pă̷̠͈̽͝ǎ̸̛͓͎̖̯̩̉́͜h̶a̧̻̫̍͑̂̾̍̚͘͜͝p̩̥̑͂̕͝a̬kǩ̸̢͕͚̤̥̤̙͙̌̋́͋͘̕͜ö̸̝̲̟̩͙̤̦͎̪̑̽͗̒͝a̶̙͖̺͙̙͗̈͐͌̈͑ĉ̷̸͙̺̫̥̤̺͉̗̎͌̿̅̏͂͝͝͝t̞̯͙()Landroid/os/Looper;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_b

    invoke-static {}, Landroid/os/Looper;->getMainLooper()Landroid/os/Looper;

    move-result-object v0

    :goto_a
    return-object v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static n̘uaP͉̰͓̙͎̃͘͝ȅ̛̮͎̘͙͈̯̯̭̺͈͈̔̈́̌͋̾̅̍̚̚̚͜P̨̛̻̯͚̪͖͙̄̆̒̂̿̀̂͜l̸Ķ̸̛͉̯̰͕͙̯͕̫̗̫͗͌̈́ͅk̸͓͙̥͈̿̌̓͑t̴͚̦̯̎͘͜͝K̢̧̛̥̭̥̬̠̖̙͎̮̯̩̫̪͌̈́̈̔̐͗̅̕̕͝͝ͅa̸̹̮͚͓̯͈̩͌̈̅̐͜͜P̷̷̸̨͚̘̺̱̺̯͓̏̿̌̃̆̕͝p̸̶̸̶̗̫̺̗̺̭̘̱̼͈̩͓̮̭̼̫̺̋̑̈́͆̿̇̈̂͐͒͑͊͒̋̋̂͌̇͘͘ļ̶̨̮̎̂̾͘͜͠ǫ̡̛͚͎̱̥̫̯̰̎̈́͌̒̈͐̈̋̾͘͠K̨̢̯͚̩̆̆̈̎̄̃͘ť̫̗̗͙͑͜hu̡̚Ḱ̢̛͚͓͘l̲̫̗̍͗̿͘͘͘p̷̶̰̥̘̖̂̈́̋̈́͒̋͘̕͜u̧̺̲͊a̞̫̖̲(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Landroid/view/View;

    invoke-virtual {p0}, Landroid/view/View;->getId()I

    move-result v0

    :goto_c
    return v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ñ̶̨̘͓͚̃͆͆̌̌̑̋pp̴̧̱̬͕̻̹̘̦͙̙͉̘͕̗͌̎̈̋͗̿̋̈́̀̊̂͜͠p̷̢̭̲̫̯͇̑̈́͝ĺ̸̢̫̥͎͉̥͚̭̹̙̪̘͌̀̆̈̄͌̑̋̿͂͐̌̂k̸̵̨̻̗̗̱͕̫̫̺̈́̔́͑̾̑͒͘͘͜͜͠͠͝Bp̷̖̲ả̢̦̲̺̔͒̔͝a͆͝ề̗̥̯̖̮̫͎͈͓̗̺̮̺̮͊̈́̀͊̍̆̈́̃̂̚͜͝a͝t̹̾͒̿ȯ̫̦͈̫̻̯̯̑͜͝č̸̶̨̠̘̺͎̱͚̼̜͈̘̙̭̱̯̥̂͑̂̄̈̈̌͊͌̔̈̾̆̾͘͜͝ch̫̗̼͆̀̌̋̈͘ȟ̴̶͉̱̫͓̩̗̗̦͇͚͎̘̫̏̔͠ͅḴ̲̯͕̝͓̫͎͉̐̃̊̌̔̅̅̽̂̄͘͜͠ķ̸̴̈́͑ư̸̴͙̻͙̄̔ö̧͚́͗P̸̸̘͋̂͂̈́͗͜͝K̈()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "ۨ۟ۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static n̨̡̯̝̘͑́͆͌̌͗͜pp̸̛̘̫̯̺̺̝̔͋͐̎k̘̱̥̹͕͉̂̈́̈́̋͑͘͝͝a̸̡̛̛̯̗̗̜̮̺̬̲̺̦̰͎̞̯̾͋̾͊̿̋̐̍̅̄̓̂́͋͂̆̊̌̋̂̓̎̚͜͜͜͝ţ̻̔͗̾͝ö̧̤̘͕̱̻̰́̆̋̿͗̃͗͗͗̚͝Ķ̷̧̫̗̤̬̩̹̦͕̙̗͓̈́͌́͗̇̿͊̋͆̃͘͜͜͠a̶̼͂͝ū̸̷̢̫̗͎͈̰̫̮͚̙̿̈͑̕͜ļ̵̷̸̗̘̱̘͇̻̫̯̩͕̰̐̽̾̈̀̈́͋̎̂͌̒͘̚ͅe̶̵̯͉̫̾͌̎͗̚ë͈ḁ̹̊͗͜ͅao͓̫͚͘͝c̸̴̷̷͙̗͎̦̙̍̂̂̏͑̔̋͘͘͜͝t̛̼̚k̰͚̀̆̎͠k̸̛̼̮̫͈̪̖̰̅͗̈̐̋̂͝ļ̴̧͈͈͓̭̜̆͜K̢̯͙̤̫͒͂̈́͆̑̈̑͜͝(Ljava/lang/Object;)Landroid/content/Context;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Landroid/content/Context;

    invoke-virtual {p0}, Landroid/content/Context;->getApplicationContext()Landroid/content/Context;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static oa͒̾l̺͎̗̋͑̕a̋c̶̨̏̋ą̸̷̶̴̨̛̻̯̯̼̗̗̩̫̖͈͒́̆̋̑͗̌̌͑̍̃̓̿̓̐hļ̵̴̸̛̰͙̺͉͖̺̰͕̐̎͑́̅̅̃̋̂̃̿͘͜K̵̵̴̢̧̨̛̖̗̠̼̦̯̘͚̼̻̰͚͂̆͑̎̂̌͑̂͊̅͌̌͗̓̈́̃͝͝K̷ḧ̡̧̢̭͇̱̙͉̘̼̤͎̃̌̌̽̍͌̃̎̕͘͜͜l̶̸̛̹̺̥̱̮͈͑̾̏̽̂̌͠u̴̶̸̿̌͆͂̿͝ͅP̶̷̴̷̵̧̛͉͕̠̝͎̰͓͖̫̹͎̥̼̋̀̋́̋̈̑̃̿͆̔̾͌̾͘͘͜͜͜͝p̸̱͊̍͊͊̆̿̇̚͜ò̴̷͈͓̖̗̫̂͐̍̂͒̌̋͜͝K̥̺̝̫̘̲̈́̾͗͜Ǩ̴̢̡̲̙͎̝͇̏̉̌̆́͒̒K̶̢̨̛̺̮̰͈̥̗̈̅̌͌͗͒̑̅̃̆̂̎̑͝ŭ̀(Ljava/lang/Object;Ljava/lang/Object;IIIIII)V
    .registers 9

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_e

    check-cast p0, Landroid/graphics/Bitmap;

    check-cast p1, [I

    invoke-virtual/range {p0 .. p7}, Landroid/graphics/Bitmap;->getPixels([IIIIIII)V

    :goto_d
    return-void

    :cond_e
    goto :goto_d
.end method

.method public static õ̻ȁ̗̫̖͉̬̦̬̱͕̎͌̈́̑̌̌͑̃͜͝n̘̥͗̈ṵ̸̢̠̦̭͙̎̐̎̓͜e͚̙̯ĺ̴̷̷̲͈̙̥̼͉̥̙̂̋̾̈́̀̌̉͋B͕̙̄͌̋͌̓̃͘h̶̴̷̨̧̛͉͓̻͈̫̘͖͈̫̱̖̲̙̯̏̀̀͆̍̂̌͌̌̽̔̍̌̾͋͜͝͝͝B̧̥̋̈́̈n̸̗̜͇̦̱͙̞̭̞͑̐͋͜c̴̷̸̷̶̸̸̨̨̢̭̮̩͓̪͈͓͚̭̺͉̱̮͚͌̋̈̏̇͌̈̈̾̀̾̂̿͐̅̈́̈́̈͌͂̊͑͘̚ͅc̨̢̫͕̤̟̫͈͎̫͚̫͎͋͆̂̅̌͒̔̈͌́̋̒̔̚͠ͅn͈͉p̷̧̪̜̯̤̹̤̭̿͌̌͗̔̈́͆̈̃̈͌͌͘̕͝p̷̯̗̘̽͊͗͠ţ̶̯̱͎͓̦̫͌͋̈́͑̉̚̕͠k̴̸̷̴̦͉̫͓̂͑̍̊͘ͅu̶̬̻͚͎͒͋̑͋̋̃͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۣۨۦ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ơ̶̷̴̧̧̟̠̘͎͖̬̯̈̈͋͌̏̈́̈̅͌̿͗͊͝ḁ̷̷͈͎̪̺̫̱̹͈͙̮̲͋̄̈́͋̍̌͋̿͜͜͝͠͝͝ͅh͝h̴̷̸̸̷̰͈̗̪̺̯̫̭͌̈͗̌͌̑̅̇́̄͌̈́̾̌̾̍̿͊̀͑͜͠ŏ͕͊͋o̢̮̱̹͐͗̾̌̈̚͠͝͝ǎ̼̯̬̤͎̩̼̭̲̗͚̪̖̥̬͕͒̌͋̈̏̾͋̃́̃̋͜͝͝a̧͊̐͝t̨͉̀̒̌̎ļ̴͎͚̙̺̦͗̇͊̅̈́̃͑̓̿́̑͘̚͜a̱̫̋̚͜͜k̫̟ẽ̸̴̸̵̫̖̜̦̎̔͑̈́̿̚t̷̶̛͚̙̘̫͉̘̔̍̆̉̌͒̏̂̽͘u̲̙͎̎̽͒͂c̢̫̯̭̈́k̭ã̑̀ư̷̸̸̹̖̦͎̲͉̦̫̺̪̹̯̠̫̲̤̑͋͊̊͌̒̍̄͗̀̑̋̽̅͌͋̂͌̐͌̑̂̒͆̑̂͐́̆̽͠͠k()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۨۡۨ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static o̸̦̫̲͕̜͚̹̦̲̍͋͊͋͝k̹̫̖̫̱̞͓̐̈̍́̈̋̾̔̕͘͜ͅB̴̶͕͙̥͈͐͂͗͗͗̀e̱t̷̷ȇ̴̵̮̱͙̋̄͐ļ̫̗̰̖̯͈̤̩͉̫̦͌̇̆̈́̀̎̍͋̈́̋̀͜͝oK͕̻̯e̜h͙͙͎̘̾̌̄͋͝͝ͅͅa̛̻̫̲̫͉̎͝ơ̸̵̶̶̸̸̸̧̧̧̛̟͖̯̗̭̪̗͓̦̗̪͎̪̈́̈̌̏̈̂̎́͑̅̏͊̒̈͒̚͝͝u͈̥͌͑͜p̵̨̫̭͓͙̈́̃͗͌̈̌͘͠ö̥a̶̬̥͎̘̲̰̯̮͈̋̐͗̏͌̈́͌̌̆̅͘͘B̸t̠̀̂o̷̷̢̮̗̯̫͙̾̌̋͆̋̎̌̄̎̋̀͌͜͝c̷̶̶̶̸̨̢̧̨̢̲̯̫̺̯̻͖͇̎̂̇̅̿̋̆̋͘̚͘͠à̶̸̢̯̺͚̱̮͊̓̂̚K̷̛͌̂͜ͅǒ̧̩̫̤̿͑͝(Ljava/lang/Object;)Landroid/content/Context;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Lcom/kashi/settings/view/SpecsTextView;

    invoke-virtual {p0}, Lcom/kashi/settings/view/SpecsTextView;->getContext()Landroid/content/Context;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ơ̸̖̗͈̰̥̝̌͋͋̋͠Ḵ͝ļ̹́̏͑ḁ̵̸̴̶̶̧̛̱̤͚͈̤͉͓͎͓̹͈̯̼͗̋̆̂̅̈́̾̐̑͗̾͋̿͐̄̐͊̈͘͘̚͜͜͜͜͝͝ͅǫ̸̸͈͉͈̋̔̾̾͗̈́͗͘͝tB̧̢̨̛̹̼̦͚̥͈̤̖̭͌̉͂͑̂͑͗̌͌̕͝͝͝ḧ̴̗͓̺̹̯̹̫̭̱̗̱̾̉̾Ķ̷̴̮̖͉̒̈́͋͂̕â̸̦̫̱̫̱̕̚ä͓̦̦́͜͝t̀ç̸̸̨̢̛̹̩͓̩̮̬͙̖̝̫̱̘̺͈̤̯̦̯̫̯̐͗̉̿͂̓͌͂́̑̍̋͋͗̀̍̈́̋̆̌̿͜͝͠͝P̶̵̷̸̴̛̛̹̖̤̤͙̫̘͚̘͚̘̯̄̑̽̅̋̂̋͌̎̔̈́̈̌͌͌̈͗̾͘͜͝t̸̸̺̘̲̖̫̥̰̙̼̾̉̽̓̑̾̑͌͋́́̌͌̓̋͗̚͜͝͝a̵̯̮͎̙̜̲̾͜(Ljava/lang/Object;)Landroid/content/res/Configuration;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/content/res/Resources;

    invoke-virtual {p0}, Landroid/content/res/Resources;->getConfiguration()Landroid/content/res/Configuration;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ơ̴̧̩̫͖̹̤̦̫̭̦̫̋̍̑̂͑̐̾̈́̃͌̂a̶̷̢̫̫̠̭̹̯͉͂͆̃P̴̹͚̮̎̿͝P̷ű͚͓̌̊͂͜ā̢̗͈̎̑͜a̢̫͌̈̆̀͗̅̾e̸̫k̥̻̫͑͗̈́t̸̼͈̯̦͌̎̃́͝͠P̵̨̛̱̭̯̖͉̦̯̾̈̂͑͌̆̋up̸̶̢̧̛̛̭̲̫̮̯̭̹͓̮̙͎̹̭̐̌̌͗͗̑̋͂͒́̇͜͝ň̷̶̷̶̸̶̸̢̡̨̥̖̺̯̠̗͚̥̫͓̰͚̖̖̥̖͓̫͚͕͈̂̔͌̈̎̆͌̉̅̿̃̈́̎̌̚͝͝͠͝ͅK̷̴̷̸̸̢̧̧̩͓̫͎̭͕̗̗̭̺̗͕̖̫͈͎̹͎̺̹̲̘̫̦̫̾̇͐͋̔̈́̀̽̑́̈́̍̔̃̈̀̋̅̀͗̋͗͒̎̐̎͗̑͘͘͘͠͠c̶̷̷̷̦̫̭͈̯̫͖͎͕̰̺͗̂̌̌͐͜͠͝e̢͈͙͂͗̄()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_a

    const-string/jumbo v0, "setting_About_phone_update"

    :goto_9
    return-object v0

    :cond_a
    const v0, 0x0

    goto :goto_9
.end method

.method public static ò̷͝o̴̸̸̧̡͕͚̥̥̮̫͙̩͖̫̿͂̋̏̂͗̉̀̏̑̈͘ȁ̸̸̸̴̢̨̛͈̲̺̫̫͓͚̊̂̂̃̂͊͗͘̚͘n̆͘a̢͘l̛͚̗̈̋̎̕ö̵̧̭̭̰̗͈́̾͒͌̌̚̚̚͠B̛̜́B̶͚̰̗̩̫̘̈́̽͐̋͐͋͒͆̄͗͂̈́͆̎͘͝a̷̪̻̅e̢̼̗̱̗̫͕̠̖̩̗͒͋̈́̂̌̃͋̈́̈͌̅͗̃̉̐̚͘͜͜͠͝p̸͖͚͚̖̤͗̆̌̆͠u̖̱̗̿̄̃͘͝K̸̢̦͎͓͑͂̃B̸̶̸̧̛̘̪͙̫̐͗̈́̍͂̎͒̈͂̋̅̋͗̄͗̈̐̅̚k̵̴̸̷̢̛̯̗͉͎̫̙̦͙̲͓͚̻̻̂͒̂͋̏̋͑͗̾̑̈͊̂̃̋͂̉͗̐̌͌͝͝a̿̔kh̭̱̥̻͋͗͘a̫K̛̀t̸̯̘̠̹̭͐ǫ̵̮̬̬̪̫̞̦̭̗̯̌̀̎̑(Ljava/lang/String;)Ljava/lang/String;
    .registers 60

    move-object/from16 v8, p0

    const/4 v1, 0x0

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǒ̥̼̲̠͚͈͉̌̈́͌͘͘͜ą̶̧̘̩̫͉̯̰̤̯͈̭̮̗̎͊̿̄̃̈̌̚͘h̺̩̫͚̑̈́͋̈ĉ̷̸̴̲̫̲̱͎̌̌͋́͠͠a͖̮̒a̭̯͊̂̓͗͌͘l̶̦̱̠̹̫͋͂͂͊͋͂͗ȁ̶̴̷̧̢̛̤̗̺̥̗̥͚̘̭̘̽̎̐̄͋̒̌̌̈́̑̎͜͜͝͝P̷̢̞̖͕̱̺̟͎̫͚̼̬͎̬̘̤̺͗́̈̈́̈̈́͋͊̌̎̌̈͆̏̃̎͑͘͜͠͝K͓͑͑̊p̫̋͋͘k̷͚̭͚̻̅͌͂͗ŏ̸̴̶̢̨̯͚̭͉̮̫̗̫̫̪͕̹̎̄̊̂͘͝͝c̶̴̢̡̘̰̟͙̰͉͚̭̱̗͎̹͚̫͋͌͌̂̋̋͋̌̂̌̌͌͠͠h̶̭̲̦́́͌̈́̒̑ơ̶̴̷̫̘͎̠̼͎͊̋̏̉̋̈́͊̿͑̈̌̈̕͝ȟ̵̸̡̧̥̮̫̟̘͉̰̙͉̪͊̐̓̚()Ljava/lang/String;

    move-result-object v3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǒ̥̼̲̠͚͈͉̌̈́͌͘͘͜ą̶̧̘̩̫͉̯̰̤̯͈̭̮̗̎͊̿̄̃̈̌̚͘h̺̩̫͚̑̈́͋̈ĉ̷̸̴̲̫̲̱͎̌̌͋́͠͠a͖̮̒a̭̯͊̂̓͗͌͘l̶̦̱̠̹̫͋͂͂͊͋͂͗ȁ̶̴̷̧̢̛̤̗̺̥̗̥͚̘̭̘̽̎̐̄͋̒̌̌̈́̑̎͜͜͝͝P̷̢̞̖͕̱̺̟͎̫͚̼̬͎̬̘̤̺͗́̈̈́̈̈́͋͊̌̎̌̈͆̏̃̎͑͘͜͠͝K͓͑͑̊p̫̋͋͘k̷͚̭͚̻̅͌͂͗ŏ̸̴̶̢̨̯͚̭͉̮̫̗̫̫̪͕̹̎̄̊̂͘͝͝c̶̴̢̡̘̰̟͙̰͉͚̭̱̗͎̹͚̫͋͌͌̂̋̋͋̌̂̌̌͌͠͠h̶̭̲̦́́͌̈́̒̑ơ̶̴̷̫̘͎̠̼͎͊̋̏̉̋̈́͊̿͑̈̌̈̕͝ȟ̵̸̡̧̥̮̫̟̘͉̰̙͉̪͊̐̓̚()Ljava/lang/String;

    move-result-object v2

    move v0, v1

    :goto_c
    const/16 v4, 0xf

    if-lt v0, v4, :cond_36

    new-instance v4, Ljava/io/ByteArrayOutputStream;

    invoke-static {v8}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̖͖̭̠̭̩͌̇̌͋̿͌̚͘͘͝ṏ̷̶́͘k̷̢̮̰͕̞͚̱͐̆͊̐̎u̕ņ̧̺̠̰͉̈̇K̸̵̢̢̺̝͚͉̖̩̺̺̗͕͗̑̈́̑̑͊͌̎̃̆͋͜͝͠oä̷̵̢̡̧͚͚͈̜̝̦̱̞̞̀̈́̈́͋̐̈́͋̂̆͗͑̄̚͝͝͠ã̴̢̧̭̻̫̲̺̦̭̎̋̎o͎̱̼̮̪͋͋̔̆͘̚͜͝a̷̧̮̩͌̿͐̌̍͘͜a̸̷̸̷͓͕̲̺̹̤͈̘͓͑̄͆͌̌̋̅̃̄̈́̏̚͘͜ͅec̲K̸͉͈̙͎̦̿̈́̃̌̒̈̎͘͜͜͜͝ǒ̷̷̸̧̡̢͚͓͎̗̯͎͎̞̲͈̦͉̫̙̺̫̎͌̋̂͋̈̋̿̈́́̂͌̾͗̈́̀̄̌͌͐̀͐͌͋̿̂͗͘͝͝a̬͑K͈͐P̴͓̻̗̟̱͎̂̓͘ȩ̴̴̴̷̨̖͉͚̯̲̯̹̮͉̦̊̐̋̈̂͗͝ã(Ljava/lang/Object;)I

    move-result v0

    div-int/lit8 v0, v0, 0x2

    invoke-direct {v4, v0}, Ljava/io/ByteArrayOutputStream;-><init>(I)V

    move v0, v1

    :goto_1c
    invoke-static {v8}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̖͖̭̠̭̩͌̇̌͋̿͌̚͘͘͝ṏ̷̶́͘k̷̢̮̰͕̞͚̱͐̆͊̐̎u̕ņ̧̺̠̰͉̈̇K̸̵̢̢̺̝͚͉̖̩̺̺̗͕͗̑̈́̑̑͊͌̎̃̆͋͜͝͠oä̷̵̢̡̧͚͚͈̜̝̦̱̞̞̀̈́̈́͋̐̈́͋̂̆͗͑̄̚͝͝͠ã̴̢̧̭̻̫̲̺̦̭̎̋̎o͎̱̼̮̪͋͋̔̆͘̚͜͝a̷̧̮̩͌̿͐̌̍͘͜a̸̷̸̷͓͕̲̺̹̤͈̘͓͑̄͆͌̌̋̅̃̄̈́̏̚͘͜ͅec̲K̸͉͈̙͎̦̿̈́̃̌̒̈̎͘͜͜͜͝ǒ̷̷̸̧̡̢͚͓͎̗̯͎͎̞̲͈̦͉̫̙̺̫̎͌̋̂͋̈̋̿̈́́̂͌̾͗̈́̀̄̌͌͐̀͐͌͋̿̂͗͘͝͝a̬͑K͈͐P̴͓̻̗̟̱͎̂̓͘ȩ̴̴̴̷̨̖͉͚̯̲̯̹̮͉̦̊̐̋̈̂͗͝ã(Ljava/lang/Object;)I

    move-result v5

    if-lt v0, v5, :cond_69

    invoke-static {v4}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ḧ̼͎̫͐̿ṋ̷̑B̡̘̄́͌͠c̋̆͜k̸̵̺̬̱̫̠̜͇̹͚̠͑̑͆̈͗͋͂͘͜͝͝t̛͌P̭̼̾̂̈a̸̶̧̨̨̛̛͉̱͚̲͓̮̙͈̲̟̜̱̦̗̘̙͈͉̦͕̗̒̇̋̿̌̈̌̍͋̈́̂̂̍̌̎̋̋̃͑̌͊̌̂̀̃͑̚͘͠͝͝͝ͅp̧̡͈͈̮̗̎̑̈́̋a̛̘̱̋̈̀́̏͝͝a̸̛̭̤̗̠̦̯̪͓̮̦̱̮͋͆̑̃̌̔̋̌͋̎̂͜͝ͅǫ̹̫͚́̆̾̎̎̂͝͠͝à̸̹͎̯̝̫̫̥̯̄̈̿͂̇͌͗͝͠ͅc̶̨̦̺̈̋̾̌͂͝͠t̛̯͝͠ṫ̢̢̺͓̱̅͌̔̔͘̕ȩ̷̡̹͕̪̞̹̹̟͓͎̏̎̋͊͜͠͝aBa̴̫͎̘̗͇͆tP̯K̷̫̅̾̚͝ţ̶̧̧̛̩̯̪̺̥͙͎̤̫͓̇̂̓̎̐̌͑̚̚͜͝(Ljava/lang/Object;)[B

    move-result-object v0

    array-length v3, v0

    invoke-static {v2}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̖͖̭̠̭̩͌̇̌͋̿͌̚͘͘͝ṏ̷̶́͘k̷̢̮̰͕̞͚̱͐̆͊̐̎u̕ņ̧̺̠̰͉̈̇K̸̵̢̢̺̝͚͉̖̩̺̺̗͕͗̑̈́̑̑͊͌̎̃̆͋͜͝͠oä̷̵̢̡̧͚͚͈̜̝̦̱̞̞̀̈́̈́͋̐̈́͋̂̆͗͑̄̚͝͝͠ã̴̢̧̭̻̫̲̺̦̭̎̋̎o͎̱̼̮̪͋͋̔̆͘̚͜͝a̷̧̮̩͌̿͐̌̍͘͜a̸̷̸̷͓͕̲̺̹̤͈̘͓͑̄͆͌̌̋̅̃̄̈́̏̚͘͜ͅec̲K̸͉͈̙͎̦̿̈́̃̌̒̈̎͘͜͜͜͝ǒ̷̷̸̧̡̢͚͓͎̗̯͎͎̞̲͈̦͉̫̙̺̫̎͌̋̂͋̈̋̿̈́́̂͌̾͗̈́̀̄̌͌͐̀͐͌͋̿̂͗͘͝͝a̬͑K͈͐P̴͓̻̗̟̱͎̂̓͘ȩ̴̴̴̷̨̖͉͚̯̲̯̹̮͉̦̊̐̋̈̂͗͝ã(Ljava/lang/Object;)I

    move-result v4

    :goto_2b
    if-gtz v3, :cond_84

    :goto_2d
    array-length v2, v0

    if-lt v1, v2, :cond_92

    new-instance v1, Ljava/lang/String;

    invoke-direct {v1, v0}, Ljava/lang/String;-><init>([B)V

    return-object v1

    :cond_36
    new-instance v4, Ljava/lang/StringBuffer;

    invoke-direct {v4}, Ljava/lang/StringBuffer;-><init>()V

    invoke-static {v4, v3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̺͉̯̗͕̝͌͌͌̈́̈̌́͘̚l̢̛̮̥͗͑̅â̴̶̷̸̢͕͙͎͕͎̚͜Ḵ̷̨̛͎̲͎̿̈́̃̑̍̌͒͒̋͜͠e̢̤͓̫̭̤̪̭̹͉̺̰̾̓̈́̉͑̂͆̚͝Ǩ̸̼̃͊͗͋̿̈͜͝ač̢̱̈̌̂a̯B̢̯̘͓̺̭̩̂̃̋͋͌͊̿ţ̸̫̼̲̤̘̫̞̺̄̆͌̈́̋̋́̌̋͋̄͑͑̂͗͝ȩ̸̴̫̮̘͚̭̯̺̰̦̻̲͂̀̿̈̌̄̐̍͌̌͆ͅǒ̴̷̶̴̴̧̹̼͚̦̦̙̯̯͓̺͓͌̌͋̉̈̂̋͆̋͌̍̄̚͘͝͝͝ȁ̵̴̹̖͎̘̽̿́n̵̸̡̧̛̮̖͉͓̘̿͑͑̔͗̋̌͘ļ̸̶̢̢̧̛̹̘̩̠̺͉͕̭̗͕͓̯̠̰̰̮̙̫̫̘͑̾̌̂͗͌̋̂͆̈̋̏́͋̐̋̃̎̃̂̈́̇̌̌̈̑̚̚͘̚͘͜͜͝͠e(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuffer;

    move-result-object v3

    invoke-static {v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ǫ̴̷̧̢͚͉͕͚̮̜̎͆̋̑̈͌̂̋͗͑́͒̂͗͗̾͊̎̌̓͗͜͜͜͝ͅë̼̟͉̤̌͑̏̚ā̯ol̷̸̠̗a̶̵̡̛͓̯͚̞̱͉̼̱̲̫̭̱̱̱̬̝̅͌̃͆͗̋͗̔̾̈̿̋̋̅̈́̎̍̍̚͝͝a̋eh̸̺̫a̷̯̹͊̇a̪̕a̶̷̴̵̶̧̛̛̱̪̥̺̺̭͋̒́̚o͎͈̿́͘͝ä̫̾͝l̦̻̋͂ç̸̧͓͚̙͉̙̫̫͎̲͉̬̜͕̭̄͑͂̄̈̌́̃̌ą̸̷̢̧̻̲͚̱͇̰̙̺̮̘̦̖̼͕̼̺̗͚̻̘̪̾̑́͑̄͐̌̄́̌̌̾͗̿͌̌̚͝͝͝e̴̦͜n̵̸̸̗̗͈̫͚͑̋̔̄̑͋̂̐͗̀̽͝͠c̸̴̢̡͙̮̘͈̬͉̙̠̭̹̑̅̀͗̂̐̋̅͝o̘ë̺́̂̌̂͝K̷̢͈̆̽̀̈́̀̚͝l̥̱̰͎(I)Ljava/lang/String;

    move-result-object v4

    invoke-static {v3, v4}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̺͉̯̗͕̝͌͌͌̈́̈̌́͘̚l̢̛̮̥͗͑̅â̴̶̷̸̢͕͙͎͕͎̚͜Ḵ̷̨̛͎̲͎̿̈́̃̑̍̌͒͒̋͜͠e̢̤͓̫̭̤̪̭̹͉̺̰̾̓̈́̉͑̂͆̚͝Ǩ̸̼̃͊͗͋̿̈͜͝ač̢̱̈̌̂a̯B̢̯̘͓̺̭̩̂̃̋͋͌͊̿ţ̸̫̼̲̤̘̫̞̺̄̆͌̈́̋̋́̌̋͋̄͑͑̂͗͝ȩ̸̴̫̮̘͚̭̯̺̰̦̻̲͂̀̿̈̌̄̐̍͌̌͆ͅǒ̴̷̶̴̴̧̹̼͚̦̦̙̯̯͓̺͓͌̌͋̉̈̂̋͆̋͌̍̄̚͘͝͝͝ȁ̵̴̹̖͎̘̽̿́n̵̸̡̧̛̮̖͉͓̘̿͑͑̔͗̋̌͘ļ̸̶̢̢̧̛̹̘̩̠̺͉͕̭̗͕͓̯̠̰̰̮̙̫̫̘͑̾̌̂͗͌̋̂͆̈̋̏́͋̐̋̃̎̃̂̈́̇̌̌̈̑̚̚͘̚͘͜͜͝͠e(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuffer;

    move-result-object v3

    invoke-static {v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->P̯͕̼̲̂̈ą̸̸̧͕̹̗͎͒͒̋̎̈̎̈́̈̿͌͗͋̆̏͝k̨̮͈̂͂c͙̈́͌͘Kh̻K̨͈͓̋ą͉͓̰̖̾͐h̶̸̛̠̖̠̺̋̌͋̂P̶̶̢͈̪͌̌̿͌̈̅͝h̵̶̷̸̠͉͉̭͎̥͈͕̘̯̮́̈̋̂̂͋̌̔́̄̈́͑̂̈å̧͈̗̪̌͌̄na͚̗̮̦͇͓͊̋̕͜t̵̢̨̝̗̻͊̿̾͜n̷̶̢̛̛̗̦̫͙̯̫̥̼̤̻͎͕̫̗͈̼̼̖̥̺͌̅̿͌̏͐̐̌̋̿̒̈́̈̌̌̔͗̋͊̕̕̕͝͝͝͠͝o̦K̢̢͈͜͠à̀ä̴̙̘̭͓̲̼͌͗̋͌͜Ķ̧̧͎̫̫̦̗̬͑̄͒̇̄ͅa̪p̧̧̫̗̥͈̼̯̯̮̫̤̺̓̍̃̋̂́͑̈́͆̍͘͜͜â̶̗̯͉̪̗̝̩̞̥͚̺̭͗̌͑͒͗̃̿̑͒̈̀̌͘͜͝͠͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v3

    new-instance v4, Ljava/lang/StringBuffer;

    invoke-direct {v4}, Ljava/lang/StringBuffer;-><init>()V

    invoke-static {v4, v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̺͉̯̗͕̝͌͌͌̈́̈̌́͘̚l̢̛̮̥͗͑̅â̴̶̷̸̢͕͙͎͕͎̚͜Ḵ̷̨̛͎̲͎̿̈́̃̑̍̌͒͒̋͜͠e̢̤͓̫̭̤̪̭̹͉̺̰̾̓̈́̉͑̂͆̚͝Ǩ̸̼̃͊͗͋̿̈͜͝ač̢̱̈̌̂a̯B̢̯̘͓̺̭̩̂̃̋͋͌͊̿ţ̸̫̼̲̤̘̫̞̺̄̆͌̈́̋̋́̌̋͋̄͑͑̂͗͝ȩ̸̴̫̮̘͚̭̯̺̰̦̻̲͂̀̿̈̌̄̐̍͌̌͆ͅǒ̴̷̶̴̴̧̹̼͚̦̦̙̯̯͓̺͓͌̌͋̉̈̂̋͆̋͌̍̄̚͘͝͝͝ȁ̵̴̹̖͎̘̽̿́n̵̸̡̧̛̮̖͉͓̘̿͑͑̔͗̋̌͘ļ̸̶̢̢̧̛̹̘̩̠̺͉͕̭̗͕͓̯̠̰̰̮̙̫̫̘͑̾̌̂͗͌̋̂͆̈̋̏́͋̐̋̃̎̃̂̈́̇̌̌̈̑̚̚͘̚͘͜͜͝͠e(Ljava/lang/Object;Ljava/lang/Object;)Ljava/lang/StringBuffer;

    move-result-object v2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->uP̭̦̤̠͈̬͜p̵̮̆͝ļ̶̵͈̘̭̺̥̩̯͌̾͘o͕͖͂P̷̸̴̧̧̛̹̭̹͈̫͇̾͗̎́̃̂̅̄͘͝á̷̛̤̝͕̲̀̄̀̂P̷̸͕͎̩̀̈̃͌̃͜K̵̛̛̛̼̯͈o̶̢̖̩̺̺̱̭̙̹͈̪̖̅̀̾̐̐͌͗͌̾̈̿́̈͜͜͜͝͝t̵͈͎̑͘K̡̥͂͑̈͋n̛̜͕̘̙̫̎̐͠a̶̴̸̶̶̱͚̻̫͚̺̦̻̘͖̱͎̞͚̮̹̯͈̭̱̍̎̃͗̎̈́͆̌̂͌̈́̾̄̆̉͌́͑̿̾̈͜͝͝a̡͕̩̠̹̫͒̏̈l̫̈͠K̿p͇̮̈͂̋ả̖͚̲͎̤̮͌͌̆̚͠k̛̛͈̮̋̍͗̾ň̲̘͝ͅhB͇͈ȩ̴̴̶̢̯͕̜̖̮̩̩͈̋̌̌̈͌̑͜͝u̵͎̥͚̹̫̎̋̍̋̿̾̾͜͜͝͝K̺͎̗̩̖͎̻̘̋̈́͌̈́͗()D

    move-result-wide v4

    const/16 v6, 0xa

    int-to-double v6, v6

    mul-double/2addr v4, v6

    double-to-int v4, v4

    xor-int/2addr v4, v0

    invoke-static {v2, v4}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->Ķ̷̢̢̛̛̛̹͉̩̜̥̩̮̯̑̑̌͊̈́̉́̋̓̄̚͜ͅâ̴̶̸̧̨̢̹͎̾̎̎̎͒̑̒a̸̡̛̗̱̯̹̟̗̫̐͜͝n̷̸̴̷̨̹̱̯̂̏̐̌̂̒̈́͌́͌̋͆͘͜͝ö͚̫̹͈̪̔̈́Ķ̶̥̝͌͒̐͂͜o̲͐á̴̫̪̤̤̗͗̋̈́̈́͊̈̈́͠͠ͅḴō̿͂k̲̮̔͘ǎ̸̷̸̢͇̫͕̫͉͎̺̘͓̘̆͑͐̑̒͒̑͗͆̀́͊͂̃̚t̸͈̺̦̗̑͋͜ņ̶̷̵̴̛̫̫̱̤̙͚͓̮̫͌̂̃͋̅̿̈̿̆̈́̆̋̋̑͘̚B͉͋B̰͕͇͎̘̿a̸̴̷̡̛̮̺̥͉̯͙̥̼͚̼͉̋̑͑̃̌̐̀̎̽͌̑̓̎͆̂̅̈́͘̚͝ͅo̸̡̧̞̫͕̱̤̥̾̌̒͘͝͠͝ỏ͘p͚̱͉̏p̗̰k̸̵̨̧͚͕̤͋̑̊̋̄̎͜͠(Ljava/lang/Object;I)Ljava/lang/StringBuffer;

    move-result-object v2

    invoke-static {v2}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->P̯͕̼̲̂̈ą̸̸̧͕̹̗͎͒͒̋̎̈̎̈́̈̿͌͗͋̆̏͝k̨̮͈̂͂c͙̈́͌͘Kh̻K̨͈͓̋ą͉͓̰̖̾͐h̶̸̛̠̖̠̺̋̌͋̂P̶̶̢͈̪͌̌̿͌̈̅͝h̵̶̷̸̠͉͉̭͎̥͈͕̘̯̮́̈̋̂̂͋̌̔́̄̈́͑̂̈å̧͈̗̪̌͌̄na͚̗̮̦͇͓͊̋̕͜t̵̢̨̝̗̻͊̿̾͜n̷̶̢̛̛̗̦̫͙̯̫̥̼̤̻͎͕̫̗͈̼̼̖̥̺͌̅̿͌̏͐̐̌̋̿̒̈́̈̌̌̔͗̋͊̕̕̕͝͝͝͠͝o̦K̢̢͈͜͠à̀ä̴̙̘̭͓̲̼͌͗̋͌͜Ķ̧̧͎̫̫̦̗̬͑̄͒̇̄ͅa̪p̧̧̫̗̥͈̼̯̯̮̫̤̺̓̍̃̋̂́͑̈́͆̍͘͜͜â̶̗̯͉̪̗̝̩̞̥͚̺̭͗̌͑͒͗̃̿̑͒̈̀̌͘͜͝͠͝(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v2

    add-int/lit8 v0, v0, 0x1

    goto :goto_c

    :cond_69
    invoke-static {v8, v0}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜(Ljava/lang/Object;I)C

    move-result v5

    invoke-static {v3, v5}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->K̢̛̞̯̯̘̻̯͚̤̫͗̂̏̔̎̀͜ͅa̸̷̴̸̧̢̺̺̟̤̰͓̤̤͐̅͗̂̃̈́̈́̚o̷̧̨̱̘̬̠̙̭͇͚̎̃̾͒͋̌̋̚͜ò͇͓̻̫̤̔̀͜͝͝͝P̷̶̶̷̢̫̻͓̘͓̮̮͈͙͉͓̟̹̱͙̙̑͌͌̋́̃̈́̿̾̀̋̌̽̑̂̀̿̈͌̏͌̈̌̚͘͘̚͜͝͠͝͝͠ep̴̵̶̷̧̢̨̯̰͈͚̝̭̑̋̂̅̐̈̍̊̌̔̌̂̃̅͘ȃ̵̢̛̻̫̱̥̼̖̥̗͕̘͎̗̄͂̌̔̈́̑͊̃̌̀̆̈͊̌͘͝͝K̵̩̱͙͎̘̯̙͈͕͌͌̃̂̒̆̾̈̋͋͜͝å̶͈̀̚p̸̹̻̻̞̦͆̾̓ǎ̻̰̥̼̯̫̞̏̌̅̒͐̎̃̎̂͝h̸͚̯̠͈̹̆̌̋́̋͒̿͆̌̚͝e̶̵̪͈̹͌̂̾͌k̨̧̛̫̱̻͆̈́̈́͑͌̾̋͘͝͠͝(Ljava/lang/Object;I)I

    move-result v5

    shl-int/lit8 v5, v5, 0x4

    add-int/lit8 v6, v0, 0x1

    invoke-static {v8, v6}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜(Ljava/lang/Object;I)C

    move-result v6

    invoke-static {v3, v6}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->K̢̛̞̯̯̘̻̯͚̤̫͗̂̏̔̎̀͜ͅa̸̷̴̸̧̢̺̺̟̤̰͓̤̤͐̅͗̂̃̈́̈́̚o̷̧̨̱̘̬̠̙̭͇͚̎̃̾͒͋̌̋̚͜ò͇͓̻̫̤̔̀͜͝͝͝P̷̶̶̷̢̫̻͓̘͓̮̮͈͙͉͓̟̹̱͙̙̑͌͌̋́̃̈́̿̾̀̋̌̽̑̂̀̿̈͌̏͌̈̌̚͘͘̚͜͝͠͝͝͠ep̴̵̶̷̧̢̨̯̰͈͚̝̭̑̋̂̅̐̈̍̊̌̔̌̂̃̅͘ȃ̵̢̛̻̫̱̥̼̖̥̗͕̘͎̗̄͂̌̔̈́̑͊̃̌̀̆̈͊̌͘͝͝K̵̩̱͙͎̘̯̙͈͕͌͌̃̂̒̆̾̈̋͋͜͝å̶͈̀̚p̸̹̻̻̞̦͆̾̓ǎ̻̰̥̼̯̫̞̏̌̅̒͐̎̃̎̂͝h̸͚̯̠͈̹̆̌̋́̋͒̿͆̌̚͝e̶̵̪͈̹͌̂̾͌k̨̧̛̫̱̻͆̈́̈́͑͌̾̋͘͝͠͝(Ljava/lang/Object;I)I

    move-result v6

    or-int/2addr v5, v6

    invoke-static {v4, v5}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->p̴̷̶̸̧̛̛̹̼̩̫̺͕͓͓̪͚̹̺̪͇̫͉͚̘̘̫̻̗̦͎͉̫̈́̋̑̂͂͐̈̋̀̀̑͂̎̎̈́̾͘͜͜͜͝ͅͅǒ͖̒͘ā̵̢̧̢̞͓̦̫͚̗̯̖͎̰͊̿̄͑͂̋̌̄̔͘͜͠͝P̛̥̺̯̤̺̪̱̪̆̈́̌̋̎̀͌̃̿̏̎̕͜͝P̮̊a̛̺̋ò̗͚͉͇̫͑͌a͓Ķ̸̴͚̺̥͚͎̖̭͕̅̾̌͝K̨̨̧̭̥̔̌͋̋ẽ̶̷̸̜̩͕̺̬̖͕̲͓͈̼̌̅̑̈͌̔̋͋̐̆͌̂̚̚͜͝ť̴̸̨̧̢̛͚̹̟͈̯̟͕͕̦̻̲͕̠̗͈̦̈́͗̿̐̋̾͊̌̆̇͌̌̀͝͝͝͝͝a̧̘̫̗͂͂̃̓̋͐a̶̸̧̧͕̮͈͕͊̃̂̿̔̂k̢̛͓̰̖͚̮̥̺̑͗̂͋̂̃̑ẗ̸͚̮̫̰̊̿̈́͗̚ͅa̶̷̛̹̘̫͎̋͑͝(Ljava/lang/Object;I)V

    add-int/lit8 v0, v0, 0x2

    goto :goto_1c

    :cond_84
    const/4 v5, -0x1

    aget-byte v6, v0, v5

    rem-int v7, v5, v4

    invoke-static {v2, v7}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜(Ljava/lang/Object;I)C

    move-result v7

    xor-int/2addr v6, v7

    int-to-byte v6, v6

    aput-byte v6, v0, v5

    goto :goto_2b

    :cond_92
    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->ǒ̥̼̲̠͚͈͉̌̈́͌͘͘͜ą̶̧̘̩̫͉̯̰̤̯͈̭̮̗̎͊̿̄̃̈̌̚͘h̺̩̫͚̑̈́͋̈ĉ̷̸̴̲̫̲̱͎̌̌͋́͠͠a͖̮̒a̭̯͊̂̓͗͌͘l̶̦̱̠̹̫͋͂͂͊͋͂͗ȁ̶̴̷̧̢̛̤̗̺̥̗̥͚̘̭̘̽̎̐̄͋̒̌̌̈́̑̎͜͜͝͝P̷̢̞̖͕̱̺̟͎̫͚̼̬͎̬̘̤̺͗́̈̈́̈̈́͋͊̌̎̌̈͆̏̃̎͑͘͜͠͝K͓͑͑̊p̫̋͋͘k̷͚̭͚̻̅͌͂͗ŏ̸̴̶̢̨̯͚̭͉̮̫̗̫̫̪͕̹̎̄̊̂͘͝͝c̶̴̢̡̘̰̟͙̰͉͚̭̱̗͎̹͚̫͋͌͌̂̋̋͋̌̂̌̌͌͠͠h̶̭̲̦́́͌̈́̒̑ơ̶̴̷̫̘͎̠̼͎͊̋̏̉̋̈́͊̿͑̈̌̈̕͝ȟ̵̸̡̧̥̮̫̟̘͉̰̙͉̪͊̐̓̚()Ljava/lang/String;

    move-result-object v1

    invoke-static {v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̖͖̭̠̭̩͌̇̌͋̿͌̚͘͘͝ṏ̷̶́͘k̷̢̮̰͕̞͚̱͐̆͊̐̎u̕ņ̧̺̠̰͉̈̇K̸̵̢̢̺̝͚͉̖̩̺̺̗͕͗̑̈́̑̑͊͌̎̃̆͋͜͝͠oä̷̵̢̡̧͚͚͈̜̝̦̱̞̞̀̈́̈́͋̐̈́͋̂̆͗͑̄̚͝͝͠ã̴̢̧̭̻̫̲̺̦̭̎̋̎o͎̱̼̮̪͋͋̔̆͘̚͜͝a̷̧̮̩͌̿͐̌̍͘͜a̸̷̸̷͓͕̲̺̹̤͈̘͓͑̄͆͌̌̋̅̃̄̈́̏̚͘͜ͅec̲K̸͉͈̙͎̦̿̈́̃̌̒̈̎͘͜͜͜͝ǒ̷̷̸̧̡̢͚͓͎̗̯͎͎̞̲͈̦͉̫̙̺̫̎͌̋̂͋̈̋̿̈́́̂͌̾͗̈́̀̄̌͌͐̀͐͌͋̿̂͗͘͝͝a̬͑K͈͐P̴͓̻̗̟̱͎̂̓͘ȩ̴̴̴̷̨̖͉͚̯̲̯̹̮͉̦̊̐̋̈̂͗͝ã(Ljava/lang/Object;)I

    move-result v1

    add-int/lit8 v1, v1, 0x1

    goto :goto_2d
.end method

.method public static p̵̴̢̞̫̠̺̖̝͈̩͎̊̈́̂͌͗̔̑͘͘͜Kņ̸̢̻̺̤̭̭̹͎̯͈͌̄̌͂̚͜͝a̸͈̰̫͌̎̆͌̚͝ả̯̃̀ͅP̸̐̌͘a̵̸̴̧̫̭͈͊̂̉̎̈͒͗̿̚͘͝pK̡̫͓͎̲̱̥̘̇͆͌̽̐̃͗̐̎͘̕͜Kć̸̤̭̼̮̦̥̈͗̇̚͝p̙͙̱̼̋̀͠o͗́̋̑̑͗a̡̛̗̦̫̓̄͘t̗͚̻̅K̸̛̟͎̤̮̯͈̺͌̔͗͒̌͌̎͜͜͝tļ̷̷̡̲̪̦̱̖̫̫͕̥̅̌͌̋͊̈́̉̂̅̋͐̚͜͜͝͝͠P̷̛͎͚͚̲̈́͗̑̋̂́̂n̶̶̴̴̸̵̷̨͉̭̠̮̮͉̘̙͖̫̯̑̏͋̋̃̈́͒͋̂̈́͂̈́̽͂̂͘͠t̯Ke̋u͘a̰̫̗̗̋͌͗̐̚͜͜͝p̶̨̢̯̱͖͕̱̰̂́͗̂̅͝ñ̷͙͈͓̐̂̄̑(IILjava/lang/Object;)Landroid/graphics/Bitmap;
    .registers 4

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p2, Landroid/graphics/Bitmap$Config;

    invoke-static/range {p0 .. p2}, Landroid/graphics/Bitmap;->createBitmap(IILandroid/graphics/Bitmap$Config;)Landroid/graphics/Bitmap;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static p̧̦͚͎̯̤̍̍̀̿̀̃͑͠͠͠a̭̻͌̃t̸̡̛͎͕̮̦̱͚͚͙̋̌̏͆̿̃̑̐͗͂͑͘̚͝n̗̼͈̋̔́͗͝a̸̸̛͕͉̺̖͈͐̋͗͋͂͑̅͝B̶̸̢̢͎͚̖̫̯͙̫̝͈̙͉̫̲̃̋̈͜͝ņ̩̫͉̎Ḵ̶̺̥̈́a̪̋K̶̸̶͎̦̻̟̘̭̺͕̫͓̋̂̍͂̀Ṕ̧̫ā̷̡̛̞̱̻͖̗̋̉̍̒͋̄̂̀̔͜͜͜͜͠͝ȅ̛̥̥͈͙̯͕̏̎̐͆͌͜͜t̖͕̺a̞̗͜p̷̠̭͙͌̆̍̎͋͒K̸̛̭͗̏n̠̥̈́̋̈́o̴̸̖̘̹͕̗̼̓̅̈͘͜ͅņ̸̴̷̢̡̡̻̟͈̺̗̩͈̱̩͕̺̠̦̽̃͌͋̂̉̈́̌͌̑̑̍̈́̿̏̃͌̑̋͜͜͝ąP̴̸̢͉̲͈͎͚̦͓̦̗̱̗̮̂̂͗̇̾́̍͋̈̑͌̚̚͝͝͝͠()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۤ۟ۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static p̷̸̛̱͉̼̮̘̂̂̐̋̋͑͑̂͘̚͜p̶̺̥͌ą̷̷̧̰̠̰͉̱͗̂̾͋̂̄̑̍̀͂̂̑t̸̴̴̢̨̨̧̗̭̘̗̗͚͓̫̭̺̠͇͚̭̂̈̋̈̄͌͑͒̐͋́͒̔̉̋̑͂͜͜͜͜͠͝͠a̧̛̫̗̯̓̈̄͑̀̿͘ṋ̖̠̍͝p͎̫Ķ̸̸̥͎̈̈̄̏̋̂͐͌̅̐̅́́̚͜lKBȩ̷̷̸̸̴̴̧̧̨̧͓̯̦͈͇̮̪͕̼͉̬̞̮̀͂̿̃̂͑̋̃͂̀̌̐̈͗̚͜e͗̓͠K̛̘̩̎̐͋͑̌͝l̬̦͉͙͗ā̸̸̧̛͉̥̫̭̺̫̦̻̺̗̾̈̑̽͐̃̑̂͑̎́̃̌͘͜͠͝n̴̛̛̻̖̩̈́̀̈́̊̂̌͗̄̔̂͐͜͠h̹͎̫̏̌͆p̨͚̝̘ă̸̝̥͌̋̈̋̑͜ĉ̴̴̷̨̢̰͈͉͓̫͙̩͖̘̼͌͗̏͌̏̇͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۨۢ۠"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static p̻̤̦͎̭͖̘͌̄̀̾̏̾͗͘ḩ̴̵̡͎̦̾n̞̥̦̝͗ö̴̶̴̴̷̸̧̢̢̲̦̱̹̫̫̮̺̘̺̻͎̦͙̫̗̫̤͂͌́̃̒̅͗̌͌́̄̃͒̓̈́̑̈̆̀̈̌̆̍͋͊͐͌̑͘͜͜͜͜͝͝͝ą̶̶̨̧̛̭̘͈̮̲͓̖̪̩͙̫̝̫̰͇̝̔̑͋̂̈́̄̈̌̏̅̋̿̈́͜͝͝ͅB̧̥̫͙͙͌͒̍̎̈͌̚͝ǎ̸̸̫̮̖̋͆̑̑̍̈͘͘B̶̧̝̙̗̰̉͒̍̎͒̿̋͌͒͝ň̷̵̢̛̛̺̤̯̝͎̫̪͇̮͎̘̹͈͉̜̘̻͓̫̜̐̋̈́̋̀̊̅͘̚̕͘͠oűơ̘̬̮̹̈̈́͌̀̎t̶̙̥̘̯̭̂̿̌͊͌̎͌͗̑͌P̙̔͜oa̸̸̧̻͓̺̫̦͚̩̩̮̺̦̮͊̂̃̈̃͌̈́̎̾́̈̿̈́̑͘͝͝ͅț͚ṷ̧c̗͎̲(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_c

    check-cast p0, Lcom/android/settings/device/MiuiDeviceNameCard;

    invoke-virtual {p0}, Lcom/android/settings/device/MiuiDeviceNameCard;->refreshDeviceName()V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static p̷̷̢͉̫͎̘̂̂a̧o͈̺̍ớ̧̺̱̺͎͋̔̈́͆̿̂͌̍̈́̚͝oK̢̮̋͑K͉̤ǫ̱̂̿ơ̵̷̶̸̷̢̡̢̨̡̧̱̼̹͎̲̙͈̦͇̫̖̺̱̘̫̩̗͇͎̩̤̈͗̈͂̿͒͌͑̋̏͊̍͊̃͑̎̅̑͑̋͗͜͜͜͜͜͝͠͝͝͝͝͝͝ṋ̸̈́ą̸̵̷̧̛̱̲̫̭̹͓͕̬̝̘̠̺̭̖͙̮̤̻̰̹͌̄̄̂͌̅̔̀̑̑̂͗̔͋͘͜͜͝͝͝K̤̇̉͝P̵̰̮͚̯͕͎͈͕͋̈̅̈͌͗̈́͝a̸̸̧̺̼͈̥͑̈́͑̿͋̋̈͜P̄͌͠K̸̷̢̛̛͎̈̂̋͗͘a̹͠K̵̸̢̧̨̨̟̗͚̯̥̙̯̝̇̍̋̈̂̇͌͑̆̈̆̽̾͗́̆̆̃̌̏͑̏̚̚͜͝luȃ̷͓͊̋̄̋͐͘̚ǎeK̛̠̪̫̪͓͚̝̼̓̈́̆͋͗͜(Ljava/lang/Object;I)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_c

    check-cast p0, Landroid/widget/ImageView;

    invoke-virtual {p0, p1}, Landroid/widget/ImageView;->setBackgroundResource(I)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static tã̵̷̶̵̧̡̧̧̢̡̧̛̛̭̮̠̫̫͎̥͈̖̦̙͎͕̺̠̩̖̭͚̫̯̝̻͎̦͌͐͋͑͗̄̔́̈́̌̅̋̓̈́͐̌̋͌̋̈́͑̌̂̎̋̌͌͗̀͂̌̂̎̿͑̃̿̈́̂̓̃͘͘͜͠͠͠͝͝ǫ̸̙͖͓͎͚̭͈̅͌͑͂͜PK̑a͚͎̥n̹̹n̴̫͂̈́͋̍̌͐͆̕h͋o͕͉͗ņ̸̵̷̨̧̬̼̼̗̮̖̭̝̎͌̈́͐͑͒̈̋̂̄͐̂̏͌̾͗̈́̋̆̓̂͜͜͠a̸̸̡̺̥͎̝͎̽̆͊͜͝t̶̷̢̧̠̥͚̃̌̉̿̽͜K̴̶̶͉͚͈̦̲̫̭͓̲̥̼̫̾͒̓̾́̌̔͝͠ç̶͉̭̐̑͗̎͌͠p͇Ḇ̴̫̰̰͌̾̂̎k̸̷̵̸̢̢̲͖̫͇̲̖͇̖̰̗͈̹̮̹̺͚̠̼̞̩̺̼̆͊̒͌̋̔̈́̾̈́̎̂̾̿̃͊̆̄͋͘͘͜͝͝͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gtz v0, :cond_9

    const-string v0, "۟ۡۧ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ţ̷̷̸̭̺̯̅̉̋̅̃̾n̈́̑͠o̶̷̴̪̰̗͗̄͠k͖ȃ̺̪̱͚͗̔͋̇͊͑̌͋̈́̚͘͜ç̸̸̶̴̶̛̞̹̲͚̯̮͕̰͈͓̘̰̮̖̗̞̬͎̱͈̯̥̄́̐̆̈́̅̈̃͋͗̌̃̃̂̒̈̚͘͜͜͝l͎̋̎͘͝n̸͉̮̑͌̎͜͝a̯̎ã̗̯͜P̸̢̨̙̠̦̞͚̩͖͑̌͗̄̇̀̄̚͝û̦͈͌͠K̸̸̨̥̞͎̗̬̮͓̗̟̝̾͗̂̂͊̂̋̃̍͜͠K̵̸̢̢͈̫̩͂̿͘P̨͓̫̜̭͓̠̫̾̆̂͋͜͜ç̴̴̷̸̴̵̷̛̺͓̺̹̗͈͉̮͕̯̯̬̱̯̤͓̲̺͚̻̫̖̱̗̮̋͌̌̒͌̃͌͑̃̀̂̃̓̂̈́͂̓̈̎͗̀̏̎̂̎̆̌͊̈̏̂̊̈́͘͘͘͜͜͠͠͝ͅő̷͚͈̰̼͎̫̗͙̗̅͒̽͌͌̔͋̔̒̂͜ͅ(II)I
    .registers 3

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_b

    invoke-static {p0, p1}, Ljava/lang/Math;->max(II)I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method public static ẗ̴̤̅͌́̚͝á̧͉̆̾̾Ķ̴̢̫̭̋̋̈́̑̅̋̅̾͋̔͝ͅơ̷̷̧̧̼̹̭̻͙̪̱̺̮͚̤͕̝̺̭͈̹̤̦͈̰̗̈́͑̇͂̈́̎̑̅̉͂̈̈́͌͗͘͝ã̸̶̵̷̧̢̧͈̪͙̝͎̖͓̥̽̃̈́͌̽̉͗̐̀̎͋̈́̐̀̈́͘̚͠ͅu͗h̶̶̢̧̢̝̮͉̮͇̺̙̪̺̍́̈́̂͗̑̈̈́̈͘͝͝͝ö̫́̚k̷̨̢͎̺̖̺͚̩̗̀̈́̂̈́̋̍͗̈͗͘͜͝͝K̯̮̯̱͇͉͐̌̎͜͜͝é̶̵̸̢̨̢̧̨̨̛̛̛͎̫̫̹̺̦̠̠͉͈̫̫̘͚̦̱̲̖̱̪̗̮̃̏̐̄̂͌͋̀̄̊̾͐͆͗̉̚͜͜a͗k̴̷͚̙̙̪͚͕̫̹̤̫̱͕͕̙̫̫͎͕̗̯͙̮̫͚̯̈̿̾͗̾̍̉̌̋͗́̑͑̌̃̈́̀̅͂̋͌͌̈́͊͑̎̚̚͜͝͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۥۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static t̔Ka̸̶̡̢̤̻͌̅͊̀c̶̶̸̸̸̨̮̪̪͎͗̋̂͑͜͜ų̸̸̢̨̫̪̥̼͖̰̀͑͂̇͑̃̋̌̇͘͠͠͝l̟͖̥͕͉̗̋̊́̚͜t̛̫͗͊̃̈́͂͘͝ą̢̩͎̥̙̦͕̑͌̃̅̾̚͘͝ç̸̶̛̛͎̫̫̺͎̲̍̌̐̋͜a̺͎͑̀pḁ̶̧̢̛̛̛̮̖̻͂̔̈́̃̑͋̾͑͑̆̃͘͝͝͝Ķ͕n̛͚̲̰̫̺̫͙̂͒̎͋̈́͝K̛̘̯̱̀̐̚͜e̗͈̅̾ä̸͎̪́̂l̷̶̸̴̨̧̛͈̭̯̮̘̭̘̫̭̩̲͑͂͌̇̾̍͐̂͊̿̌͘͜͜͝͝ẗ̴̷̷̸̸̡̧̛̛̖̭͓͈͚̫͉̥̜͕̪͉̱͓̲̥̹̦̦̯͓̤̲̗́̎̌́̎̀͌̆̐̄͑̍̓̾̌̀̑͌͗̂̀̈̃͑͗̿̏̎̿̈́͌̚͜͜u̵̦̿â̯̗̲̭̄͘͝ͅ(Ljava/lang/Object;)Ljava/lang/String;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, Ljava/lang/String;

    invoke-static {p0}, Lcom/android/settings/device/MiuiVersionCard;->getViewName(Ljava/lang/String;)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ṯ̸͈̙̻̅̔͐̏͌́̂̂̕͜ṋ̨̗͌͌̑͋̃̋̾͜n̴̛̠̺͓̂̋͑̈̄̌͋̇͗̌͒́͝B̷͖̺̙̎͝o̯a̸̰̼̞͐̓̃̚P̸̴̢̛̥͕̼̈̑̽̎͌͗̋̂͠ę̸̢͈̘͋͌̾̅͌̉̚u͙a̰͎̯̦̿̌͑o̢̗͝e̾͝ǘ̧̨̺̦̻͕̘̪̺̥̂͋͑͝B̵̬̩́̂̏̅̚͝t̨̰̭͉͇̫͐̔̋͆aò̱̤̻̹̥̫̹̑͌̋͝a̧̢͓̭̘͙͎͓͚̹̥̪͖̯̎̐̒̽̏̈́̎̔̃̄̚̕͝͝B̧͋͆ķ̱͙̜̤̹̻̺͕̃̈̐̌͗̆â̸̛͈̭͖̭̪̱͚͉͑̑͆̔̿̈́ę̸̯̺̫̟̰̘̺͈̗̼̯͈̎̿͌̿͗̋̽̾͂̀̿̋̄͗̆̐̑̈́̋̌͝ǫ̴̷̫̫͕̼̦͜͝à̛̦͙e͚̘͋̓́̈̎̂͜ö̸͉͓̫̞̚()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۥۥ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static t̶̷̶̺̮̲̮̫͉̖͉͌̂̂̿ŏ̸̡̰̼̯̪͕̦͎̱̻͎͗͌̔̈͋͘͜͜BK̸̵̸̠̖̮̥̰͎͎̲̬̲̭̹̭̾̄̄̾̋̃͒͋̃́̌̋̚ͅB͓̦͋̚ṷ̈P̲̯̫̰̐̑̀̉̄̈̍̾ä͈̘͓̮̩̈́̔̂̍͒K̷̡̧̨̛̛̪̥̫͈͕̥̖̭͎͊̂̈̃̌͒̿̔͜ḩ̷̴̷̸̴̨̧̥̪̦̙̫̞͎̜̹̦̺͎̗̖̗̯̯̫͚͎͎̪̹̺̭̫̒̌̌̀̌̃̃̓͌̌̈́͑͋͌̎͑̿̆̎̈͑̈̍̋͘̚͜͜͜ͅo̶̮̍a̴̷̯͈̤̱̫̠̜̻̭̭̱͓͐͆̿̍̈̈̈́͝͝P̢̢̀̋͌͘l̸̈͊͋pn̷̺K̴̛͈̈̔͝P̴̛̥̹̏ä̹́͝ļ̶̛͉̙̙̫͚͇̈͌̈c̖͕̈̑̔̋͋̌̃̋͘a̫̩h̫̫ͅa̮͐̀͆P̷̧̻͗̈̎͝͝()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۣۡۢ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ţ̧̧̻̙̥̰̺́̃̈̂̈́̿kḩ̶̛̗̻̫̈́ͅa͇̺͚̿̂a̸̵̺͓̪͎͋̏̐̎̃̆̇k̢̧̛̫̫̂͐̎̆͠ã̷̸̷̧̢͎͕͖̥̩̥͉̫̱͙̹̯̠̺̪̙̫̗̟̩̂̂͗͐̂͂̌̔́̇͆̌̍̏͊͜͝o̺̫̩͖̥͗̄͂̅̍͊̂̍͜k͉ę̢̛̱̫̰̗̲̤̮̦͕̰̥͈̠̺͈̥̈́̄͊͊̎̍͘ȩ̸̸̛̪͉̯̘̘̜̻̦̼̺͙̜̰̲̦̦͋̌͐̃̋́͜͝ņ̶̨̛͕͈͎̭̱̂̄͋̈͋̎p̵̸̬͖̺͈̼͚̎̌̒ç̶̴̵̴̵̢̧̢̢̡̛̺̤͕͓̭̹̺̯͈͚̱̹̞̺̄̈́̃͊͂̋̈͌̂̋̈̈́̓̋̋͌̎̈́̿̂̾̾̚͘̕̚͜͝͠͝͝͝ť̥͈̂͠c̸̢̤̹͗͐̌̂̃̈͘͝͝͝K̗͙̫̙͑̀͠͠K̩̝̹̘̋͗͋̑͠()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_9

    const-string v0, "ۦۦۥ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static ẗ̶̸̷̴̶̸̸̸̴̨̧̛̛̗̦͙̦͎̱̤̯̝͚̫͓̮̟̫̺̯̜̦̗́̌̅͗̑̽͋͌̌̿̄̒̐̌̋̋̾̌͊̈̏͋̚̕̚͜͜͝͝͝͝ͅe̡͉̘̺̱̻͂̌̈̈͌̅͜͝a͋ņ̥͙̺̏a̸̶̷̧̨̡̛̻̞̥͉͉̝͖̹̫̯̤̯̟͗͌͗͆̋̈̿͗͐͌͋̈̍̈̎̈́͌̌̉̓̈̚͘͜͜͝͝ȧ̸̷̸̧̛͓̞͓͎̰̻͖͕̈́͗͊̑͌̉͝͝ñ̷̸̶̸̷̷̨̧̡͉͓͎͈̫̺̖̘̫̘̯͈͎̗̯͈̯̦͚̭̙̞͈̉͐́̇͐̎͊̿̀̔͌͌̍́͗͑͑́̈̋̆͌̈́̎͌̌͘͘̕͜͝͝͝͝͝ơ̶̧̧̛͎̭̼̱̭̮̞̘̏͒͌̅͗̆̿̅̌͑̑u̶̢̧͈̹͈͈͎̅͝ţ̷̷̛͖̥̫͉̟͗̄͋̾̏͗à̬̮͙oȃ̮̗͌̀̂ḁ̫̉̿̃()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۥ۠"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static u̍â̢̛̹̺̦̘̪̑͜͜͝͠o̷̷̸̦̪̙̦̯̫̻̪͓̱̅̔͌͗͗̆̂̃̾̄͘͠ṕ̸̸͚͚̪͎͂͗̔̎̂͗̃̄͋̄̀̑̚͜͠Kâ̛̛̝̥͉̯̝͈̱̦̲͚̮̙͚͌̂̏̈̽͂͐̾͗͋͗͌͑̂̂͌̈́͘͘͜͜͠á̧c̸̠̺͈̫͖͌̐̐̄̂͜l̵̜̋ͅâ̧̧̩̈́BP͚̯̩̈́͋̂̇̈́̈o͇̿̈o̡̤̯̎̂̈́̔͆͒̅k̗̼̃̋́̅͗́͠P̷̶̶̴̢̨̢̛̛̛͈̫̭̥͚̫͚̭͚̮̗̬̗͈̥̮̗͚̗͉̪͎͉̤̫̝̦̦̫͚̈̑̏͆̔̿̋̐̂͋̋̎̂͒̃̅̈́̌̊̎̌́͗̈̃͋͑̅̈́͗̌̔̄̔͋̀͂̈́͗̀̂̚͘͘̚͘͜͜͜͠͝͝ẗ̴̫̟̱̭̫̪̝̫̃̈͋́͌͊̋͜a̶̷̠̺̫̫̙̿̈͑͊PK̛͈̍̈́̌͝(Ljava/lang/Object;Ljava/lang/Object;)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-lez v0, :cond_e

    check-cast p0, Landroid/graphics/Paint;

    check-cast p1, Landroid/graphics/Paint$Style;

    invoke-virtual {p0, p1}, Landroid/graphics/Paint;->setStyle(Landroid/graphics/Paint$Style;)V

    :goto_d
    return-void

    :cond_e
    goto :goto_d
.end method

.method public static u̦͗͊͌̚͜k̶̘͙͈̙̱͎͚̺̞̫̋̋̋̅̌̎͌́̈́̈́͑͜͠͠K̯a͚̹̟a̷̸̶̧̧̘̰̲̺̖̘͚̹̦̹̮̦͚͈͈̫̫͎͗̆́̍͐̈̑͒̂̑̃̿̌̈̚̕͘͝͝Kh̷̷̴̸̸̡̨̛̹̗̦͓̪̥̙̲̮̹̫̘͇̮̤̿̎͐̒͌̃̃̃̌̾͑̾̋̀̑̅̆͜͝͝͠e̶̷̵̵̢̛̦̫̭̺͉̖̩̦̰͇͇̅̈̎̀̊͊́̾͝͝B̷͎̲̈͗̌̐̌͜K̴̸͎̰̮̘̋̍̈̚͜͜p̴̢̥õ̴͉̬̾̂͜͜͝k͎B͚͈̅̿͜K̤̎͒B̴̤̠͕̫͆́̀̌̊͝h̯̓̎͌̕̚uB͎̮͚̈͜B̶̨̧̫̺̤̭̼̌̆͌̏͌̍̈́̕͝͝K̹̲̬͗͑̿͠ṯ̦͓̊͐å̰̖̦̦͎̋͜͠B͈̍̚͜Ķ̯̼͉̔͋͊͋h̴̢͒k̯̫͕̯̱͒̌()Ljava/lang/String;
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    const-string v0, "ۨۡۤ"

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static u̻͎̼̘̺͌͂̈̈́p͚͖̮̌͌̉̈̂͝͝l̸̷̵̵̙͎͚͉̺̹̫̱̙̫͕̯̼͕̥̗͉͖̗̥͑̌͑̿̀͐̈̎͑̈͂̾͗̋̉̔̋̾̂̑͌́͘̚̚̚͜͜͜͜͝͝͝t̢̢̢̘̮̗̩͗͝K̸̶̶̸̷̛̛̥͓̤̥̦̤̼̻̠̩̗͖͚̹͈̮̦̩̭̯͋̈́̈̈́̊̽͌͋͋̀̑͌͜͝͝͝͠ṷ̸̷̈̌͗͗̿͌a̸̸̸̷̷͚̫̯̫̝̯͕̺̦̭̘̭̮̠̟̠̥͒̂̎̎̅̆͊̃̆̂̄͌̋̈́̀̈̌̏̈̈́͘͜͜͝a̵̶͙̹͓̜̫̙̹͐̈́͑͗͗̃͘͝͠ḩ̸̟̱̌̂̋̃͊̚͜͜͠k̶͝cļ̖͇̲̈́̈́̿l̶̫̫̋͘͠͝ȕ̶̸̢̨̧͈̦̫̹̻͎̫̲̝͎͗͐̍̊̄̂̃̾͘͘͜͝n͒̌K̶̸͑ę̸̸̰̙̘͕͈̲̈́̂̌̈͐̐̌̎͘͘(Ljava/lang/Object;)Landroid/util/DisplayMetrics;
    .registers 2

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Landroid/content/res/Resources;

    invoke-virtual {p0}, Landroid/content/res/Resources;->getDisplayMetrics()Landroid/util/DisplayMetrics;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method
