.class public Lcom/kashi/settings/view/StorageProgressBar;
.super Landroid/widget/ProgressBar;


# static fields
.field private static final short:[S


# instance fields
.field private storageLevel:I


# direct methods
.method static bridge synthetic -$$Nest$mgetOccupiedStoragePercentage(Lcom/kashi/settings/view/StorageProgressBar;)I
    .registers 1

    .line 0
    invoke-static {p0}, Lcom/kashi/settings/view/StorageProgressBar;->l̸͎̞͇̠̦͓̭̯̈́̉̆͑̋̎̐̄̊̊̀̈͘Kk̶̴̢̧̧̥̭͈̦̻͎͚̥̑̿̂̂̋̿̈̑̃̆͗͋͋͑͝͝ͅu̧̗̦̘͚͓̎̐͗̃̿̂̂͘ķ̶̸̶̹̗͈̲̼͈̘̯̘̑͑̇̅̇̃̀͒̔͜͜PK̶̸̬K̴̛̗̱̼̎̂̓̒͂͘͝a̢͓͎̹̯̦̦̮͚̫͌͋͋͠t̛̹̃͘͝ǎ̰̫̱̤̰̗̬͕͗͌͐̌̐̑͘͠k̷̘͉̤̦͓͕̔̽̋̄ṅ̄k͚̋͂̋̀͒͋͒ļ̴̱͕̝̩͑̂͂̈́ǫ̸̧̖͎͈̺̥̱͕̮̗̬̹̗̆̍̒͐̌͑͌͊̾̃̕͜͝͝uȇ̴̥̿͜ͅl̸̶̸̫̭̲͓̜̠̯̫̙̺̭̰̱͈̗͓̥̰̘̥̂̅̂̈̅̑́͌̂͋͗̾̅͑̑͗̚͘͜͠͝Ḇ̶̛̫̫͓͉̠̗͉͐͗̋̋̎̋̂̋̚͜͝͝ǖ̹̈́ͅ(Ljava/lang/Object;)I

    move-result p0

    return p0
.end method

.method static bridge synthetic -$$Nest$msetStorageLevel(Lcom/kashi/settings/view/StorageProgressBar;I)V
    .registers 2

    .line 0
    invoke-static {p0, p1}, Lcom/kashi/settings/view/StorageProgressBar;->ã̛̩̥͈̾̒͜K̸̶̢̢͚̺̱̹̯̗̞̼̝̮̥̺̞̤̱̎́̋͊̅̂̃̋͗͗̐̎͑͗͝͝ķ̫̥̭̭̹̰̀̋͐͋̄͊͋͑̎͜͠K̶̸͕̫͌̆́͒͠͠ek̶̼ą̷̴̷̵̛̱͓̠̪̩̹̹͎͎̞̯͖͕̤̭͈̄̈́̑̂̈̔͑̋͒͑̂̈́͘͝ç̴̶̶̫͈͖̱̺̖̯̥̺͚̎̆̄̓͂͌̿̈́̌͝ā̵̫̰̬̰͚͚́́̍̎o̥P͓͓̭̫͉͈͙͈͓̥͌̅̿̾͗̉͝Ķ̵͗̔̏͝a̷̶̷̡̯̗̰͚̦̗̹͉͉͎̖̎͗̋̌̌̂̈́̉̇̈́̚͜͝͠ą̸̭̖̩͈̫͌͂̇̎͐̉̾͘͜ͅh̸͓̑̋B̴̫̤̫͈̫͇̗̐̄̎̈́̑͌̈̇͒̚͝͝ţ̷̧̫̹̲͖̙͗̏͆̅̌̐B͖̂͠e̵̸͚̭̟͕͎̖̯̹̯͖͜o̵̶̷͕̖̗̹͋͜͠ͅ(Ljava/lang/Object;I)V

    return-void
.end method

.method static constructor <clinit>()V
    .registers 52

    const v0, 0x2a

    new-array v0, v0, [S

    fill-array-data v0, :array_c

    sput-object v0, Lcom/kashi/settings/view/StorageProgressBar;->short:[S

    return-void

    nop

    :array_c
    .array-data 2
        0xc02s
        0xc0es
        0xc0ds
        0xc0es
        0xc13s
        0xc4es
        0xc0cs
        0xc18s
        0xc3es
        0xc05s
        0xc04s
        0xc17s
        0xc08s
        0xc02s
        0xc04s
        0xc3es
        0xc08s
        0xc0fs
        0xc07s
        0xc0es
        0xc3es
        0xc08s
        0xc15s
        0xc04s
        0xc0cs
        0xc3es
        0xc03s
        0xc00s
        0xc02s
        0xc0as
        0xc06s
        0xc13s
        0xc0es
        0xc14s
        0xc0fs
        0xc05s
        0xc3es
        0xc02s
        0xc0es
        0xc0ds
        0xc0es
        0xc13s
    .end array-data
.end method

.method public constructor <init>(Landroid/content/Context;)V
    .registers 53

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1}, Landroid/widget/ProgressBar;-><init>(Landroid/content/Context;)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;)V
    .registers 54

    move-object/from16 v2, p2

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1, v2}, Landroid/widget/ProgressBar;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;)V

    return-void
.end method

.method public constructor <init>(Landroid/content/Context;Landroid/util/AttributeSet;I)V
    .registers 55

    move/from16 v3, p3

    move-object/from16 v2, p2

    move-object/from16 v1, p1

    move-object/from16 v0, p0

    invoke-direct {v0, v1, v2, v3}, Landroid/widget/ProgressBar;-><init>(Landroid/content/Context;Landroid/util/AttributeSet;I)V

    return-void
.end method

.method public static P̴̸̧͚̝̪̥̩̅̿̋̅̿̐͋̈́̋̊̊̋̋̕͜͜͝pč̭̃̌̔͝c̴̦̫̙͚͇͙̫̱̾͂̈̈́͌̅̌̃͋̂̈̈̃̑͗̚͜͝ķ̛̯͈̯̫̱̠̗̦͎̗̻̺̠̫͓̮̺̗̯̙̀́̆̌̂͗͋͆͐̎̀̔͘͠K̸̶̢̥̯̱̯̥͒̈̎͋̉̏͘͜͠ļ̸̴̱̗̞̮̗̫͈̦̲̗͙̍͑͑̎͆̑͌̋͝͠ë̴̢̜́̃̈́̌͌Ķ͗̈͑͂̑̈͗K̴̴̶̴̯̮͕̞̞̱͈̫̜͚͈͉̥̃͂̓̂͑̄͋̎̒͜͠͠l̸̢̛͙̏̃̎̔͝͝ơ̸̷̧͈̬͙̼̼̲͕͉̲͗̿̋̈̾̀̌̔̋͗̉͌͋͋̋́̃̿͗̚͘͠͝͠͝ä̶̶̡̢̛̟̰̦̩̗͓̮͈̑̎̑̌͑̂͌͒̍̉̋̋̚͝͝͝ȇ̴̵̛̮̠̯̠̮̗̗̌̑̑̌͗̊̈́͘͝B͎̋̃̍̌͌͜(Ljava/lang/Object;)V
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_c

    check-cast p0, Lcom/kashi/settings/view/StorageProgressBar;

    invoke-direct {p0}, Lcom/kashi/settings/view/StorageProgressBar;->init()V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method private animateStorageLevel(II)V
    .registers 56

    move/from16 v4, p2

    move/from16 v3, p1

    move-object/from16 v2, p0

    filled-new-array {v3, v4}, [I

    move-result-object v3

    invoke-static {v3}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->a̋ơ͑ả̺͊͝k̵̸̸̹̠͂̌͜u͇̥͊k̼̏äǘ̷̧̢̢̗̠͙͖̹͕̲̦̰͓̙̯͕͓͗̈́̌̋̋̈͌͂͗̆̂̌͘̚͝ţ̷̶̛͚̠̮̫̰͓̂̆̂̐̂̈́̋̌̑̌̌̅͗͜͠ľ̸̸̸̢̲̯̮̭̝̘̦̟̭̤̮̪͊̈̀̃̾͠͝e̛̘͌̑̾̑à̷̴̸̢͙̮̹͕͎̬̦̥̥̱͓̗̫̬͚̝͉͋̉͌͂̂̾̾͗̋̈́̾͘͜͜͝͝a̸̭͓̾͝l͕̙̋ń̵̸̢̧̩̥͙̭͉̈̒̾̂e̸̸̿̽͌͋̑̎ỏ̷͓̥̫̯̫͖̯͕͎̍̃̈̑̎̾̓̎̂͋̍͠a̸̸̴̴̸̸̸̧̧̧͕̥̯̥͎̗̥͎̯͓̲̥̜̘̠͈̪̋̏̿͑͗̍̋̋̂͜͝͝ť̸̨̖̻̺̥͈͈͘h̛̺͉͕̦̻̻͚͕̘̱̋͌̈́̆̊̈͑͋͂̋͗̓́͘͜͝P̏(Ljava/lang/Object;)Landroid/animation/ValueAnimator;

    move-result-object v3

    const-wide/16 v0, 0x3e8

    invoke-static {v3, v0, v1}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝(Ljava/lang/Object;J)Landroid/animation/ValueAnimator;

    new-instance v4, Lcom/kashi/settings/view/StorageProgressBar$2;

    invoke-direct {v4, v2}, Lcom/kashi/settings/view/StorageProgressBar$2;-><init>(Lcom/kashi/settings/view/StorageProgressBar;)V

    invoke-static {v3, v4}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->ȩ̥̘͉̙͎̯͈͖̲͕̚͘͜͝k̛̮̙̫͓̈̇͑̈́̋͋̑͊͘c̘͎̯͎͎̬̮̈̇͆̄̎B̝͓͓͓͈̫̎̀̅̎͌̌̐̂͗̃͘ō̴̸̴̧̠̥̭̘̪̥̗̿̊â̸̶̸̧̩̻̰̥̫̈̆͌ͅkB̵̛̭̮͑͂̎̌̈́a̴̲͕̙͙͚̹̩̎͗̋͗̑͜ą̤n̩c͓͈͋̽̃̈̔ņ̵̵̯͉͓̭͓͙̯̻̰̀̏͑̓̑̈̐̌̎̂̕͘͘͝͝͝e͚̟̻̤o̧̖̺̰͓̭͓̫̮͂͌͌́̑̅̈͘̕͘͝͝͝ņ̧̹̩̗͕͎̯̋̑̾̂̄͐̀̈͌͘͜ͅK̼̤̄̐l̷̶̵̸̴̡̨̛͚̜̘̮̦͓̼͙̗̺͈̞͈̯̦̯͈̘͕͇̪̃̈̿̒̂̎̏̂̾̋͂̅̋̀̄̾͊̑̌͂͌͘̕͘͘͘͜͜͠͝͝͝t̶̛̲͗̃͘͝u̸̴̧̺̩̯̼̫͓͗͌́̋̌͑(Ljava/lang/Object;Ljava/lang/Object;)V

    invoke-static {v3}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->čȩ̶̛͚̮̺̜̭͙̫̦̫̺̯̪̲̫̭̈́̍̈͊͗̾̋͌̌̐̑̾̆̋͘͜ͅp̧̛̘͙̤͋̍̍́͜͝a̷̸̸̸̸̷̷̧̧̢̡̯͙̫̻̝̮̘͙̫̟̞̼̋̃̊̆̄̆̋̔̋͌́̈̄̋̌̎̽̂͂̄͘͠͠t̸k͌o̓̋̋oK̴̨̛̺̔̈͊͂͒̎̚͘l̴͑̈ơ̵̸̶̷̸̮̫̤̗̗̦͕̱͈̪̰̺͓̠̺̯͚̑̃̃̂́̔̈́̐̍̑͗͘͘͘̕͜͠͝e̦̘͜͝h̲͉̱̍̂̎Ķ̴̶̶̨̺͉̘̗̘̫͉̙̝̮̗͙̥̦͌̄̂̌̌̒͌͘͜͜͠͠ͅo͚̗͈̓̌͝áȃ̶̪͚͇̖̰̈́̾̒̚͠͠͝ṷ͚͌͋͜ņ̶̶͎̮̺͉̭̠̠̙̩̩̄̉̎͆̎̋̈͐̑̑͋̽͜͝͝ḁ̸̿t̡̩̼̫͈̗͙̮̯͌͐͌͌̿̌̕P͚͖̋̋a̱̺̫͌(Ljava/lang/Object;)V

    return-void
.end method

.method public static a̋̈́̅͋͜a̸̲̫̭̯͌͌̚P̨̹͐͗ä̵̧̠̹̹́̈́K̛̫̠͈̩̺͚̗̰̉̌̇͋̎̔̑̚͠P̫͕̺̂̂B̵̶̷̷̷̧̛̛̫̯̫̠̫͉͙̪͉̯̜̫̪̩͕͉̦͕͚̲̭̫͉̹̫͕̺̗̎̀͌̓̈̌͋͐͐̀͂̋̅̀̌͗͌͒̈͑̄̎̃͋̊̎̈́̚͜͝ͅä͖̦́̅͝͝P̧̱̗̗̾͌̃̾̂̎K̢̺̺̫̤̺̟̦̂͗̌̎̑͋͝ͅa̴̶̢̡̛̯͓͚̭̲̯̐̀̈͠K̶̎̽ǫ̲̫̘̹̟̌̐͑a͐K̨̢̧̝̮̯̭̯͓̯̂́k͙̯̘̆͋̈́̾̅͐̕c̴̘͕Ḵ̥̈͗k̞̞̹̖̻͆ua̟͚̺̰̹̅͗̿̎̐̃̈͝͝͠ǫ̷̵̶̷̵̨̧̨̛̰̹̯̤̗̭͈̪̝̪͕̺̠̤͓͕̺͈̱͑̎̆̋̐͌̌́̑̃͂͊͜͠e̷̺̿̌e̥͌̀͘(Ljava/lang/Object;IIFFF)I
    .registers 7

    invoke-static {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->a̷̷̧̭̠̱̦̎̂͋͂͌̋k̶͕̫̜̘͌̈́̌̑͑ȩ̴̧̤͎̠̔̅̌͝c̴̃p̴̷̸̢̢̙̤͈̟͓̦̗̎͌̅̂̂͗̃́̋͗͒̋̈́͜͜e͜ȩ̶̧̛͇̍h̶̲̦͎̼̮͈̃̐͌̈́̔͐̃͝͠͝a̭͝K͚̥͕̅̉̌̎̋̚͜͝h̷̸͎̻̟̭̗͕̬̥͎͗̔̎̂̅̓̈́̄̀̌̄K̴o̶̧̢̧̭̗͎̺̯̺̩̯͑͂̈̀̈͌̑͋͋̋̊̎̓̃̈́̐̿̑͜l̴̜͙̖̗̖̤̋̅̀̿̎͌͒͌͜͝͝͝p̶̧̧̫̼̮̋̌̏͑̈a̸̡͎̮̖̘͓̺̥͎̫̱̲̽̋̅͌̃̈́̉͜͜͝au̴̪̪̇͌͗c̸̷̷̶̨̧̛̻͚̥͕̪̫͎͉̪̃̅̀̋̑̈͊̋͐̔͌̆̃͌̈̔͐͌̚̚͝͝͝ͅa̢̛a͊K̶̸̛͉̹̻͚̗̦̺̈̔͗̈́̔͘p̹̑̐̾͘͜()I

    move-result v0

    if-gtz v0, :cond_d

    check-cast p0, Lcom/kashi/settings/view/StorageProgressBar;

    invoke-direct/range {p0 .. p5}, Lcom/kashi/settings/view/StorageProgressBar;->interpolateColor(IIFFF)I

    move-result v0

    :goto_c
    return v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static ǎ̿̚͘l͑ḩ̸̫̤̯̻͈̹̼̗̙̺̜̹͈̅͋̾̄͑̈́͌̅̑̈̎͋͗̔͗̀̂̉e͈̭͓͌̃̾̈ȩ̱̫̀̄̔̋́͗̈u̮n̢̦̅̑̑́͜͝l̵̺͎̗̯̂͗̏ö̴̮̘̋̂̏̎̏̂͘̚͜͝͝͝a̛͙̙̥̦͎͇̤̅̌̌̌̇̈́̌̌̽̅̈́͜͠ê̸̢̧͉̫̩͒̂̂̈́̈͝ą̛̫̫͎̩̦̮͋́͋l̪̭̥͓̆̃͐K̥̲̦̐̈́ļ̴̶͚̰͙͉̦̲͈̦̻̲͒̾̑̎̑̆͐̾͜͠͠͠͝͝͠͝ḩ̵̵̛͈̲̩̬̞͓̻͙̩̺̆̿̈́́͌͝͠ã̷̛̼͓̑̈̑̉͑̑̌̈̕o͂lP̷̴̨̛̛̛̠͈͉̻̟͎̹͈̮͙͚̞̺̮͎̹̟̈̽̂̂̂͌̈͗̅̋̒͜͜͝B̸̸̷̢̧̢̼͎͎̫̗̥͉̫̹͑̃̎͒́͌̋͊͗̑̔͊̈́͂̚͝͝(Ljava/lang/Object;III)Ljava/lang/String;
    .registers 5

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_d

    check-cast p0, [S

    invoke-static/range {p0 .. p3}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->k̴̴̴͎̫̤̠̓͒̂͑̾͑̈́̅a̷̶̧̲͂̌͌̕Ḇ̴̷̵̸̴̶̟̠̲͈̹̻̽̌͑̀̈́̋̀̈͑̂̃͘͜͝K̶̵̪͕̭̠̗̃͌͋l̷̛̹̝̯̿̽͆̾͘͝͝K̵̵͈̐̈n̢̦̪͌̾̈ta̷̗̗͕͋̄̍̏͘͘Ǩ͗c̵̸̸̨̢̯̥͈͈̤̤̯̫̫̫̦͗̍̔͌̔͌̌̿͌͋̍̎͒̎͜͝͝͝͠͝ea̿̏͐̑̋̑͠o̾͌͗͝K̴̷̸̨̨̧̧̧̭̦͈̯̹͈͕̪͉̈́̃͌̾͑̃ą̸̴̴̺͕̭̮̹͎̺̙͙͎͚̗̜̪̱̭̮̘̺̺͊̋̌̅́͗͑̌͌̅̎̎̎͌̐͗̌̀̑͋͗̒̉͌̚͜͠͠ͅâ̷̭̹̙̂̑͂͜u̢̧̥̹̯̥̥͓̲̝͎͑̏̚͝͝Ķ̫͚͚̈́̑ȧ͚̭̹̃c̵̸̨̖̖̺̖̆̋̌̚͘͝n͂̐̋͊h̷̽͠K̗̈([SIII)Ljava/lang/String;

    move-result-object v0

    :goto_c
    return-object v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static a̷̧͚̫̘̭̫̯̼͗͌̒̉̈͗̀͘͝p͉K̸̶̨͈̹̱͓̼͎̻͙̈́̔̏̌͌̈́̈́͜͝ͅo̴̘̟̤̺͋͋o̶̧̗̜͓͌̈͘p̭̖̟̈̔o̔o̝K̸̨̦̻̺͚͚̾̾͌̀̎̈̌͘c̶̵̶̙̟̗͌͐́̓̾͝͝ă̸̗͚̫̈͗͗ň̴̛̘̘̹͈̖̹̹̂͐̀̍͊̒̍̆̚p̷͈̈́̍͝͠ͅB̸̧̙̫̐̎̑̃͗̅Ķ̡̡̧̫̥̫͓͕͈̼͉̙̦͕̘͉͎̦͙͕̀̂̈̀̾̄̔̃͊͂̏͠ͅk̲̰̩͌̂̄̋̐̎͘͝l̵̯̮̼͉͂̋̄̀͐͘͜o̴̸͎͚̺̎͌̔͋h̥̮̫͚͑h̡̜̗͈͋̅͋̾̈̀͌B̴̛͎̥͈͋͑̾K̷̷̎͗ơ̷̪̱̩͕̬̫̲͌̎̑̈́͗̏͊̔͌̈͌͜͜͝ṳ͓͖̙͌͊̈́̈͘ul̴̗̟̫͚̮͎̫̲͋̔͌͝(Ljava/lang/Object;II)V
    .registers 4

    invoke-static {}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->â̸̫̙͓̥̭͕͕̫̈̾͂͑͜k̵̷̖͚̙̙͓͇̠̭̯̖͂̑͐͌́̎̋̂͊̌̌̋̐̍̿̈̀͠aP̿t̴͌̂͠B̵̷̧̘̺̮̭̙̯̟̮̦̾̄̉͑̎͌̌͂͌̓̈̋̍̌̑̕͘͘͜ȗ͉̃͜Ķ̼͓͎̀͊͘t̵̖̫͕͌̅̾̋̚ā̵̶̮̯̍̈̑̂͜B̴̶̸̷̛͚͈͈̯̺͎̭̹͋͒̈̂̾͌͑̃̑̀̋̎͗ǔ̲͚̺̖̪͈̩͚̈́͌̅̾͗̀̌̚̚͜k̵̶̸̮̱̄̈̈̈̀́̚͜͝Ķu̹͗ë̴̘̭͉́e̫̻͊͗͐̂͋̃̌͜͠k̷̷͚͈͚͕̘̲̻͖͎͌̈́͋̑̆͐͝ä̪̲̤l̵̷̢̨̮̫̗̯̯̫͚̤̮̥̙̿̎̈́͗̎̈̈̽̊̌̄͗̈́̐̕̚͜͝͠K̫͑̆B̖̻̘̖̤̾̅̈̌̌̑͝͝uō̍ò̸͉̱͇̙͓̱͌̎̅̚()I

    move-result v0

    if-gtz v0, :cond_c

    check-cast p0, Lcom/kashi/settings/view/StorageProgressBar;

    invoke-direct {p0, p1, p2}, Lcom/kashi/settings/view/StorageProgressBar;->animateStorageLevel(II)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method public static ã̛̩̥͈̾̒͜K̸̶̢̢͚̺̱̹̯̗̞̼̝̮̥̺̞̤̱̎́̋͊̅̂̃̋͗͗̐̎͑͗͝͝ķ̫̥̭̭̹̰̀̋͐͋̄͊͋͑̎͜͠K̶̸͕̫͌̆́͒͠͠ek̶̼ą̷̴̷̵̛̱͓̠̪̩̹̹͎͎̞̯͖͕̤̭͈̄̈́̑̂̈̔͑̋͒͑̂̈́͘͝ç̴̶̶̫͈͖̱̺̖̯̥̺͚̎̆̄̓͂͌̿̈́̌͝ā̵̫̰̬̰͚͚́́̍̎o̥P͓͓̭̫͉͈͙͈͓̥͌̅̿̾͗̉͝Ķ̵͗̔̏͝a̷̶̷̡̯̗̰͚̦̗̹͉͉͎̖̎͗̋̌̌̂̈́̉̇̈́̚͜͝͠ą̸̭̖̩͈̫͌͂̇̎͐̉̾͘͜ͅh̸͓̑̋B̴̫̤̫͈̫͇̗̐̄̎̈́̑͌̈̇͒̚͝͝ţ̷̧̫̹̲͖̙͗̏͆̅̌̐B͖̂͠e̵̸͚̭̟͕͎̖̯̹̯͖͜o̵̶̷͕̖̗̹͋͜͠ͅ(Ljava/lang/Object;I)V
    .registers 3

    invoke-static {}, Lcom/kashi/settings/view/l̥̗͌̃̈́̋̿̑͠ą̵̫̫̑̆̒̂ư̵̷̶͎̺̮̖̭͚̰͖̥͚̗̩̭͂̃͆͒̑̅̈́̋̌̆̔̎̋̌͜͠t̸̨̛̯̥̫͇͗̀̇͂̚͝Ķ̷̛͕̫̭̮̼͚̄̾̎͒̔͊̈̈́̈́͌̌͝͝͝͝K̞̥̄̅Ḱ̸̺͜ų̫͚̫̮̰͚̹̌̇̎̈́̎̎Ķ̸̷̷̧̛̛̛͉̮̦̗̼̹̫͇͙͈͎̱̪͎͈̘͓̐̎͑̉̋̋̃n̷̴̸̛̯̝͈̦̮̥͉̋̎̂̄̂̋͌͗͌̑͜͝͝͝è̷̸̷̷̶̘̦̲̤̥̭̭̬͙͚̟̥̅̌̊̔̽̾̍͋̒̌͌̅͐̚͜͜͝͝͝ac͈͋ä̺̭̼k̴̶̷̗̲͎̗̰͚̱͌̚͝͝ố̸̷̶̢̨̡̫̗̖̹̾̚͠u̶̸̸̧̧͓͉̪͎̟̫͚̎̿̑͂̈̌̇͒̌̉͘̚̚͜͠͝k̸̛̛̫̠͎̑̾̃̏̌̌͗̈̌̚;->K̴̡͌h̷̡̢͇͓͚̠̰̦̺̫͒̈́ǩ̷̶̢̫͙̗̫͇̋̍̐̈̅̾̓͝Kṱ̷̏̎P̷̘̔p̶̸̢̙͉͚͓͎̰̫̘̪͚̫̱̯̘̝̏̋̌̂̈́͑̋̂̕͝l͕̹̗̮͕̃̈́̈́a͈͈̻̤͌̌͂̂̂P̮̫͙̅͜a̾̃ǩ̵̛͈͚̙́ų͈̭̺̂̀̉̌̎̇̐͌̄̎̿͗̚̕͝͠ĉ̶̨͕̘̥̫̥̲̫̈́̈́͘͘͝ť̶̸̢̨̨̧̛̻̖̪͕̥̗͚̭̥̫͙͎͓̗̺̰̺̩͎̭̈̂́͑̏͌͑̂̈̋̾̔͊͌̈́͊̋͌̕͘͜͜͜͜a̛͇̙̗̩̔̃͗̋̐͌͐͋ě̷̢̖̜̄p͙̲̦̫̈̋B̥͌͠ͅk̸̸̴̮̲͎̰̗͎̘̞̰̦͚̼͌̈́͋͊͋̉͗̂̑̀̎̂̚e̛͌͑̈́̀̌͝k̘͇̰K̫̗̀k̸̢̩͓̲̯̭̩̭̭̺̀̌̾̈́͌͗͘͝K()I

    move-result v0

    if-gez v0, :cond_c

    check-cast p0, Lcom/kashi/settings/view/StorageProgressBar;

    invoke-direct {p0, p1}, Lcom/kashi/settings/view/StorageProgressBar;->setStorageLevel(I)V

    :goto_b
    return-void

    :cond_c
    goto :goto_b
.end method

.method private getOccupiedStoragePercentage()I
    .registers 58

    move-object/from16 v6, p0

    new-instance v6, Landroid/os/StatFs;

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ļ̶̼̗͓̌̑aṵ̢̠̫̥̅̋̌̋̍̍̑͜ö͉͌ǘ̚ơ̧̢̺̹͉̺͚̗̦̯͕̂̄͋͒̀̂̅̋̏̂̾͠͠a̴̡̦̫͎̩̫͚̯͗͗̈́͠B̶̶̰̫̞̫͎̿͌͌̒ủ̶̻̰̂͑͠p͎̻̜͒͐̄̚͜͝͝k̨̥͓̼̿̎̕K̝̪̪̖̫̿͆̓K͋l̞̺̑p̶̴̸̧̡̨͈̝͈̖̞̺̥͕̙͙̎͒̋̎̎͌͗̂̾͗͐̅͂͌̿́̑͠͝͠͝ķ̤̺͉̦̋̈́͜͝a̶̵̢̢̫̯͎͈̫̜̗̘̗̻̰̗͈̥͖̹͈̖͉̗̦̗̘͚̼̘̤͒̓̎͆̾̃̃̔̋̊͑͌͑͑̿̑̍̈͋̚̚͜͜͝B̸̶̶͚͎̫̫̘͈̮̝̌̎̓͗̂̈́͌̌́ḩ̷̵̶̷̸̧̛̛̭̪̭̫̭̥̻̺̭̤̋͌̎̿͗̑͒̂̌͌͗͋͜ô̬̖̅B̷̧̤̘̄͊̾̋͒̈̾͝()Ljava/io/File;

    move-result-object v0

    invoke-static {v0}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ḁã̴̛̠̗̱̘̌͗̾̏u̸̧̫̱̯͈͖̔͌̅͘͠ơ̸̴̷̷̢̧̩̗͚̹̪͇̥̩̗͙͎͒́͋̎̈̌͐̿̌͑̂͂̀̈͑́̑̿̚͜͠͝o̸̾̈ȩ̫̈́́̿͜a̷͖̹̙̥̠̥̯̭͗̍͋͑̀̀̾̎͝ȟ̷̸̭̽̍͐͘͝h̨͎͈̞͈̜̃͝t̷̵̸̢̛̠̥̭͕̱̮͙̘͈̺̖̐̄̾̅̄̀͑͌̈́͌̿̊ͅĶ̧̧̘̖͎͕̖̫̿͠h̴̴̨̢͚̖̭̥̬̯̟̗̯̯̺̲̆̄̋̎̎̒̑̏̿̆̑̚͘͜͜͠͝͠͝ḧ̴͓̠͉́̃̎͌̀͝K̗͙͗͌̎̐͌u͓ȇ̶̶̴̛͓͚͎̙͈̯̹̪̊̿̍͗̋̀̌̂͒͒͌̀͘͘͝K̡̒ų̶̙̰̦̮͗̃͋͂̒̿̈͜͝l̸̖̗̼̄́B́BK̴̫̹̾e̸̴̫̖͕̐͌̈͑̈́̂̊̏͜o͉ē̲a(Ljava/lang/Object;)Ljava/lang/String;

    move-result-object v0

    invoke-direct {v6, v0}, Landroid/os/StatFs;-><init>(Ljava/lang/String;)V

    invoke-static {v6}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->a̸̶̛̺͚̬̐̋͋͗͌̏́̅͊͘a̷̧̫̙̋͊̀͌̇K̗̘͜P̷̢̧̛̺̺̮̫̭̹̹͙̤̈̃̈́̋̇͗̾͗̂̌̌̆̐͜͠͝͝͝͝ô̵̧̫̪͝ļ̨̛̘͖͎̗̖̌̂̋̾͐̈͘̚͜͝ḁ̛̍̅c̢̛͉̱͈̺̺̘͚̗͇̫̜͈̪̘͉̩̪͕̋̈̂̈͆͑̄̐͗̋̐̂̈̃̌͒͊̃̎̐͋͋͌̍͘͜͝ǹ̴͇͓̖̪̯͚̺̲̺̿̅̄̅̈́͊͝͝͠K̶̶̙̫͈̲̗͓̗̦͇͈̂͋̈̿̂̑̍͑͘ĥ̶̨̧̛͙̼͌̈̑͜ḽ̷̵̴̸̪̫̯̜͇́̍̾̈́̋̈́̃̃̈́̌͌͘͝B̜̤̻͉̤̤̭͕̑̀̂̅͌͋̌̈̑t̥͎̗̗̰͓̹́̎̍̔̀͝Ḇ͌́Kä̷̛̯̹̱́͗͝p̃Ḵ̸̛Ḱ̺̗̕ļ̵̶̺̫̬͈̹̫̮̆̀̏̆̆͋̾̒͜͝(Ljava/lang/Object;)J

    move-result-wide v0

    invoke-static {v6}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->Ǩ̷̸̨̛̭͚͖̹̤̭̱͓̯̄̀̏̾̂̔͂̔͘̕͜ņ̸̵̛̛͎̭͖͚̠̹̜͈̘̘̯̫͉̮͓̙͕̮̺̅̾̾͌͊̿̀̈́̃͗̈̿͋̅̽͋͌̚͘͜͠͝͝͠ȟ̷a̔k̩͚͗͠ư͚̙̼̠̭̎̈́̿͐͌̏ṯk̲͜ä̸̵̢̨̭̝̹͉̹̠̘͓̯̘̈̃͋͒͝͠͝p̴̮͊ǫ̸̷̛̗͎̂͋̌̾͝n̷P̵̶̧̛̛̗̺͙̘̱͎̰̎̈̐̓͜ţ̭̯̂̃B̛͙̯̫̏͌̂͘͜t̥̂P̸̸̧̢̧̛̛̭̹͖̙͉̺̗̥̭̭̮̗̋͋̃̑̃̎͗̅͋̈̋͂͊̋̿̈̑͗̊͊̏̃̿͌̅̚͠͝͝͝͠ͅaų̪t͎͊ö̸̴̰̰͐͆͠a̸̛̭͖͘ã̫̱̋̊̅̂Ķ̴̸̴̛̛̛͕͚̜̩̫̠͇̭̫͎̺͑̀͑̿̿͂͑̉̂̈̋͜͜͜͜k̈(Ljava/lang/Object;)J

    move-result-wide v2

    sub-long v2, v0, v2

    const-wide/16 v4, 0x64

    mul-long/2addr v2, v4

    div-long/2addr v2, v0

    long-to-int v6, v2

    return v6
.end method

.method private init()V
    .registers 56

    move-object/from16 v4, p0

    invoke-static {v4}, Lcom/kashi/settings/view/StorageProgressBar;->l̸͎̞͇̠̦͓̭̯̈́̉̆͑̋̎̐̄̊̊̀̈͘Kk̶̴̢̧̧̥̭͈̦̻͎͚̥̑̿̂̂̋̿̈̑̃̆͗͋͋͑͝͝ͅu̧̗̦̘͚͓̎̐͗̃̿̂̂͘ķ̶̸̶̹̗͈̲̼͈̘̯̘̑͑̇̅̇̃̀͒̔͜͜PK̶̸̬K̴̛̗̱̼̎̂̓̒͂͘͝a̢͓͎̹̯̦̦̮͚̫͌͋͋͠t̛̹̃͘͝ǎ̰̫̱̤̰̗̬͕͗͌͐̌̐̑͘͠k̷̘͉̤̦͓͕̔̽̋̄ṅ̄k͚̋͂̋̀͒͋͒ļ̴̱͕̝̩͑̂͂̈́ǫ̸̧̖͎͈̺̥̱͕̮̗̬̹̗̆̍̒͐̌͑͌͊̾̃̕͜͝͝uȇ̴̥̿͜ͅl̸̶̸̫̭̲͓̜̠̯̫̙̺̭̰̱͈̗͓̥̰̘̥̂̅̂̈̅̑́͌̂͋͗̾̅͑̑͗̚͘͜͠͝Ḇ̶̛̫̫͓͉̠̗͉͐͗̋̋̎̋̂̋̚͜͝͝ǖ̹̈́ͅ(Ljava/lang/Object;)I

    move-result v0

    invoke-static {v4, v0}, Lcom/kashi/settings/view/StorageProgressBar;->ã̛̩̥͈̾̒͜K̸̶̢̢͚̺̱̹̯̗̞̼̝̮̥̺̞̤̱̎́̋͊̅̂̃̋͗͗̐̎͑͗͝͝ķ̫̥̭̭̹̰̀̋͐͋̄͊͋͑̎͜͠K̶̸͕̫͌̆́͒͠͠ek̶̼ą̷̴̷̵̛̱͓̠̪̩̹̹͎͎̞̯͖͕̤̭͈̄̈́̑̂̈̔͑̋͒͑̂̈́͘͝ç̴̶̶̫͈͖̱̺̖̯̥̺͚̎̆̄̓͂͌̿̈́̌͝ā̵̫̰̬̰͚͚́́̍̎o̥P͓͓̭̫͉͈͙͈͓̥͌̅̿̾͗̉͝Ķ̵͗̔̏͝a̷̶̷̡̯̗̰͚̦̗̹͉͉͎̖̎͗̋̌̌̂̈́̉̇̈́̚͜͝͠ą̸̭̖̩͈̫͌͂̇̎͐̉̾͘͜ͅh̸͓̑̋B̴̫̤̫͈̫͇̗̐̄̎̈́̑͌̈̇͒̚͝͝ţ̷̧̫̹̲͖̙͗̏͆̅̌̐B͖̂͠e̵̸͚̭̟͕͎̖̯̹̯͖͜o̵̶̷͕̖̗̹͋͜͠ͅ(Ljava/lang/Object;I)V

    const/4 v0, 0x0

    invoke-static {v4}, Lcom/kashi/settings/view/StorageProgressBar;->l̸͎̞͇̠̦͓̭̯̈́̉̆͑̋̎̐̄̊̊̀̈͘Kk̶̴̢̧̧̥̭͈̦̻͎͚̥̑̿̂̂̋̿̈̑̃̆͗͋͋͑͝͝ͅu̧̗̦̘͚͓̎̐͗̃̿̂̂͘ķ̶̸̶̹̗͈̲̼͈̘̯̘̑͑̇̅̇̃̀͒̔͜͜PK̶̸̬K̴̛̗̱̼̎̂̓̒͂͘͝a̢͓͎̹̯̦̦̮͚̫͌͋͋͠t̛̹̃͘͝ǎ̰̫̱̤̰̗̬͕͗͌͐̌̐̑͘͠k̷̘͉̤̦͓͕̔̽̋̄ṅ̄k͚̋͂̋̀͒͋͒ļ̴̱͕̝̩͑̂͂̈́ǫ̸̧̖͎͈̺̥̱͕̮̗̬̹̗̆̍̒͐̌͑͌͊̾̃̕͜͝͝uȇ̴̥̿͜ͅl̸̶̸̫̭̲͓̜̠̯̫̙̺̭̰̱͈̗͓̥̰̘̥̂̅̂̈̅̑́͌̂͋͗̾̅͑̑͗̚͘͜͠͝Ḇ̶̛̫̫͓͉̠̗͉͐͗̋̋̎̋̂̋̚͜͝͝ǖ̹̈́ͅ(Ljava/lang/Object;)I

    move-result v1

    invoke-static {v4, v0, v1}, Lcom/kashi/settings/view/StorageProgressBar;->a̷̧͚̫̘̭̫̯̼͗͌̒̉̈͗̀͘͝p͉K̸̶̨͈̹̱͓̼͎̻͙̈́̔̏̌͌̈́̈́͜͝ͅo̴̘̟̤̺͋͋o̶̧̗̜͓͌̈͘p̭̖̟̈̔o̔o̝K̸̨̦̻̺͚͚̾̾͌̀̎̈̌͘c̶̵̶̙̟̗͌͐́̓̾͝͝ă̸̗͚̫̈͗͗ň̴̛̘̘̹͈̖̹̹̂͐̀̍͊̒̍̆̚p̷͈̈́̍͝͠ͅB̸̧̙̫̐̎̑̃͗̅Ķ̡̡̧̫̥̫͓͕͈̼͉̙̦͕̘͉͎̦͙͕̀̂̈̀̾̄̔̃͊͂̏͠ͅk̲̰̩͌̂̄̋̐̎͘͝l̵̯̮̼͉͂̋̄̀͐͘͜o̴̸͎͚̺̎͌̔͋h̥̮̫͚͑h̡̜̗͈͋̅͋̾̈̀͌B̴̛͎̥͈͋͑̾K̷̷̎͗ơ̷̪̱̩͕̬̫̲͌̎̑̈́͗̏͊̔͌̈͌͜͜͝ṳ͓͖̙͌͊̈́̈͘ul̴̗̟̫͚̮͎̫̲͋̔͌͝(Ljava/lang/Object;II)V

    invoke-static {v4}, Lcom/kashi/settings/view/StorageProgressBar;->l̸͎̞͇̠̦͓̭̯̈́̉̆͑̋̎̐̄̊̊̀̈͘Kk̶̴̢̧̧̥̭͈̦̻͎͚̥̑̿̂̂̋̿̈̑̃̆͗͋͋͑͝͝ͅu̧̗̦̘͚͓̎̐͗̃̿̂̂͘ķ̶̸̶̹̗͈̲̼͈̘̯̘̑͑̇̅̇̃̀͒̔͜͜PK̶̸̬K̴̛̗̱̼̎̂̓̒͂͘͝a̢͓͎̹̯̦̦̮͚̫͌͋͋͠t̛̹̃͘͝ǎ̰̫̱̤̰̗̬͕͗͌͐̌̐̑͘͠k̷̘͉̤̦͓͕̔̽̋̄ṅ̄k͚̋͂̋̀͒͋͒ļ̴̱͕̝̩͑̂͂̈́ǫ̸̧̖͎͈̺̥̱͕̮̗̬̹̗̆̍̒͐̌͑͌͊̾̃̕͜͝͝uȇ̴̥̿͜ͅl̸̶̸̫̭̲͓̜̠̯̫̙̺̭̰̱͈̗͓̥̰̘̥̂̅̂̈̅̑́͌̂͋͗̾̅͑̑͗̚͘͜͠͝Ḇ̶̛̫̫͓͉̠̗͉͐͗̋̋̎̋̂̋̚͜͝͝ǖ̹̈́ͅ(Ljava/lang/Object;)I

    move-result v0

    iput v0, v4, Lcom/kashi/settings/view/StorageProgressBar;->storageLevel:I

    new-instance v0, Landroid/os/Handler;

    invoke-static {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ňē̶͚̪̻͖̄̄̌͆̈̃͜͝p̶̴̸̧̡̛̤̱̫̭̰͉͖͎̯̺̤̖͓̰͌̑̈͋̈́͌̅̈̈͌̒̐̀͋̕͜͝͠͝͝K̷̸̛̤̱͓̪̫̟̟̺͉̻̤̯̑͒̾̾̋̋̏͗́̋̈́̔̎̐͋͘a̴̷̫̘̥̿͐̈͘l̫̭̫͋̉́͌̃͜ͅǨ̸̴̥̫͓͚̯̱͚̘͕̖̗̹̇̎̌̆̎̈́̋̈́̑͑̋̕̕͜͠o̸͎̲͐̃̚a̸̵̧̛̝̮̻̻͉̜̮̤̭̙͋̅̋͐͗̂̆͌̔͋̎̒̃͝ǘ̯̌pă̷̠͈̽͝ǎ̸̛͓͎̖̯̩̉́͜h̶a̧̻̫̍͑̂̾̍̚͘͜͝p̩̥̑͂̕͝a̬kǩ̸̢͕͚̤̥̤̙͙̌̋́͋͘̕͜ö̸̝̲̟̩͙̤̦͎̪̑̽͗̒͝a̶̙͖̺͙̙͗̈͐͌̈͑ĉ̷̸͙̺̫̥̤̺͉̗̎͌̿̅̏͂͝͝͝t̞̯͙()Landroid/os/Looper;

    move-result-object v1

    invoke-direct {v0, v1}, Landroid/os/Handler;-><init>(Landroid/os/Looper;)V

    new-instance v1, Lcom/kashi/settings/view/StorageProgressBar$1;

    invoke-direct {v1, v4, v0}, Lcom/kashi/settings/view/StorageProgressBar$1;-><init>(Lcom/kashi/settings/view/StorageProgressBar;Landroid/os/Handler;)V

    const-wide/16 v2, 0x7d0

    invoke-static {v0, v1, v2, v3}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->K̢̫̹͙̬͓̬̘̀̀̃͐͘͘͜n̸̛͚̗̮̑͒̀o͈͌̏̚͝p̯͈͉̑ļ̮̯̭̪̼ţ̸̸̢̢̢̢̛̯̫̱̝͎̱͙͕͓͉͕̟̼͎̯̟̯̮̖̯̰̰̞͚͉̂̏͒͌̅̿̋͗̆̅͐̎͑͑̄͑̂̈́͜͜͠͝͠͠͝t̯̆̿̈̆͝P̦̟̀̊̿P̷̶̷̶̧̛̤͎̟̺̱̙͕̪͈̦̂̃͋̎͊̋͌̍̈͋̉͊̓̐̚̕͜͠͝e̫Ķ͌͝K͈̈́̾͋ę̶̴̶̧̛̙̦̮̫͖̥̠̺̫͉̱̟̲͓̘̰͓̯̙̮͌̿̌̅̌̿̋͑͂͋̈̌̑̂̈́̽͋͋̌͊̏̌͗͗̔̌̌͑͊͆͑̅̚̚̚͜͝a͐̄́̇o̸̧͚̫̞̯̫̻͙̪̺͒͂̽͐̇̑̿͑̄̋͂̚̚̚͜͝ȧ̷̶̸̱̹͚̅̄͒̚͝p̶̘̰̱̀͌̌͗̏̀l͈̲aa̸̶̗̟̘͕̠̋̌̑͋̆(Ljava/lang/Object;Ljava/lang/Object;J)Z

    return-void
.end method

.method private interpolateColor(IIFFF)I
    .registers 57

    move/from16 v5, p5

    move/from16 v4, p4

    move/from16 v3, p3

    move/from16 v2, p2

    move/from16 v1, p1

    move-object/from16 v0, p0

    int-to-float v0, v1

    sub-int/2addr v2, v1

    int-to-float v1, v2

    sub-float/2addr v3, v4

    sub-float/2addr v5, v4

    div-float/2addr v3, v5

    mul-float/2addr v1, v3

    add-float/2addr v0, v1

    float-to-int v0, v0

    return v0
.end method

.method public static ln̷̩͈͇̫͈̙̮͌͋͌̔͗̋̋̃̎͆k̸̴̛̫͈͎̹̗̪̭̭̮̮̼̇̿̈́̑̎̚͝͝ḧ̭̱Pk͙̥̦͉̪̯̗̀͋K͉̱̫̘̙̙̯̲̅̑̂͗̊̈́ͅà̶̰̯͙̈́͗̅c̢̙̾͐͑͌̌̑̀̍̑h̴̤̫̯͙͗̌K͈n͈͜ầ̵̸̸̴̸̸̷̛̘̹̫̦͙͚͕̦̰̫̫̮͌̿̂̎̅̋̃̋͌̌̈̑͋͘͝ḛ̷̛̫͚͎̱̈͂̋̌̑̿͌͌̿̄͘̚ö̸̷͚̘̪̭̙̘̮̫̮̰̗͙̰̜́̀̃̈̿̑̋́̈̽̍͋̋̅́͗̔́̆͘͜͝ͅḧ͓̥́̋͂̌͠ͅn̸̫͚̻̹̦͌̄͋̌p̧̟e̞͋͐̓̌͘͜͝ơ̶̸̷̧̢̧̢̰͈̘̦̹̪͉̻͎̪̥̬͌́͋͐̅͗̇̿͗̏͊͊̑͘͜͜͝ả̬̺͊͘p̢̢̺̭̭̫̫̺̈́̀͌̌p̹͓̯̈()[S
    .registers 1

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_9

    sget-object v0, Lcom/kashi/settings/view/StorageProgressBar;->short:[S

    :goto_8
    return-object v0

    :cond_9
    const v0, 0x0

    goto :goto_8
.end method

.method public static l̸͎̞͇̠̦͓̭̯̈́̉̆͑̋̎̐̄̊̊̀̈͘Kk̶̴̢̧̧̥̭͈̦̻͎͚̥̑̿̂̂̋̿̈̑̃̆͗͋͋͑͝͝ͅu̧̗̦̘͚͓̎̐͗̃̿̂̂͘ķ̶̸̶̹̗͈̲̼͈̘̯̘̑͑̇̅̇̃̀͒̔͜͜PK̶̸̬K̴̛̗̱̼̎̂̓̒͂͘͝a̢͓͎̹̯̦̦̮͚̫͌͋͋͠t̛̹̃͘͝ǎ̰̫̱̤̰̗̬͕͗͌͐̌̐̑͘͠k̷̘͉̤̦͓͕̔̽̋̄ṅ̄k͚̋͂̋̀͒͋͒ļ̴̱͕̝̩͑̂͂̈́ǫ̸̧̖͎͈̺̥̱͕̮̗̬̹̗̆̍̒͐̌͑͌͊̾̃̕͜͝͝uȇ̴̥̿͜ͅl̸̶̸̫̭̲͓̜̠̯̫̙̺̭̰̱͈̗͓̥̰̘̥̂̅̂̈̅̑́͌̂͋͗̾̅͑̑͗̚͘͜͠͝Ḇ̶̛̫̫͓͉̠̗͉͐͗̋̋̎̋̂̋̚͜͝͝ǖ̹̈́ͅ(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_d

    check-cast p0, Lcom/kashi/settings/view/StorageProgressBar;

    invoke-direct {p0}, Lcom/kashi/settings/view/StorageProgressBar;->getOccupiedStoragePercentage()I

    move-result v0

    :goto_c
    return v0

    :cond_d
    const v0, 0x0

    goto :goto_c
.end method

.method public static oe̡̢̛̠͕̖͌̿̆͒̓̐aľ̸̴̢̧͈̠̯̭̥͓̱̾͒̍͒͗̋͜͝n̷̶̦̲̙͚̥̪͉̥̼̯̈̑̅͘h̶̸̶̶̨̧̢̪̖̱̙͈̾̃̋́̂̒̅̓͊͜ĉ̨̛̛̪̖̦̫̗̫͚͚̞̌̆̑͂̑̈̎̐͆͑̽͘͘̚͘͜K̷̸̵̛̫̺̹̗̲͓͉̋̓̍͒̍̊̈̄̌̽͜͜͝͝͝ç̸̲̠̗̱̫̖̫̗̱͚̫͈̱̹̈̍̄̃́͌̔̀͌͗̓̋̑̂̿̈̍̈́̈̔̿̕̚͝͠͝ȃ̤̟͈̖͙͂͑͘͝o̷̦äB̵̛̄̿̃̀́̎̾͑K̸̻̱͑̋h͗ṯo̧̠̺͙͂̈́̍̋K̷̷̶̗̱̹͉̹̄̌̈́̒͐̋̃̊̃͒̈́̈́̔̌u̸̴̧̲͐̚B̶͌ǘ̶̸̧͚̮̥̻͎̩͕̜̙͚͓̩̭͑́͗̌̋́͆̂̋̀̏̈̏̐̃͝͝͝͝l̨o̷̧̧̼̠(Ljava/lang/Object;)I
    .registers 2

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ą̸̫̪͚̯͎̮̘͗̈͝a̸̧̺̩̺̪͓͈̾͆̑p̶̛̲̱͇̪̋̈́͌o͚͎̹͑͋͗͋̌͘͝Ḵ̸̘̆͌t͕̆͋͌l̪B̀k̷͉̥͈̦̪̩̂͑̀͌̀͐̕͜͜͝͝͝c̶̴̡̛̗̜̱̲̭͓͓̞̗̹͊̎̂̋̉͜͝ư̶̶̢̢̭͓͚̙̯͇̌̀̑̆͋͊͝͝nl̶͎̎̑̃̒t̿ḩ̷̨̪̮͉̥͉̫̯̯̫̱̋͑̐̎̅͘͘͝K̴͈̘̃̆ȃ̴̟͓̯̖̃̃̈́͆̈́̑̆̌̆k̢͚͑̿̎̌K̹͓͋̈́̆̋Ǩ̛̺̖͋̀̌̔̚̕t̙̦͕̘͕̺̂̂̈́̈̌͌͊͝͝p̟̫̱͋̄̋ͅpK͕̯͠ą̠̭̭́̋̃͋͆͘͝ñ̙̿̾͋͘P̷̟͇͎͓͌̈́͜͜͝an͚͈̖̥̐̋̄͑̊̂̿͜͜͝͠n̨̛̮̋͆̋K̯̘̋̉͠t̢͎̭̏̌͑͌̎()I

    move-result v0

    if-ltz v0, :cond_b

    invoke-static/range {p0 .. p0}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->n̫̤͙̦̂̃̄̍͘͜͠c̴͎̫̬̠̞̋̈̈́̀͐͜͝͠͠͝K̵̛̼͋̍̌n̵̸̻̠͕̥̂ä̘̬̥͌̏͝oa̴̶̸̧̩̯͈̋̈́͝c̵̛̩͓̗̹̺̦͉̖̼̯̋̑͌̎̿̋̔͒̿̋̌͌͘͝a̛̩̹̹͐̄̓̅͗B͖͓̫͉̔͌oa̤͚̋̂͜ẖ͙a̸̛̛̞̦̫̭̿̋̌͌͋̂̿͘͠K̴̸̷̸̛̦̯̹̺̘͇͎̦̭̉͂̎̏̾̽͗͆̅̂͑̾͗̈́̅̈́̑͘̚͘t̷̷̵̶̶̶̴̨̧̗̗̘͕̰͈̠̱̠͈̺͉͇͓̙̫̮͕̪͎͎̗̝̼͊̿̑̈̋̌͂̽͗̋̍͐̆̈́̃͗̑͗̑̈́͌̒̀̀̌̓͂̄̐̑͒̚͘͜͜͜͜͠͠K̠͈̫̻̲̫͂̎̋̂͒͠a̮̤̫̪̎̃͜o̧u͇P͉ḻ̷̺̲̫̺̦̫̗̺̫̫̫̻̎̂́̈͌͐̽͌͊͗̀̌̽͘͜(Ljava/lang/Object;)I

    move-result v0

    :goto_a
    return v0

    :cond_b
    const v0, 0x0

    goto :goto_a
.end method

.method private setProgressBarColor(I)V
    .registers 65

    move/from16 v13, p1

    move-object/from16 v12, p0

    invoke-static {v12}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->o̡̨̢̪̱̱̺̻̪̯̱̩͑̈͗̊̚͝ta̧̦̹̻͕̤̯̱͚̝̖̙̲̪͎̖̽̌̍̿͑̋̾͗̉̋̈́̈͘͘͜ķ̸̸̶̸̴̨̢̹͕͚̙̗̱̯̱͓̥̫̫̭̗̖̞͎͕̪̆̎͗̔̋͋̋͑̾͘̚͝͝ͅu̶͖͚͐̇͠ĺ̛͇̘̲͕̈͌̄B̫̐h̸nt̵̨̪̺̥͓͈̰̙͚̞́̅̂̋̃̅̑̋͝͝͝͝͝ḁ̧̈̋͜c͚͓͗l̯̈̀̈́ȩ̸̴͎̲͚͕̯͗̾̂̄͘͜BKh̸̗̖͌̒̋̈́p̛̹̲e̛̦͌̂K̶̶̶̵̛͙̫̰̯̥̫̦̹̍̌̈̿̇̔̎͝ͅua̸͓̤͈a̧̖̗͎͒͌ç̸̵̶̭̺̭̹̮̺̹̮̦̪̺̆͑́͋̂̑̔̋͌̀͗̆̃̎͜͝a̷̷̢̧̲̫̭̘͕̫͋̋́̎̅̈́͗͘͜͝t̷̢͈͈̻̙̮̮̾̈́̆̆̔͑̿̆͘̚͜(Ljava/lang/Object;)Landroid/graphics/drawable/Drawable;

    move-result-object v0

    instance-of v1, v0, Landroid/graphics/drawable/LayerDrawable;

    if-eqz v1, :cond_88

    check-cast v0, Landroid/graphics/drawable/LayerDrawable;

    const/16 v2, 0xff

    const/4 v3, 0x0

    int-to-float v7, v13

    const/4 v5, 0x0

    const/high16 v6, 0x42c80000  # 100.0f

    move-object v1, v12

    move v4, v7

    invoke-static/range {v1 .. v6}, Lcom/kashi/settings/view/StorageProgressBar;->a̋̈́̅͋͜a̸̲̫̭̯͌͌̚P̨̹͐͗ä̵̧̠̹̹́̈́K̛̫̠͈̩̺͚̗̰̉̌̇͋̎̔̑̚͠P̫͕̺̂̂B̵̶̷̷̷̧̛̛̫̯̫̠̫͉͙̪͉̯̜̫̪̩͕͉̦͕͚̲̭̫͉̹̫͕̺̗̎̀͌̓̈̌͋͐͐̀͂̋̅̀̌͗͌͒̈͑̄̎̃͋̊̎̈́̚͜͝ͅä͖̦́̅͝͝P̧̱̗̗̾͌̃̾̂̎K̢̺̺̫̤̺̟̦̂͗̌̎̑͋͝ͅa̴̶̢̡̛̯͓͚̭̲̯̐̀̈͠K̶̎̽ǫ̲̫̘̹̟̌̐͑a͐K̨̢̧̝̮̯̭̯͓̯̂́k͙̯̘̆͋̈́̾̅͐̕c̴̘͕Ḵ̥̈͗k̞̞̹̖̻͆ua̟͚̺̰̹̅͗̿̎̐̃̈͝͝͠ǫ̷̵̶̷̵̨̧̨̛̰̹̯̤̗̭͈̪̝̪͕̺̠̤͓͕̺͈̱͑̎̆̋̐͌̌́̑̃͂͊͜͠e̷̺̿̌e̥͌̀͘(Ljava/lang/Object;IIFFF)I

    move-result v13

    const/4 v5, 0x0

    const/16 v6, 0xff

    const/4 v8, 0x0

    const/high16 v9, 0x42c80000  # 100.0f

    move-object v4, v12

    invoke-static/range {v4 .. v9}, Lcom/kashi/settings/view/StorageProgressBar;->a̋̈́̅͋͜a̸̲̫̭̯͌͌̚P̨̹͐͗ä̵̧̠̹̹́̈́K̛̫̠͈̩̺͚̗̰̉̌̇͋̎̔̑̚͠P̫͕̺̂̂B̵̶̷̷̷̧̛̛̫̯̫̠̫͉͙̪͉̯̜̫̪̩͕͉̦͕͚̲̭̫͉̹̫͕̺̗̎̀͌̓̈̌͋͐͐̀͂̋̅̀̌͗͌͒̈͑̄̎̃͋̊̎̈́̚͜͝ͅä͖̦́̅͝͝P̧̱̗̗̾͌̃̾̂̎K̢̺̺̫̤̺̟̦̂͗̌̎̑͋͝ͅa̴̶̢̡̛̯͓͚̭̲̯̐̀̈͠K̶̎̽ǫ̲̫̘̹̟̌̐͑a͐K̨̢̧̝̮̯̭̯͓̯̂́k͙̯̘̆͋̈́̾̅͐̕c̴̘͕Ḵ̥̈͗k̞̞̹̖̻͆ua̟͚̺̰̹̅͗̿̎̐̃̈͝͝͠ǫ̷̵̶̷̵̨̧̨̛̰̹̯̤̗̭͈̪̝̪͕̺̠̤͓͕̺͈̱͑̎̆̋̐͌̌́̑̃͂͊͜͠e̷̺̿̌e̥͌̀͘(Ljava/lang/Object;IIFFF)I

    move-result v1

    shl-int/lit8 v1, v1, 0x10

    const/high16 v2, -0x1000000

    or-int/2addr v1, v2

    shl-int/lit8 v13, v13, 0x8

    or-int/2addr v13, v1

    const/4 v1, 0x0

    or-int/2addr v13, v1

    invoke-static {v12}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->a̭̋ö̷̢̨̗̹̫͈̈͑͗̂̚͝Ką̴̫̅̑̈́̌̎ḁ̷̸̶̧̛̖̯͌̿̀͘̚͝Ṕ̷̶̷̡̛̯͚̱̗͇̩̥̥͕̮͙̫͎̘͎̫͓̺̎̐̌̌̌̂̎̾͜K̶̩̯̺̱̫̈́̆̋̆́͜ţ̵̢̯̱̺̭̮̯̗̺̼̍̿̈̔̎̈̂̆̎̎̂͐ǘ̴̴̶̴͙̟͎̫͌̽̇͒̅̉̃̂͝o̸͉͆́a̺̫͑̂͋͝ą̸͈̟̼͚̫͙̬͊̎̒̾͝Ķ̵̢͕̙͓͒̌̚͝͝a̸̧̧̝̥̾̒̋̋̎̅ȧ̾̍B̮ù̷̵̴̮͈̯̫̂̃̑̔̇̌̅͂͂͝a̴̶̸̷̢̛̗̺̯̪̱̤͖̰̘͑̃̑̂̓̿̌͂̓̂͝͝ȩ̸̶̴̼̼̤̯͉̹̹͓̘͎̺͉̗͎͉͖̙̖̤̃͋̄͂̈́̅͌̆̋̅͑̕͘̚͜͜͝͝t̨̖̞̄͜͝K̴͕̆͜ą͈̟̥̋͒̑(Ljava/lang/Object;)Landroid/content/Context;

    move-result-object v12

    invoke-static/range {}, Lcom/kashi/settings/view/StorageProgressBar;->ln̷̩͈͇̫͈̙̮͌͋͌̔͗̋̋̃̎͆k̸̴̛̫͈͎̹̗̪̭̭̮̮̼̇̿̈́̑̎̚͝͝ḧ̭̱Pk͙̥̦͉̪̯̗̀͋K͉̱̫̘̙̙̯̲̅̑̂͗̊̈́ͅà̶̰̯͙̈́͗̅c̢̙̾͐͑͌̌̑̀̍̑h̴̤̫̯͙͗̌K͈n͈͜ầ̵̸̸̴̸̸̷̛̘̹̫̦͙͚͕̦̰̫̫̮͌̿̂̎̅̋̃̋͌̌̈̑͋͘͝ḛ̷̛̫͚͎̱̈͂̋̌̑̿͌͌̿̄͘̚ö̸̷͚̘̪̭̙̘̮̫̮̰̗͙̰̜́̀̃̈̿̑̋́̈̽̍͋̋̅́͗̔́̆͘͜͝ͅḧ͓̥́̋͂̌͠ͅn̸̫͚̻̹̦͌̄͋̌p̧̟e̞͋͐̓̌͘͜͝ơ̶̸̷̧̢̧̢̰͈̘̦̹̪͉̻͎̪̥̬͌́͋͐̅͗̇̿͗̏͊͊̑͘͜͜͝ả̬̺͊͘p̢̢̺̭̭̫̫̺̈́̀͌̌p̹͓̯̈()[S

    move-result-object v48

    const v51, 0x1ace40

    invoke-static/range {}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̶lP̫͗͌o͕͉̘̫͋̌̈̂͌̑̾̈͊̕eą͓͙̑̾̎͜e̹̹̤̯͋͋̈B̍̂ǎ̴̮̇ĉ̸̸̤̹̝̱͈͌͗̂̆͘͘͜͝͝a̸̘̰͓̹̫̎̔͐t̸̝͒̅͗͗̎̎͂̑̅͊͘͘B̸̷̴̸̢̫͈͚̺͈̙̯̱͚̤̻̋̂̈́͌̉͌̂̋̓͆͊̈́̌̎̔̚͜͜͠û̴͐͘͜͠ó̴̄̎Ķ̵̦͚̺͈̦̗̇͋̎͋͋͗̿̀̄͗̌͜a͑͘c̸̛͈̺̭͈̪͒̿̿͌̈̋̔͝ä̢̨̭̮̙̫̰̙͓̎̂̿͜͜͝a̸̸̸̸̷̷̵̢̧̨̨̢̛̛̞͈̟̜͈̫̘̦̩͓͕̦̮͉̜̰͎͚̾̑͒͗̈́̉̂́̅̒͗̈́̈́̂̅͐̽̋̍̌̾̑̋͗̆̀̋͂̈́̐̂̆̂̿̋͗̋͋̏̒͊̈́̚̚͘͘͜͜͝͝͠͝a̶̧̧̘̪̦͋̔͝ķ͚̏̄̈́̎̌͒͝()Ljava/lang/String;

    move-result-object v47

    invoke-static/range {v47 .. v47}, Lcom/kashi/settings/view/StorageProgressBar;->oe̡̢̛̠͕̖͌̿̆͒̓̐aľ̸̴̢̧͈̠̯̭̥͓̱̾͒̍͒͗̋͜͝n̷̶̦̲̙͚̥̪͉̥̼̯̈̑̅͘h̶̸̶̶̨̧̢̪̖̱̙͈̾̃̋́̂̒̅̓͊͜ĉ̨̛̛̪̖̦̫̗̫͚͚̞̌̆̑͂̑̈̎̐͆͑̽͘͘̚͘͜K̷̸̵̛̫̺̹̗̲͓͉̋̓̍͒̍̊̈̄̌̽͜͜͝͝͝ç̸̲̠̗̱̫̖̫̗̱͚̫͈̱̹̈̍̄̃́͌̔̀͌͗̓̋̑̂̿̈̍̈́̈̔̿̕̚͝͠͝ȃ̤̟͈̖͙͂͑͘͝o̷̦äB̵̛̄̿̃̀́̎̾͑K̸̻̱͑̋h͗ṯo̧̠̺͙͂̈́̍̋K̷̷̶̗̱̹͉̹̄̌̈́̒͐̋̃̊̃͒̈́̈́̔̌u̸̴̧̲͐̚B̶͌ǘ̶̸̧͚̮̥̻͎̩͕̜̙͚͓̩̭͑́͗̌̋́͆̂̋̀̏̈̏̐̃͝͝͝͝l̨o̷̧̧̼̠(Ljava/lang/Object;)I

    move-result v47

    xor-int v51, v51, v47

    const v49, 0xdc00

    invoke-static/range {}, Lcom/kashi/settings/view/p̂P̗tn̸̶̶͙̺̹̂͝n̷̮͌̉͝h̭͉͐̓̋͌̈́͌ǒ͖̺͉͌̋͌͝ǎ̶̙̯̥̙̻̩̦͊̃̅̊̈́͐̈́͜͜͝pu͐͊a̩e̱̲͝ằ͚̩̰͙̬̔͆ä̫́K̸̷̶̴̸̷̢̨̢̛̛͖̫͉̯͈̟̻̦̘͈̙̱͚͚̹͎̍̂̈̇̈̂̎͐̌̆͗̅͌̌̄͐̍͋̾͌͗̎̂͂̑͗͋͑̅̎͘͜͜͝͠͝l͊̉a̸̧̧͚̝̺͓̺̍̌͋̅̉̈́̈́̄̚͘͜l̨̗̃̿ĉ̶̷͈̘̺͕̘͌̈̃̋̓̄̿̀́P̯̐͝Ǩ̩̾̉͜ȃ̫̝̫c͚̱͋̐͘͝e̛̹̤̹͌Bak̷̢̨̜̅͌P̸̶̨̨̩͚̮͕̼͚͎͚̤̩͙̤̟͈͎͈̬̪̪̭̗̗̙͎̗̯͂̑̌͗̎̀̅̍̄̌̂̑̅͐̈́͋̂̃͗͌̈́͋͘͘̚͜͝͝͝ͅñ̥̝͚́̈Ǩ̺;->ą͖́p̸̴̢̧̛͉̖̦̺͚̙͈͚̠͈̫̬̱̫̱͕̜͉͑̄̌̂̊̈̌͑̅͗͌̄͊̅̎͗̑̋͌̑͋̚̕͘͝͝h̶̦̠̲͓͈̫̱̫̱̭̯͚̬̭̭͕̒̿̂̏̍̌̈́̎͗̾͋́̈́t͚a͆K̭̺̫̝̱͗͌̌B̴̸̴̧̻̗̀̎̉̀͜͜Ķ̵̯̩͖̥̐̈́̈̃̌͠ň̵̼̮͉̬̰͈͈̮̄̊͊̈̌̈́͜͝͠͠B̨͙̦̯̠̊͋̌͑͆̈́̃̽͜͝ċ̛̭̻̪̰̮̐̆eą̴̧̛͇̞͉̥̗̘͗͋̽̍̀͋̂̋̈́̾͗̌̑̐͌hh̵̴͕͙̹̻͌͒͑̚a̯̱̿̄͂ő̶̷̫̺̘͈̭̼̗̭̯̰̰̖͈̗̾͂̿́͌̎̈̅͗̋̃̃̕͜͝͝P̸̶̢̯͙̈͊͌͌͗̏̃͜͝͝ò̘̑̌̋͜Ķ̶̴̸̧̨͈̫̭͚̗͈̯͎̀̍̏̔̋̈́́̕͜͠o͝()Ljava/lang/String;

    move-result-object v47

    invoke-static/range {v47 .. v47}, Lcom/kashi/settings/view/StorageProgressBar;->oe̡̢̛̠͕̖͌̿̆͒̓̐aľ̸̴̢̧͈̠̯̭̥͓̱̾͒̍͒͗̋͜͝n̷̶̦̲̙͚̥̪͉̥̼̯̈̑̅͘h̶̸̶̶̨̧̢̪̖̱̙͈̾̃̋́̂̒̅̓͊͜ĉ̨̛̛̪̖̦̫̗̫͚͚̞̌̆̑͂̑̈̎̐͆͑̽͘͘̚͘͜K̷̸̵̛̫̺̹̗̲͓͉̋̓̍͒̍̊̈̄̌̽͜͜͝͝͝ç̸̲̠̗̱̫̖̫̗̱͚̫͈̱̹̈̍̄̃́͌̔̀͌͗̓̋̑̂̿̈̍̈́̈̔̿̕̚͝͠͝ȃ̤̟͈̖͙͂͑͘͝o̷̦äB̵̛̄̿̃̀́̎̾͑K̸̻̱͑̋h͗ṯo̧̠̺͙͂̈́̍̋K̷̷̶̗̱̹͉̹̄̌̈́̒͐̋̃̊̃͒̈́̈́̔̌u̸̴̧̲͐̚B̶͌ǘ̶̸̧͚̮̥̻͎̩͕̜̙͚͓̩̭͑́͗̌̋́͆̂̋̀̏̈̏̐̃͝͝͝͝l̨o̷̧̧̼̠(Ljava/lang/Object;)I

    move-result v47

    xor-int v49, v49, v47

    const v50, 0x1ac8e6

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->ǎ̸̷̧̺̼̻̤͈̱̈͌̑͋͐͌͗̽̌̃͐́̾̈́͘͘͝P̴̴̨̤̬͋̈́͗̍̋̎̿̕͜͝͝ͅḽ̵͈̰͚͎̯́̎̐̃͜͠ķ̺e̝̬̼͐̈â̸͘͜ļ̷̶̶̴̧̢̛̛̬̻̥̖͈͓̗̗̺̰̖̘̫̻̺̹̰̫͉̦̾̋̈̅̔̎̀͑̾̃͋̌͋̆͆̈̑̈́̈́̄̏͋̾̈̿̋̃̅͑͋̑̽̌̌́͌̂̈́͘̚͜͜͠aę̸̷̵̵̶̧̧̛̻̫̤̲͖̱͓̦̤̘̰͚̲̠̩̮̦̘̬̞̤̭̤̮͉̫̙͈̠̠̊̀͗͐̄̎̓̃̑͒̾̃̂̿̑̋̄́͑̍̂͋͗̃̿̎̌̀̒̏͗̎͌͗͒̚̚͜͜͜͜͝͝͝͝͠͝͝ǩ̫͕͚͎̠̎̅͝Pn̨̧̢̙̹̯̞̦̱̼̗̟̤͙̘̝̗̮̑̄̿̈͋̋̎̃̑̆͑̀́̂̋̌̈͘K̶̶̥̬̭͇͋͑̍̀̀̂̂͘͝()Ljava/lang/String;

    move-result-object v47

    invoke-static/range {v47 .. v47}, Lcom/kashi/settings/view/StorageProgressBar;->oe̡̢̛̠͕̖͌̿̆͒̓̐aľ̸̴̢̧͈̠̯̭̥͓̱̾͒̍͒͗̋͜͝n̷̶̦̲̙͚̥̪͉̥̼̯̈̑̅͘h̶̸̶̶̨̧̢̪̖̱̙͈̾̃̋́̂̒̅̓͊͜ĉ̨̛̛̪̖̦̫̗̫͚͚̞̌̆̑͂̑̈̎̐͆͑̽͘͘̚͘͜K̷̸̵̛̫̺̹̗̲͓͉̋̓̍͒̍̊̈̄̌̽͜͜͝͝͝ç̸̲̠̗̱̫̖̫̗̱͚̫͈̱̹̈̍̄̃́͌̔̀͌͗̓̋̑̂̿̈̍̈́̈̔̿̕̚͝͠͝ȃ̤̟͈̖͙͂͑͘͝o̷̦äB̵̛̄̿̃̀́̎̾͑K̸̻̱͑̋h͗ṯo̧̠̺͙͂̈́̍̋K̷̷̶̗̱̹͉̹̄̌̈́̒͐̋̃̊̃͒̈́̈́̔̌u̸̴̧̲͐̚B̶͌ǘ̶̸̧͚̮̥̻͎̩͕̜̙͚͓̩̭͑́͗̌̋́͆̂̋̀̏̈̏̐̃͝͝͝͝l̨o̷̧̧̼̠(Ljava/lang/Object;)I

    move-result v47

    xor-int v50, v50, v47

    invoke-static/range {v48 .. v51}, Lcom/kashi/settings/view/StorageProgressBar;->ǎ̿̚͘l͑ḩ̸̫̤̯̻͈̹̼̗̙̺̜̹͈̅͋̾̄͑̈́͌̅̑̈̎͋͗̔͗̀̂̉e͈̭͓͌̃̾̈ȩ̱̫̀̄̔̋́͗̈u̮n̢̦̅̑̑́͜͝l̵̺͎̗̯̂͗̏ö̴̮̘̋̂̏̎̏̂͘̚͜͝͝͝a̛͙̙̥̦͎͇̤̅̌̌̌̇̈́̌̌̽̅̈́͜͠ê̸̢̧͉̫̩͒̂̂̈́̈͝ą̛̫̫͎̩̦̮͋́͋l̪̭̥͓̆̃͐K̥̲̦̐̈́ļ̴̶͚̰͙͉̦̲͈̦̻̲͒̾̑̎̑̆͐̾͜͠͠͠͝͝͠͝ḩ̵̵̛͈̲̩̬̞͓̻͙̩̺̆̿̈́́͌͝͠ã̷̛̼͓̑̈̑̉͑̑̌̈̕o͂lP̷̴̨̛̛̛̠͈͉̻̟͎̹͈̮͙͚̞̺̮͎̹̟̈̽̂̂̂͌̈͗̅̋̒͜͜͝B̸̸̷̢̧̢̼͎͎̫̗̥͉̫̹͑̃̎͒́͌̋͊͗̑̔͊̈́͂̚͝͝(Ljava/lang/Object;III)Ljava/lang/String;

    move-result-object v48

    move-object/from16 v10, v48

    invoke-static {v12, v10}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->K̈́ñņ̶̵̸̷̢̢̛͚̥͎̟̱̭̫͈̼̗̗͈͈̖̌̐̋͑͋̃͌̋̇͂͗̉̃͐̈́͌̊̎̎̚̚͘͜͠͠ͅo̵̖̱̫̥͆͒̿̈́̈́̊̕͜l̩̯̺̗̺̙̲͙̀̈̋̿͗̋a̭̗͜P̷̢̡̱̤̖͉̩͉͙͓̘͚̃̿͝h͈͚̲͂̆̏c̸̰̼̗̥̯͎̫̄͋͝k̡̯̂͋a̸͙̘̫͓̰̎̏̋̆͊t̸̩͙̲̘̫̮̺̅̎̈́̄̈̑͊̌͐̌̆͘̚̚͘t̴̰̗͎͖̖̺̰̘̮͙̘̅͗̿͐̂̍̌̀̒̕͜͝͝͝ṉ̢̫̮̺͚͈̻͚̰͚͑̾̌̌̏̈́̌͊̒͠o̸̧̗͓̙̜̙̐̈́̑̎̎͗̑̿̃̿ͅâ̷̷̶̯̤̫̫̭̋a̶͋͂̋K̛̯͙͓͕̲̦͊̈pa̸̶͓͚̙̫̍̃hȩ̧̧̡̛̛̘̫̩̥̮̩͓̖̌͋̓͑͊͊͜͜e̷̢͖̾͂͗͜͜(Ljava/lang/Object;Ljava/lang/Object;)I

    move-result v2

    invoke-static {v12, v2}, Lcom/android/settings/device/ò̌͝à̡̧̛̛̭͚͚̦̟͙̹̑͠a̷̸̷̸̡̧̧̛̛̛̰̭͙̲̖͚̘̼̫̥̖̹̘̰͎͎̟͎͈̯̫̘̋͌̌̂̃̈́̐̂́́̑̉̀̌͐̎̿̍͌̌̀̈̃͘̚̚͝o̦͝Pă̧̧̠̹͈͎͓̘̺̯̤̐͂̋̌̿́̈̿͜͠ǎ̴̧̗̟̹̂̂̂â̸̧̱͙̄̌Ķ̴̹́̈́̒͋̎̂͌͠ö̧̬̜̱̮́̎̏͂̚͠o̺c̥̫̎͌B̴̨̛̛̭͈͈̭̍̑̏͐̒̎̂̚͠k̸̸̢̢̥͕̹̯͚̦͇̱̩̙̰̀͗͋̅c̴̵̢̢̲̻͋̔̃͗͋͜P̸̴̪͈̹͓̯̭̗͚̦͎̦͈̫̯̗̥̤̌̈̂̐̋͌̌̐̑̌͂͑̔̏̔͒̂͗̐͘͜pc̈́̿e̱̥K͑͑̉̑̆͌͝͝ḵ̴̶̛̮͓̫͈̫̺̩̺̤̱̫͓͈̠̀̌͗̂̅̒͌͋́̉͑̌͋͒̋̌̐͝;->P̸̢̜͚͓͎̲̮͈̔͌̉̎̾͘̚K̍̈͒͘͘͝c̸̯̹̝̈́̕l̶̸̨̢͈̩̺̈̿̀͜͜a̯͚̿̀l̦̩͎̹͈͌̂̃͂̈ln͖̦̯̭͉̏͐͠ǫ̴͓̐ļ̸̸̴̧͖̞̺̪̭̺̏̍̄̎̾̌̃͗͜͝e̶̢͎͕̥̋̂t͖̾̐̃͠n͓͝t̩͎͓̭̏K̶̷̸̸̵̨̧͈̯̯̲̤̭̹̂̐̈́̈́̎̀̓͌̌͒͐̐͋̚͝͠ͅţ̶̶̡̛̛͈̫̮͙̤͓͐̈̾͘͠ȃ̸̸̧̧̡̧̛͚̤̙̖̖̩̤̱̙̘͉̫̭̙̰͗͊̈́͑̾̌̌̅̔͋͒͗͘͝k̵̛̭̉̌ȁ̶̶̶̦̩̤̲̰͉̖͒̄̎̃̈̈̂͜o̧̖̪̦̹͌̇́̅̉h̵̸̩̯͗̍̓̃̽̎̃̂ů̸̠̥̌͑̈́͌Kp̗͚̮͒̆͝ḩ̥̝̋͝o̷̷̿̃͘͠p̢̼̫͎̻̂͌̾̋̌͝(Ljava/lang/Object;I)I

    move-result v12

    invoke-static {v0, v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->õļ̴̸̨̗̹̪͚̰͈̭̿̂͗̂͊̄̃́e̸̛̘̯̓̀́̄͘͘c͎̝̍́̀͗̎P̶̸̸̴̷̶̛̛̘̭̪̖͚̦̻̫̜̔̈́̑̐͌̋̅̌͑̾̃̂̉͋̍͋̌͋̔̄̅́̾̈͘͘̚͜͜͝l̫̗p͎̫̱͜ȗ͓B̦̂͌͜l̶̹̔̌ą̷̗͈̭͉͓͚̞̰͙͈͉̲̀̃̔̐͗̇͗͝ͅn̴̗͕̲̺̈̇͋̎͜B̧u̶̸̠̹̼̹̫͆͊̌̒́̾͜͝͝a̛̦͕͉͋̌ḱ̸̴̢̬̺̂͋͝Ķ̴ḁ̶̻̰̭̾̋̾̓͠o̱̥̻͕͉̯͎͋͗̆͗̚͜ĕ̸̢͉̹̰̎͂̋̃̆͑͝͝ͅuP̸̢̰̬͎̗͌̈́̆̈̅̈́̃͘͘͜͜͝͝͝K̨̢̨̛̛̭͉͕̗̗̫̫̭̬̈́̒̌̑̋̆̃̎̀̈̉̑̑̌̈́͋̆̍̉͜͝͝a̧̛͕̹̼̰̫̼̫̅̅͂̚̚͜(Ljava/lang/Object;I)Landroid/graphics/drawable/Drawable;

    move-result-object v1

    const/4 v2, 0x1

    invoke-static {v0, v2}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->õļ̴̸̨̗̹̪͚̰͈̭̿̂͗̂͊̄̃́e̸̛̘̯̓̀́̄͘͘c͎̝̍́̀͗̎P̶̸̸̴̷̶̛̛̘̭̪̖͚̦̻̫̜̔̈́̑̐͌̋̅̌͑̾̃̂̉͋̍͋̌͋̔̄̅́̾̈͘͘̚͜͜͝l̫̗p͎̫̱͜ȗ͓B̦̂͌͜l̶̹̔̌ą̷̗͈̭͉͓͚̞̰͙͈͉̲̀̃̔̐͗̇͗͝ͅn̴̗͕̲̺̈̇͋̎͜B̧u̶̸̠̹̼̹̫͆͊̌̒́̾͜͝͝a̛̦͕͉͋̌ḱ̸̴̢̬̺̂͋͝Ķ̴ḁ̶̻̰̭̾̋̾̓͠o̱̥̻͕͉̯͎͋͗̆͗̚͜ĕ̸̢͉̹̰̎͂̋̃̆͑͝͝ͅuP̸̢̰̬͎̗͌̈́̆̈̅̈́̃͘͘͜͜͝͝͝K̨̢̨̛̛̭͉͕̗̗̫̫̭̬̈́̒̌̑̋̆̃̎̀̈̉̑̑̌̈́͋̆̍̉͜͝͝a̧̛͕̹̼̰̫̼̫̅̅͂̚̚͜(Ljava/lang/Object;I)Landroid/graphics/drawable/Drawable;

    move-result-object v0

    if-eqz v1, :cond_7f

    invoke-static {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̷̷̢͉̫͎̘̂̂a̧o͈̺̍ớ̧̺̱̺͎͋̔̈́͆̿̂͌̍̈́̚͝oK̢̮̋͑K͉̤ǫ̱̂̿ơ̵̷̶̸̷̢̡̢̨̡̧̱̼̹͎̲̙͈̦͇̫̖̺̱̘̫̩̗͇͎̩̤̈͗̈͂̿͒͌͑̋̏͊̍͊̃͑̎̅̑͑̋͗͜͜͜͜͜͝͠͝͝͝͝͝͝ṋ̸̈́ą̸̵̷̧̛̱̲̫̭̹͓͕̬̝̘̠̺̭̖͙̮̤̻̰̹͌̄̄̂͌̅̔̀̑̑̂͗̔͋͘͜͜͝͝͝K̤̇̉͝P̵̰̮͚̯͕͎͈͕͋̈̅̈͌͗̈́͝a̸̸̧̺̼͈̥͑̈́͑̿͋̋̈͜P̄͌͠K̸̷̢̛̛͎̈̂̋͗͘a̹͠K̵̸̢̧̨̨̟̗͚̯̥̙̯̝̇̍̋̈̂̇͌͑̆̈̆̽̾͗́̆̆̃̌̏͑̏̚̚͜͝luȃ̷͓͊̋̄̋͐͘̚ǎeK̛̠̪̫̪͓͚̝̼̓̈́̆͋͗͜()Landroid/graphics/PorterDuff$Mode;

    move-result-object v2

    invoke-static {v1, v12, v2}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->l̛͙͕͚̺͎͚̫̋̑͗̎̅ḩ̟͌͂̃͜B̋ȏ̗͚̀̎͘P̺l̾̉͠͝p͇̥â̸̸̶̸̧̛̛̩͈̹̗͕͉̦̤̦̹̝̤̗̺̘͌̔̔̆̆̑͑̋̿͑̒̂̂̌̿̈̈́̒͋̌̅͋̋͘̚͝͠͠aê̸̶̷̸̫̥̥̮̭̗̫͚̮̭̼͎̩͙̂̃͊̿̅̌͂̏̚͘͝͠a̴̡̧̢̛̛͙̫̥͉̗͎̻̯͚͓̭͚̹̫̼̮̭͉̹̙͉͚͎̭̹̾͂́͆̽̅̏̾͗͐̌̑͑́̂̊̑̀͗̍̃̀́͘̚̚͜͜͝ȩ̷̷͙̭͉̺̠̫̦̯͑͌͋̏̔̌̑̿͠͠k̸̊a̶̷̢̧̛̦̯̗͚̠̻͈̋͑̏͑̑́̾̈̚͜͝K̮͉̘̻̫͎̋́͌͊̑p̸̶͕̹̹͇̅̈́̏͋̈́c̷̷̸̴͓͕͚̤̹̓̂̅̀̅l̷̷͕̽͋̿̔̌a̧͠n̮u̖̐̑̚ṋ̶̛ơ̚(Ljava/lang/Object;ILjava/lang/Object;)V

    :cond_7f
    if-eqz v0, :cond_88

    invoke-static/range {}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->p̷̷̢͉̫͎̘̂̂a̧o͈̺̍ớ̧̺̱̺͎͋̔̈́͆̿̂͌̍̈́̚͝oK̢̮̋͑K͉̤ǫ̱̂̿ơ̵̷̶̸̷̢̡̢̨̡̧̱̼̹͎̲̙͈̦͇̫̖̺̱̘̫̩̗͇͎̩̤̈͗̈͂̿͒͌͑̋̏͊̍͊̃͑̎̅̑͑̋͗͜͜͜͜͜͝͠͝͝͝͝͝͝ṋ̸̈́ą̸̵̷̧̛̱̲̫̭̹͓͕̬̝̘̠̺̭̖͙̮̤̻̰̹͌̄̄̂͌̅̔̀̑̑̂͗̔͋͘͜͜͝͝͝K̤̇̉͝P̵̰̮͚̯͕͎͈͕͋̈̅̈͌͗̈́͝a̸̸̧̺̼͈̥͑̈́͑̿͋̋̈͜P̄͌͠K̸̷̢̛̛͎̈̂̋͗͘a̹͠K̵̸̢̧̨̨̟̗͚̯̥̙̯̝̇̍̋̈̂̇͌͑̆̈̆̽̾͗́̆̆̃̌̏͑̏̚̚͜͝luȃ̷͓͊̋̄̋͐͘̚ǎeK̛̠̪̫̪͓͚̝̼̓̈́̆͋͗͜()Landroid/graphics/PorterDuff$Mode;

    move-result-object v12

    invoke-static {v0, v13, v12}, Lcom/android/settings/device/K̀͘ṍ̷̸̯͚̘̹̦̱͈̝͙̠̼̫̲̰̦̓̓̈́̾̋̑̒͊͐͌̓̚ŭ̂ṵ̶̡̖͈̱̫̮̥̠̝͑̅̄͐̓͋͋͒͌̌͜͝͠͝B̗̹͌́̋̂͐͗̑͠ù̴̢̯̰͓̽̈́̓̿́̆͗ō̧̢͉̫̯̥̯͈͈̺̲̲͗͆͌̎͗̉̍͌͐͌͊̑̔̌͘͜͝͠ò̴̧̡̘͚̋͜ö̸̺̪̼̹͎̔̇͘͝ę̲̩̻̈́̽̐ͅo̧̡͓̲͈͗͗̅͝ä̢̧̧̫̘̖̭̪̦̲͓̤̭̹͎̦͚̺͎̮̮͚̯̞̭̮́̆̈́̌̋͗͂̀̏͐̾̈́̋̈́̃̔͘͘͜͠͝͝͝u̸̠̫̦̺͈̱͐̌͒ỗ̸̝͕͎̻͌̄͑̎͘u̷̵̴̧̨̨̩̗͉̫̯̲̺̭͙̹̯̗̱̤̠̦̱̫͓̩̺̬͌̌̏͌̅́̋̀͑̾̈́̈̃̌̽͌͆̑̈́̂̅͑͗͐̏͆̌͋͗̂̂́̚̚̕͝;->l̛͙͕͚̺͎͚̫̋̑͗̎̅ḩ̟͌͂̃͜B̋ȏ̗͚̀̎͘P̺l̾̉͠͝p͇̥â̸̸̶̸̧̛̛̩͈̹̗͕͉̦̤̦̹̝̤̗̺̘͌̔̔̆̆̑͑̋̿͑̒̂̂̌̿̈̈́̒͋̌̅͋̋͘̚͝͠͠aê̸̶̷̸̫̥̥̮̭̗̫͚̮̭̼͎̩͙̂̃͊̿̅̌͂̏̚͘͝͠a̴̡̧̢̛̛͙̫̥͉̗͎̻̯͚͓̭͚̹̫̼̮̭͉̹̙͉͚͎̭̹̾͂́͆̽̅̏̾͗͐̌̑͑́̂̊̑̀͗̍̃̀́͘̚̚͜͜͝ȩ̷̷͙̭͉̺̠̫̦̯͑͌͋̏̔̌̑̿͠͠k̸̊a̶̷̢̧̛̦̯̗͚̠̻͈̋͑̏͑̑́̾̈̚͜͝K̮͉̘̻̫͎̋́͌͊̑p̸̶͕̹̹͇̅̈́̏͋̈́c̷̷̸̴͓͕͚̤̹̓̂̅̀̅l̷̷͕̽͋̿̔̌a̧͠n̮u̖̐̑̚ṋ̶̛ơ̚(Ljava/lang/Object;ILjava/lang/Object;)V

    :cond_88
    return-void
.end method

.method private setStorageLevel(I)V
    .registers 53

    move/from16 v1, p1

    move-object/from16 v0, p0

    invoke-static {v0, v1}, Lcom/kashi/settings/view/ḩ̮̑͐k̛̖̂͐k͈̚ǒ̭̱k̛̠͙̜͒̋͌Ķ̷̴̸̶̵̨̢̧̛̫̗̲̖̼̭̩͈̱̰̫̭̈́̑̑̐̾͒͋̿̃̈́̎͋̒͗̌͗̕̚͜͝͝c̛̠̗̯̥̠̫͌͊̈̂̂̔̅̄̋̀͊͜͠͠K̷̶̵̰̼͉͎̩̼̙̩̰̪̋͂͆́̌̃͌͑̑͘ǎ̵̛̘͚͓̙͉͉̝̪̦͌̃̋̂̿̾̆͒̅̿̈́̂̆͑͑̎͑͗̋̐͝u̸̵͉͇̘̺̪͎̫͓̠͖̭͒̏̈͑̈́̈̌̅͗̌͌̂̎̔́̃͜͝͠l͗ǒç̹̼̭̮̫̫̟͓̊̋̚͠ṱ̸̸̷̷̸̶̴̸̥͕̭̮̝̥̠͚̘̠̺̂̆̂̿̌̀̈́̋̆͑̾̊̐͂̋͗̂̕͜͠hc̦͙̑̆̈t̍ť̸̸̛̫̗̗̅́͐͌͘͝a̢̨̛̪̗͉̺̺̗̰̦͈͎̘̮͌̂̅̄͗̌̎̌͑͌͌̕͜͠͝͝t̮͑͝;->a̡͚̗͎̻̞͚̰̦̖̺̦̹͋̎̍̃͌̀̅̏̏̀̆͗̚͝͝ͅa̗̮̺͚͋͝á̇͝n̰̋͘K͓̙̲̞̻̯͎͗͊͗̏̀͐̈̑̂̃̔̐͌̚̕͜͜͜͝p̯̺̹͙K̮̽̈́͗́̿͌͑̈́͌̈͂͝p̶̶̸̡̮̺̲͓͜͝͝c̸̶̢̛̹̟̫̠͎̹̰͙̜̺̭͚̺̜̄̂̈̌̎̏́̊̆͗͐̄̂͌̌̿͑̈́̓̿̏̚͝͝o̸̸̷͎̜͗̂̃c̡͎̩̼̯͎͓̥̫̑̂̌̿͆̾͌̔͗̈͂̈́̎̐̏͘ͅp̱Ķ̯͖̥͙̼̆͒͐̿̀͝c̝͘a̼̥͠c͓l̷̰͙̜͕̭̔̋̔ḁ͉̈́̿̑͝ua͜͝B̛̰ā̸͉̙̜̺̱̖̦͓̦̽̋̚͠ǩ̷̶̸̢̡̢͈̯̹̫̯̭͈͚̗̠̱͉̬͙̙̦̹͎͉͎̰͊̈́̿̌͗̔́̃͗̅̂̿͐̈́̃̋̆͑́̌̃̐͘͘͝(Ljava/lang/Object;I)V

    return-void
.end method


# virtual methods
.method protected onAttachedToWindow()V
    .registers 52

    move-object/from16 v0, p0

    invoke-super {v0}, Landroid/widget/ProgressBar;->onAttachedToWindow()V

    invoke-static {v0}, Lcom/kashi/settings/view/StorageProgressBar;->P̴̸̧͚̝̪̥̩̅̿̋̅̿̐͋̈́̋̊̊̋̋̕͜͜͝pč̭̃̌̔͝c̴̦̫̙͚͇͙̫̱̾͂̈̈́͌̅̌̃͋̂̈̈̃̑͗̚͜͝ķ̛̯͈̯̫̱̠̗̦͎̗̻̺̠̫͓̮̺̗̯̙̀́̆̌̂͗͋͆͐̎̀̔͘͠K̸̶̢̥̯̱̯̥͒̈̎͋̉̏͘͜͠ļ̸̴̱̗̞̮̗̫͈̦̲̗͙̍͑͑̎͆̑͌̋͝͠ë̴̢̜́̃̈́̌͌Ķ͗̈͑͂̑̈͗K̴̴̶̴̯̮͕̞̞̱͈̫̜͚͈͉̥̃͂̓̂͑̄͋̎̒͜͠͠l̸̢̛͙̏̃̎̔͝͝ơ̸̷̧͈̬͙̼̼̲͕͉̲͗̿̋̈̾̀̌̔̋͗̉͌͋͋̋́̃̿͗̚͘͠͝͠͝ä̶̶̡̢̛̟̰̦̩̗͓̮͈̑̎̑̌͑̂͌͒̍̉̋̋̚͝͝͝ȇ̴̵̛̮̠̯̠̮̗̗̌̑̑̌͗̊̈́͘͝B͎̋̃̍̌͌͜(Ljava/lang/Object;)V

    return-void
.end method
